{
  "articles": [
    {
      "id": 385215496278,
      "title": "my 10 tips for a happy marriage!",
      "created_at": "2020-08-05T20:40:54-04:00",
      "body_html": "<p>This picture was taken 4 years ago today.</p>\r\n<p><strong>I was 36. Butch was 43.</strong></p>\r\n<p>We we celebrating our 10 year wedding anniversary. We had no idea now much our lives would change.</p>\r\n<div class=\"text_exposed_show\">\r\n<p>We would change our business, I would go to nyc for 8 weeks, a pandemic would strike! Who knew the madness that awaited.</p>\r\n<p>Today we celebrate 14 years of marriage and 21 years of togetherness. It hasn’t been easy. But it’s been tremendous. We’ve survived sickness, depression, death of pets and loved ones. We’ve created 3 children, we’ve had beautiful dogs, bought a home and taken amazing vacations to awesome locations. We’ve screamed on roller coasters and cried at the movies.</p>\r\n<p>We’ve had an epic love story. One that has made my adult life amazing.</p>\r\n<p>So I thought I’d share some of my tips for blissful commitment <span class=\"_5mfr\"><span class=\"_6qdm\">😂</span></span></p>\r\n<p>1. Time apart is not a bad thing. Butch snores and we’ve never shared a bedroom! That means when we are together it’s by choice, not default. He has his life. I have mine. It’s good.</p>\r\n<p>2. It’s ok to fight and forget about it. No sorries. No grudges. Just let it go. Sometime people just burst. It’s not meant to be mean or intentional. It’s just a speed bump. Let it roll on by.</p>\r\n<p>3. Go on adventures. I know we are locked down right now but when we aren’t. Adventuring and seeing new things for the first time together is amazing.</p>\r\n<p>4. Cuddle whenever you can.</p>\r\n<p>5. Dream together. Even if they never come to pass. It’s fun to imagine what could be.</p>\r\n<p>6. Hold hands</p>\r\n<p>7. Don’t take things too seriously. Marriage is friendship first. Laugh before you fight.</p>\r\n<p>8. Tell the truth. always. Lies destroy relationships faster than any mistake. Mistakes you can survive. Lies not so much.</p>\r\n<p>9. Spend time with other people together.</p>\r\n<p>10. It’s ok to be wrong. It’s not the end of the world. Just the end of the conversation</p>\r\n<p>I’m so lucky to be married to this guy!</p>\r\n<p>What are some of your tips for healthy relationships?</p>\r\n</div>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-08-05T20:39:00-04:00",
      "updated_at": "2020-08-05T20:47:17-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "my-10-tips-for-a-happy-marriage",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/385215496278",
      "image": {
        "created_at": "2020-08-05T20:47:17-04:00",
        "alt": "",
        "width": 720,
        "height": 960,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/116788345_10163850819570459_5411437761783982366_n.jpg?v=1596674837"
      }
    },
    {
      "id": 385094680662,
      "title": "No more excuses",
      "created_at": "2020-07-07T10:43:32-04:00",
      "body_html": "<span>One of the things I am not great at doing is going live for our business. I<strong> KNOW it is important,</strong> but i put it off and before I know it months have gone by. It's a source of constant <strong>disappointment</strong> for me because I realize how important it is, but I <em>don't prioritize it. </em></span><br><br><span>The main reason is because my boutique is constantly a mess because it’s a small space and as you all know, <em>small spaces get messy. Fast.</em> We use the space for everything related to our business and instead of just sorting it out, I take over other parts of the house to make room for XYZ task I can't do in the boutique because its <strong>messy</strong>, and that just means more clutter piling up all around me. </span><span class=\"text_exposed_show\"><br><br>So I avoid going live because<em> I avoid cleaning.</em> And as a result it affects my business, the rest of my house and my overall <strong>state of mind. </strong><br><br>Well! Yesterday <span style=\"text-decoration: underline;\"><strong>I decided the era of excuses is over!!!</strong> </span>My son helped me and we tackled the giant mess and created this wall facing live area. Now, no mess to clean up. It’s a wall<span> </span><span class=\"_5mfr\"><span class=\"_6qdm\">😂</span></span><span class=\"_5mfr\"><span class=\"_6qdm\">😂</span></span><br><br><span style=\"text-decoration: underline;\">This looks like a simple task</span> after all there’s not a ton there. But man. <strong>This was work!</strong> The amount of stuff we had to move, purge and organize was massive. We tackled the task together, <em>one piece at a time.</em> While doing it, i will admit it seemed as if we were going <strong>backwards</strong>. The mess was growing, the piles looked worse as we rearranged and experimented. But, we just kept at it. And by the end, <strong>we had success!</strong><br><br>Both of us are sore today. But it is a great sore!! The kind where you <strong>earned</strong> every ache and feel accomplished! The space feels good, and so does my heart. <br><br>Sometimes we don’t do things because <em>we haven’t created an environment around us that supports the doing of said thing</em>. Maybe you want to learn to cook new food but your kitchen is a mess so you don’t. Maybe you want to try yoga, but you don’t have a space that’s peaceful and calm to try it.<br><br>Any number of reasons keep us from doing things we know we should, or know we want to do. And many times creating an organized, clean and easy to maintain space is all takes to help get things going.<br><br>What area would you like to organize so you can DO something you really want or need to do?!</span>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-07-07T10:46:00-04:00",
      "updated_at": "2020-07-07T10:46:39-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "no-more-excuses",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/385094680662",
      "image": {
        "created_at": "2020-07-07T10:43:32-04:00",
        "alt": "",
        "width": 1536,
        "height": 2048,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/106356681_10163716270840459_5239699706207807854_o.jpg?v=1594133012"
      }
    },
    {
      "id": 385083408470,
      "title": "Who knew a messy house made for a messy mind!",
      "created_at": "2020-07-03T22:19:20-04:00",
      "body_html": "<p>As I continue my self-care journey in July, today was about small steps towards a cleaner home. This is my kitchen before and after...</p>\n<p>Yes, my kitchen is an embarrassment. Like what a mess. And it's not like I don't clean it!! buuuuuut....</p>\n<p><strong>I have 3 kids</strong> and no matter how much they clean or I clean, <strong>5 people and 2 dogs living in one house just makes. Mess!!</strong></p>\n<div class=\"text_exposed_show\">\n<p>My soul is sad when I’m surrounded by a mess. It makes me feel chaotic inside. I can’t really describe it but it’s, <span style=\"text-decoration: underline;\">agitated and I can’t rest or feel at ease</span>. Like my mind is a muscle having an unending spasm.</p>\n<p>But cleaning is also hard on my back. My kids help a lot. But they can’t do as much as I can. So today I decided, to calmly clean the kitchen. <em>It’s not perfect.</em> But everything is put away, the counters are clean and crumb free and the sink is empty and the floor is swept and mopped.</p>\n<p>Things like this feel like a huge victory. And then I just want to keep going!! But my back says no<span> </span><span class=\"_5mfr\"><span class=\"_6qdm\">😂</span></span><span class=\"_5mfr\"><span class=\"_6qdm\">😂</span></span></p>\n<p>Maybe tomorrow I will try again.....</p>\n<p>Maintaining a clean living space is so important to mental health. In fact, according to psychology today, people with clean homes are <strong>healthier</strong> than people with messy homes! They found that a clean home was an even <strong>bigger indication of health</strong> than the walkability of a neighborhood! They also found that women who described their home as messy or cluttered were<strong> more likely to be depressed</strong>, and complain of not feeling rested. Those same women also had higher levels of the stress hormone, cortisol. Princeton did a study that showed people with messy or cluttered homes were less likely to maintain focus on a task!</p>\n<p>Further studies by the national sleep institute found people who made their beds were <span style=\"text-decoration: underline;\">19% more likely to report better more fulfilling sleep</span>! Heck I think we could all use that<span> </span><span class=\"_5mfr\"><span class=\"_6qdm\">😂</span></span></p>\n<p>Now of course it’s difficult to say what came first. Do people have messy homes because they are depressed or are they depressed because their homes are messy? I’m sure it’s a mixed bag.</p>\n<p>But the good news is that science shows the <strong>very act of cleaning</strong> helps <strong>reduce</strong> stress levels by a whopping <strong>20%!!!</strong></p>\n<p>In the next few weeks I will share some of the strategies that I will test to maintain a cleaner home. But in the mean time, tell us your thoughts on cleaning. Do you struggle with keeping your house organized or have you mastered it? Does mess make you crazy or are you fine either way??</p>\n<p> </p>\n</div>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-07-03T22:19:00-04:00",
      "updated_at": "2020-07-03T22:19:40-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "finding-balance-thru-cleaning",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/385083408470",
      "image": {
        "created_at": "2020-07-03T22:19:20-04:00",
        "alt": "",
        "width": 2048,
        "height": 2048,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/106552294_10163700840115459_6990127531196997689_o.jpg?v=1593829160"
      }
    },
    {
      "id": 385078526038,
      "title": "Drink yourself to better health",
      "created_at": "2020-07-02T20:08:07-04:00",
      "body_html": "<p>I decided that July was going to be my month for self-care, so today was day 1 of goal setting. I set a goal to drink these 3 bottle of water…….</p>\n<p>So far I am failing <span>😂</span> <br><br>I’ve finished 1! But 2 remain, the night is young though so I am going to push to finish strong. <br><br>Let’s talk about why hydration is so important.</p>\n<ul>\n<li>Let’s start with vanity first. Water makes your skin glow. When we hydrate it helps keep our skin be supple and dewy, helps to prevent wrinkles and as a toxin flusher it helps minimize blemishes.  </li>\n<li>Water helps the body absorb nutrients. Water aids in dissolving the mineral and nutrients that we ingest, and when they are dissolved our body can better metabolize them. Cool right?</li>\n<li>Water helps flush toxins out of your body by supporting adequate kidney function. While water wont magically kill toxic stuff we ingest, it helps your kidneys work, and flush those yucky things out of your body when you pee. Yay for water! </li>\n<li>Water helps your brain function better. Did you know the brain is 75% water? When your brain has adequate hydration you will think more clearly and have better focus. Water also helps deliver nutrients to your brain to help it stay strong and healthy. Rad!! </li>\n<li>It helps lubricate your joints so you can move better! The synovial fluid that lubricates your joints is made up of, you got it, mostly water. This magical fluid helps reduce friction when we move around and helps keep surrounding muscle and tissue healthy. </li>\n<li>Helps with digestion! Water and other liquids in your gut help to break down and digest that food you just ate, and helps keep everything, how shall we say…moving easily LOL. Water also helps to keep things moving in your intestines and helps us absorb nutrition from our meals. </li>\n<li>It’s great for weight loss and energy. Water can help suppress your appetite (if consumed before meals,) and it helps you burn more calories. Drinking water can also help you get rid of stubborn fat by increasing your metabolic rate by up to 100 calories a day (according to healthline.)</li>\n</ul>\n<p>I mean do you need any more reasons to keep yourself hydrated??!</p>\n<p>So grab your water bottles and hydrate yourself with me!!! I may get up to pee all night since I didn’t pace my drinking during the day but whatever!!</p>\n<p>Do you struggle with water intake? If not, what are some tips you can share to help others hydrate better!!</p>\n<p> </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-07-02T20:08:00-04:00",
      "updated_at": "2020-07-02T20:08:20-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "drink-yourself-to-better-health",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/385078526038",
      "image": {
        "created_at": "2020-07-02T20:08:07-04:00",
        "alt": "",
        "width": 2048,
        "height": 1536,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/80274609_10163696327105459_5947761760575942901_o.jpg?v=1593734887"
      }
    },
    {
      "id": 385074790486,
      "title": "Finding the Will",
      "created_at": "2020-07-01T17:09:58-04:00",
      "body_html": "<p><strong>Oh hello there, tuft of grass. </strong><br><br>Looking at this picture, it doesn't look like anything worth noticing. It's grass. We see grass everywhere we look, at least in New England where I live. But grass like this is anything but ordinary, and should be anything but expected. <span> </span></p>\n<p>You see this grass is growing out of <strong>concrete</strong>. The environment surrounding it is not exactly hospitable to life; cars racing down and up the road all day long, it gets snowed on, beaten down by heat, ridden over by bicycles and tires. There is nothing about this spot that screams “GROW HERE,” and yet, life blooms; green and strong. <br><br>I learned to pay attention to this amazing phenomena when I read a book when I was just 16, Kitchen Table Wisdom, were the author encounters blades of grass pushing through the concrete streets of New York. She remarked, <span style=\"text-decoration: underline;\">what an incredible will to live</span> that grass had to struggle its way out of the beast of weight pushing against it, to find the warmth and light of the sun. <br><br>These last few months have been <strong>incredibly difficult</strong> in the shared history of the world. Our tiny planet that by some miracle floats in the middle of space and lives relatively unbothered has<span>  </span>been in <em>turmoil</em>. From wildfires in Australia, to a global pandemic and social injustice, <em>we find ourselves grappling with a new world and how to find our place in it.</em> Peace of mind and spirit is harder to come by than ever before and we have been forced to retreat from our cherished social interactions with our communities and our loved ones. While the world is no stranger to pain of epic proportion, this feels all consuming. <br><br>I personally have not fared well emotionally through this pandemic. As a recovering hypochondriac, the threat of an unknown disease based enemy certainly had the potential to crush me, but somehow I’ve been relatively calm on the outside, but I think deep down in my primal brain <em>I’ve been quietly terrified,</em> sad and maybe even depressed. Finding the will power to do even small things has been a crushing effort. And with no end in sight, my desire to pull myself out of it was low.<strong> Very, very low.</strong> <br><br>Then today I thought of the grass in that book I read so long ago. T<em>he blades of grass that push and push against incredible pressure and weight to break concrete and meet the sun</em>. We witness the end of a lot of effort, and a lot of will to live. What if I could be that blade of grass. We don't see the effort that goes on to get to that point. But the effort was there. <span style=\"text-decoration: underline;\">Unwavering, and everyday. </span><br><br>So today I forced myself to just do something productive and healthy. I dragged my unmotivated self outside, and I walked 2 miles with hustle. I sweat hard. I listened to really loud music, and I worked for courage. I earned my sweat. I felt tired a few times because I’ve been slacking but I just kept going. Step after step. <strong>If that blade of grass can do it, so can I, right?</strong> <br><br>This time last year, I don’t think anyone could have imagined that in just 365 days, our world would be virtually unrecognizable. While our current state is heartbreaking, it also means that 365 days from right now, <span style=\"text-decoration: underline;\">we could be looking at a world healed</span>, <strong>who knows what can happen in 365 days.</strong> If a tuft of grass can puncture concrete, who knows what time will bring for us if we just keep trying, keep pushing, keep striving for a better, healthier life. <br><br>I don’t know what the future holds for any of us, life is unpredictable and the pendulum can swing either way. But what I do know, is that <strong>I am here right now,</strong> and no matter what the state of the world, I have the power to live a better life, and I have the power to not be suffocated or held down, even by concrete. If that grass can do it. I can do it.<strong> </strong><br><br>I am declaring July my month of recovery. Of healing. Of believing in the possibility of a better tomorrow, even if that tomorrow is not this tomorrow. I will be patient, and I will keep pushing. <strong>I will find THE will. <br><br></strong>XOXO<strong><br>Saira</strong></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-07-01T20:00:00-04:00",
      "updated_at": "2020-07-01T20:00:08-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "finding-the-will",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/385074790486",
      "image": {
        "created_at": "2020-07-01T17:13:05-04:00",
        "alt": "",
        "width": 2048,
        "height": 1535,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/105678999_281071976446125_6835872590741126207_n_1.jpg?v=1593637985"
      }
    },
    {
      "id": 384213221462,
      "title": "My take on Corona virus....",
      "created_at": "2020-03-11T14:32:20-04:00",
      "body_html": "<p>I work in the retail industry, which means in December when the corona virus started impacting China, we started feeling it pretty quick. Our colleagues were unable to communicate with us, shipments were being delayed, they were on lock down for weeks, with schools being shut till the end of March! And now here we are, despite all the efforts of so many countries, Corona has landed on our shores. And today the WHO has declared it a pandemic. <br><br><strong>yikes. </strong><br><br>I've quietly read news reports, articles and watched the debate on social media about whether or not this is just media hysteria, political chess or some engineered virus designed to control population. <strong>So many conspiracies</strong>, speculations, under reactions and over reactions. It's been interesting to watch. <br><br>I believe everyone is entitled to their own opinions, and their own course of action in response to this now pandemic, and we all do what we feel is best for our families. <strong>But please let’s not downplay this as just another flu</strong> that’s no big deal. Countries don’t send people home and tell them to stay there and disrupt their entire economy over a simple flu. Harvard doesn’t remove students from dorms for nothing. Google doesn’t ask every employee in North America to work from home for the sniffles. The national guard doesn't deploy to a town just outside of NYC to help deliver food and supplies because of an over reaction. <br><br>Is it world ending? I doubt it. Will most people be fine? Probably. But, that won't be the story for everyone. There are people in your community who are sick with cancer, babies born early, elderly grandparents with health conditions. There are people who through community spread will not recover. <strong>It’s not just for me</strong> that I exercise caution. It’s for the person I could come into contact with who maybe isn’t able to fight something off. It’s for the person who isn’t healthy enough to brush it off as nothing.<span class=\"Apple-converted-space\"> </span></p>\n<p><span style=\"text-decoration: underline;\"><strong>The health and safety of our communities is only as good as the least concerned person among us.<span class=\"Apple-converted-space\"> </span></strong></span></p>\n<p>I would also encourage sensitivity. I see a lot of posts from people dismissing this as \"nothing to worry about\" and \"stop being so paranoid\". Just remember, as this spreads, <strong>chances are someone you know will be impacted</strong> and experience a loss of a loved one to the virus. Dismissing it as a passing cold is hurtful to those people touched by it, quarantined by it, separated from loved ones because of it, or trapped on a ship or away from work and home because of it.<span class=\"Apple-converted-space\"> To the people in Italy who can't have a funeral or attend church, it isn't nothing. To the people locked inside their homes in New Rochelle NY, <strong>this most certainly isn't nothing</strong>. They are probably afraid, isolated, and concerned for their own well being and the well being of their community members, they are probably concerned about the ability for their hospitals to handle an influx of patients if this gets out of control. Further more there are people diagnosed with it, <strong>more and more everyday</strong>. And those people are probably terrified. </span></p>\n<p><span style=\"text-decoration: underline;\"><strong>There are real people struggling on the other side of the keyboard reading the words of dismissal. </strong></span><br><br>Personally, I am concerned. <strong>Not because I am afraid we will all get sick and die,</strong> but because this experience demonstrates our infrastructure isn't quite ready for something like this, homes and families aren't ready for something like this. Most of my friends don't even have 5 days worth of supplies let alone 3 weeks worth. We live in a society that predominantly believes \"<strong>it won't happen to me</strong>.\" All you need to do is look at the shelves for toilet paper, or hand sanitizer to see the impact on our supply chains. I laughed at my husband a few months ago when he insisted we buy emergency food. I told him he was a quack and this was America for God's sake. Was he insane? <br><br><strong>Look who's laughing now....</strong><br><br>This disruption also highlights our reliance on goods made in other countries like China, where their shut down has direct and material impact on our own commerce. The benefits and costs of globalization are certainly felt when one of the main suppliers of our global economy is forced into a freeze. <br><br>I'm hopeful that this experience will put the world on notice. Basic hygiene and proper self care matters now more than ever when we live in a world where you can start the day in LA and end it in Beijing. We are carriers of germs, and while it may not affect us, it could very well take out the person sitting next to us who has an immune disorder. We need to cover our mouths when we cough, we need to wash our hands, we need to stay home when we are sick and stop going to work thinking we are harder working for pushing thru illness and showing up to <strong>prove</strong> we are the more committed worker. We need to revaluate <strong>how</strong> we do business and look for ways to build domestic manufacturing and diversify supply chains so we aren't tethered to lifeboats in singular nations. <br><br><strong>I am hopeful that this reminds people of what really matters in life.</strong> Google is telling people to stay home, and I say, bravo. Not because I think there will be an uncontrolled outbreak in their offices, but because it shows we can be aggressive, progressive and maximize the incredible technology we have to help people feel a little bit safer in an uncertain time. It's time to take stock and look at what the world is today, and what we want it to be tomorrow.<strong> Nothing gives people perspective like crisis</strong>, and I hope we can learn a thing or two about how we want our world to look by seeing how quickly everything we take for granted can be turned upside down on it's head. I doubt the people of New Rochelle expected to be living out something form a sci fi film. and yet, here they are. <strong>A new reality in a split second</strong>. <br><br>I had swine flu many years back. I had malaria as a child and almost died. I've witnessed my son have scarlet fever and burn at 106.5 degrees and worry about whether or not he would recover (thank god for penicillin!)I am no stranger to diseases that can kill you, or that can make you horribly sick even if they don't.  Just because most of us can be exposed to something horrible and recover, doesn't mean we should be laissez faire about it, because <strong>we live in a world that's about more than us. </strong><br><br>Prayers for health! </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-03-11T14:50:00-04:00",
      "updated_at": "2020-03-11T15:23:00-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "my-take-on-corona-virus",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/384213221462",
      "image": {
        "created_at": "2020-03-11T14:32:20-04:00",
        "alt": "",
        "width": 2048,
        "height": 2048,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/85216161_2425652554431807_6293879242023239680_n.jpg?v=1583951540"
      }
    },
    {
      "id": 383974342742,
      "title": "Time for better??",
      "created_at": "2020-02-03T09:55:23-05:00",
      "body_html": "<p>For centuries, human beings have enjoyed the arts. Whether it’s paintings, music, sculptures or dance, art has been a means for people to experience something new, think of the world in a new way, see things they haven’t seen before. Art has a long history of being provocative, sensual, inspiring and moving.<br><br>Art changes the world by inspiring dialog and discussion. <br><br>I’d say last night’s performance at the Superbowl half time show by Shakira and JLo did just that. Created conversation among people with diverse opinions. <br><br>I don’t know any more if I am the minority of the majority, but I personally found the show entertaining, fun and a screaming validation that women can be stunning creatures at any age if they choose it. Anyone who has ever taken a single dance class knows how difficult it is to make something so physically challenging look so easy and effortless. What we witnessed was the outcome of decades of hard work, commitment and dedication. It was a career culmination for these two artists who have been pioneers in the performing arts in our time. <br><br></p>\n<p>I was shocked yesterday to see so many posts criticizing Shakira and JLo for their performance calling it a slap in the face of the metoo movement. Women openly saying that the show was hyper sexual and it cast a shadow over the many women working to free themselves from the shackles of objectification in our society. </p>\n<p><br>But real freedom means women (and men) have the right to embrace their own sexuality and beauty without fear of unwanted sexual advances. Real freedom also means someone who doesn’t appreciate a performance, can just turn off the TV. We don’t live in a dictator ship where anyone is being forced to endure an artistic expression that makes them uncomfortable. <span> </span>You have the choice, to walk away anytime. <br><br>I have daughters, and not for one moment did I think that this show would result in them taking to a life of pole dancing for dollar bills. I didn’t think that, because I know that their value system is based on a combination of experiences throughout their life. What I hope they took from that show was that aging doesn’t mean you have to be frail. I hope they saw the beauty of these two women, I hope they saw their incredible talent and endurance, I hope they watched the stereotypes of middle age shattered into a million pieces and embraced a new way of looking at growing older. That it can be powerful, athletic, strong and in many ways, the beginning of life. Not the beginning of the end of life. I hope that instead of feeling jealous, envious or small, they felt inspired, hopeful and larger than life. I hope they saw possibility. <br><br>I know that I am turning 40 this year. And it has plagued me. I have felt the years of bad choices piling up on me like a thick blanket of resigned hopelessness. It’s all downhill from here right? The best years are behind me, my body is going to deteriorate, I’m going to get old, become Sophia Petrillo and end up at Shady Pines by 65. The end. <br><br>But, when I saw the halftime show yesterday, I felt totally different. I felt renewed, and confident that the only thing standing in the way of me being in the best shape of my life at 43 or 50, was my own choices. <br><br>People say it’s time for better. It’s time to stop making women sexual objects. That we are better than that. Maybe though, it’s time for us to deeply internalize that we are a judgmental society, and what causes more damage to our youth and our social constructs isn’t a provocative half time show, but the vitriolic rhetoric from the people who disapproved of it. The angry words and harsh judgements designed to wound and shock will have far greater implications for the emotional and psychological health of our society than the show these two ladies put on. <br><br>There is nothing wrong with being more conservative, and preferring not to participate in a show that pushes your moral boundaries. 100%, you have the right to feel that way, and a right to turn the TV off and not let your children watch it. We all have our lines, and the beauty of freedom is we have the right to protect that line with a remote control. I just hope that in 2020, we can find a way in our collective society to embrace our differences with mutual respect rather than divisive language and hate. <br><br><br></p>\n<p> </p>\n<p> </p>\n<p> </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-02-03T09:54:00-05:00",
      "updated_at": "2020-02-03T10:54:34-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "time-for-better",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/383974342742",
      "image": {
        "created_at": "2020-02-03T09:55:23-05:00",
        "alt": "",
        "width": 1280,
        "height": 871,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/JHHLZEIAKBHRXPWXU5ACMIWXY4.jpg?v=1580741723"
      }
    },
    {
      "id": 383936135254,
      "title": "Whiter teeth without the pain (and other teeth truths)",
      "created_at": "2020-01-26T13:39:12-05:00",
      "body_html": "You know what I'm talking about. You get this brilliant idea to whiten your teeth for new years, you run out and get the strongest bleach you can find and get to work. YES! This is the year of the whitest teeth. <br><br>or not...<br><br>Two days into this new resolution for better teeth you start to feel that searing pain. It's like the agonizing pain of back labor, in your teeth! Sharp, shooting, world ending pain. Why, WHY is tooth pain so horrific. <br><br>You cringe, holding your poor throbbing mouth in your hands, weeping because your poor teeth are crying and you can't eat, talk or salivate without the pain reminding you its there. <br><br>You throw out the bleach, swearing to never ever use it again, like you are striking a bargain with your teeth. \"I will throw these away, and vow never to use them again, if you stop hurting....deal?\"<br><br>Only you forget this deal, and the next year you do it again. Cycle continues. <br><br>BUT, lo and behold. Turns out there IS a way!! You can bleach your teeth and not have pain!! At least that was the case for me when my dentist told me about this magical blue stuff called \"<span style=\"color: #0000ff;\"><a href=\"https://amzn.to/2GneKo7\" title=\"sensitivity gel\" style=\"color: #0000ff;\">Remineralization gel</a>.</span>\" <br><br>What is this magic I asked? well, it turns out that when we bleach our teeth, the bleach can penetrate through our enamel making our teeth more sensitive to like, everything. The gel helps the enamel actively remineralize itself and protect our teeth once again. No long explanation. Just science!! <br><br>For bleaching I prefer to use the molded trays I have from my dentist and blow a small amount of bleach onto each tooth. This prevents the gel from touching your gums and burning them. Yikes. You can make your own at home <span style=\"color: #0000ff;\"><a href=\"https://amzn.to/2GnfSbl\" title=\"tooth tray\" style=\"color: #0000ff;\">molding tray to use with bleach here</a></span>. I use <span style=\"color: #0000ff;\"><a href=\"https://amzn.to/30Vt1Sq\" title=\"LED kit for teeth\" style=\"color: #0000ff;\">this LED whitening system</a></span> to get whiter teeth but I choose to use a tray instead of the one they provide because I really don't like the idea of bleach on my gums! <br><br>Also, just a side note. I am SUPER careful about what I put in my body, and there have been a ton of studies done on how toothpaste is FULL of stuff you really don't want in your body. Heck a simple google search will yield more results that you ever want to read about the toxic chemicals we ingest when we brush our teeth. Opt for a natural toothpaste and natural mouthwash to prevent exposure to unnecessary chemicals. <span style=\"color: #0000ff;\"><a href=\"https://amzn.to/2RMXuhw\" title=\"Toothpaste\" style=\"color: #0000ff;\">This toothpaste by Hello</a> </span>is my favorite! It leaves your breath fresh and teeth fabulous without any extra BS. <br><br>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2020-01-26T13:47:00-05:00",
      "updated_at": "2020-01-26T13:50:56-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "whiter-teeth-without-the-pain",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/383936135254",
      "image": {
        "created_at": "2020-01-26T13:39:12-05:00",
        "alt": "",
        "width": 1200,
        "height": 1600,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/83781831_10162799824490459_230849638846955520_o.jpg?v=1580063952"
      }
    },
    {
      "id": 383766265942,
      "title": "A strange Christmas",
      "created_at": "2019-12-25T19:28:14-05:00",
      "body_html": "<p>This year was a strange Christmas. <span> </span></p>\n<p>I am usually a very festive person around the Holiday’s. I enjoy the gift giving, the wrapping and the celebration with food and lots of desert! I love being with my family and I love spoiling them with delicious food and thoughtful gifts. It was a holiday my mother treasured, and every year I try to honor her memory with reliving her traditions.</p>\n<p>This year I just didn’t have the spirit, and I heard from so many people that they felt the same. A total loss of the holiday vibe and enthusiasm. Many wanted to just sit this one out. Me included. I of course did my motherly duty and created a magical day for my kids, but inside I felt a silent sadness and exhaustion. I just wanted to be done with it.</p>\n<p>How sad. <br><br>Then my brother called me from California. It is his first Christmas away from home, and his first Christmas alone. As we lamented the fact that this holiday did not look or feel like the holidays of the past, I realized I was overlooking the fact that I have the luxury to feel disappointed by something like this.</p>\n<p>My family and I are fortunate. We aren’t wealthy, we lost our mom 15 years ago, we are no strangers to struggle emotionally, physically, financially and psychologically. We struggle as all humans do regardless of their status or station. <span> </span>But what we DO have is an incredible bond that lasts ALL year long.</p>\n<p>I don’t just talk to my dad or my siblings on major holidays, I don’t just hug and laugh with my in laws on Thanksgiving. It is an everyday occurrence in our family that we connect, that we enjoy each other and have adventures and laughter together. Our meetings and greetings are not punctuated by seasonal milestones and hallmark holidays, we have togetherness all the time because we choose it.</p>\n<p>As my brother and I chatted more, I shared this with him, that our reality is special and blessed. That for us, any day could be Christmas. And while he may have been alone today, and while I may not have had the spirit today, it didn’t matter. What matters is we have chosen to be a family of blood and of design as often as possible, and we have festivity and generosity on a consistent basis. And that we are fortunate to never actually be alone. <span> </span><br><br>Today when I spoke to my brother I started the call a bit sad about my feelings about the day, but as we spoke my attitude changed and I instead felt enormous thanks and gratitude. I am blessed beyond measure that I have a home base, I have my people. I have my relationships that I take care of and treasure. <br><br>The holidays can be hard for many, many reasons. But I am making a new commitment and a new tradition today. Christmas will never be stressful for me again, it will never be a holiday where I panic about the amount of gifts I am giving or the number of people in my house. Instead, it will be a day of gratitude for the people I have in my life every single day. Christmas is a great day, but so are the other 364 days of the year when each and every one of us has the opportunity to make someone feel loved, special and appreciated. If your Christmas didn’t go down as planned, don’t sweat it. Instead, remember the blessings around you, and make everyday a little bit of Christmas. <br><br><br></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-12-25T19:28:00-05:00",
      "updated_at": "2020-01-22T15:24:23-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "a-strange-christmas",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/383766265942",
      "image": {
        "created_at": "2019-12-25T19:28:14-05:00",
        "alt": "",
        "width": 1536,
        "height": 2048,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/80407925_10162647817470459_8938108448017481728_o.jpg?v=1577320094"
      }
    },
    {
      "id": 383541936214,
      "title": "Easy Breezy Key Lime pie",
      "created_at": "2019-11-27T11:17:30-05:00",
      "body_html": "<p><span><span>I love key lime pie, but over the years i have baked so many that end up taking too much like eggs. About 10 years ago I found this recipe and it's just incredible!! The pie is tart, sweet, creamy and SO easy to make. I always get tons of compliments on the flavor and the pie is GONE by the end of dessert. <br><br>First what do you need:<br></span></span></p>\n<p><span><span>Graham Cracker Crust:</span></span></p>\n<div class=\"ERSIngredients\">\n<ul>\n<li class=\"ingredient\" itemprop=\"ingredients\">1½ cups graham cracker crumbs (make your own for even more flavor by crushing graham crackers in the food processor)</li>\n<li class=\"ingredient\" itemprop=\"ingredients\">⅓ cup sugar</li>\n<li class=\"ingredient\" itemprop=\"ingredients\">8 tablespoons butter</li>\n</ul>\n</div>\n<p><span><span>Pie Filling</span></span></p>\n<div class=\"ERSIngredients\">\n<ul>\n<li class=\"ingredient\" itemprop=\"ingredients\">2 (14 oz) cans sweetened condensed milk</li>\n<li class=\"ingredient\" itemprop=\"ingredients\">¾ cup fresh key lime juice</li>\n<li class=\"ingredient\" itemprop=\"ingredients\">1 tablespoon key lime zest</li>\n<li class=\"ingredient\" itemprop=\"ingredients\">½ cup plus 2 tablespoons sour cream <br><br>\n</li>\n</ul>\n</div>\n<div class=\"ERSInstructions\">\n<ol>\n<li class=\"instruction\" itemprop=\"recipeInstructions\">Heat your oven to 375 degrees F. Combine graham cracker and sugar. Melt butter and stir into the mix slowly to evenly coat. Once its mixed, press into a 9-inch pie dish. Bake for 7 minutes. Let it cool 100% before adding your pie filling. </li>\n<li class=\"instruction\" itemprop=\"recipeInstructions\">Preheat the oven to 350 degrees F.</li>\n<li class=\"instruction\" itemprop=\"recipeInstructions\">In a large <strong>non-metal bowl</strong>, empty every last bit of condensed milk. Mix the sweetened condensed milk, lime juice and zest, if you like that extra pop of flavor, and the sour cream. Stir by hand until well mixed. </li>\n<li class=\"instruction\" itemprop=\"recipeInstructions\">Pour the pie filling mixture into the graham cracker crust and bake for about 10 minutes. Keep a close eye you do NOT want to brown the top. </li>\n<li class=\"instruction\" itemprop=\"recipeInstructions\">Let the pie cool completely, and then place in the fridge. Pies like this can absorb flavors of other foods so be sure to cover your pie!! </li>\n</ol>\n<p>Add whipped cream and sliced lime for garnish and enjoy!</p>\n</div>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-11-27T15:16:00-05:00",
      "updated_at": "2019-11-27T15:22:07-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "easy-breezy-key-lime-pie",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/383541936214",
      "image": {
        "created_at": "2019-11-27T15:15:54-05:00",
        "alt": "",
        "width": 4032,
        "height": 3024,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/76896579_635836760284483_2763571688426700800_n.jpg?v=1574885754"
      }
    },
    {
      "id": 383308267606,
      "title": "Men in leadership, guess I won the lottery!",
      "created_at": "2019-11-12T12:44:49-05:00",
      "body_html": "<p>Yesterday I was at a business meeting and a lovely gentleman asked some great questions about our experiences with leaders in our professional careers. I thought about it and smiled a big happy smile, because I have loved all of my bosses from corporate America.  I was asked to check off the things about them that stood out as stellar qualities! They were all visionaries, with compassion and empathy, they laughed a lot and were humble, and they were charming and patient. I must have checked off every single box. I looked at it with great satisfaction! I loved my bosses. <br><br>I then shared about my boss from when I was just a 19 year old starting out. Mark Miller. He gave me my first ever real job, I got a salary, health insurance and vacation days. It was truly mind blowing to me. Looking back, he had no reason to hire me for that job. I was a temp, I knew nothing. But I showed up everyday, and I worked hard and I was teachable. So, he took a chance. That chance set my career into motion. I was only with him for a short while before he moved away, but Mark taught me to take risks in leadership on good people. He taught me to see a person, not a resume, he taught me to listen and ask questions, and he taught me to never judge someone for their mistakes but to teach them to do better. He was an incredible leader. <br><br>My second boss was Randy. Man, I loved him. He was another boss who was a guy. A VP who took a chance on someone. He hired me as a director when I was clearly not ready for it. But, like Mark he saw that I would work harder than anyone else, that I was teachable and that I was excited. Randy taught me how to think like a visionary, he knew how to ask the right questions to foster my strategic mind. He was a great listener and never made me feel like I was anything less than his equal as a human, even if I was his subordinate as an employee. He taught me how to be a friend to my staff without losing my authority. He taught me about patience and the importance of measured, thoughtful work. That coming in first wasn't as important as coming in right. <br><br>My third boss was an inspiration, a super smart scientist who will one day change the face of medicine as we know it. John was one of my absolute favorite people to work for. He believed in me. John taught me so much about small business ownership and the importance of networking and collaboration. He taught me how to understand complex networks of ideas, and how to bring them all together. He taught me how to trust myself when I was stretching and growing into new areas of expertise. He empowered me more than anyone I've ever worked for, and he was a tremendous friend. <br><br>And of course, the first, last and forever leader. My father. I think my dad was an accidental leader, he never really wanted to be a boss but he knew he never wanted to answer to anyone. He was actually a terrible boss to his staff, he would say the same! What he taught me was that life is too short to live for a paycheck and a 401K. That I had the power and insight within me to build my own life in my own vision, and that I didn't have to follow the currents. I could create my own. <br><br></p>\n<p>The room seemed surprised to hear my story about Mark; it was like having an empathetic, strong and supportive male leader was as rare as winning the mega millions. And yet, I've had the good fortune to have four exceptional male leaders in my life who have shaped me into the person I am today. A person I am proud to be. <br><br>It made me so thankful to have met these men, who clearly were more than just good leaders to me, but pioneers in a corporate world flooded with men who apparently don't see the world the way they do. I never once felt the need to apologize for needing to get home to a sick kid, or leave early to make a game. In fact, I was supported and applauded for my commitment to being a great parent, AND a great employee. <br><br>I can only hope that leaders like them can rise to the top and teach others (regardless of gender) how to be effective leaders in a world that is clearly cluttered by those who still believe authority is exercised through fear and control, rather than cultivated through mutual loyalty and collaboration. </p>\n<p>I left that meeting full of gratitude for the leaders I've had the privilege to work with, who are 100% the future of not just male leaders, but all leaders. </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-11-13T20:09:00-05:00",
      "updated_at": "2019-11-13T20:25:03-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "men-in-leadership-no-they-all-arent-bad",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/383308267606",
      "image": {
        "created_at": "2019-11-13T20:09:04-05:00",
        "alt": "",
        "width": 2000,
        "height": 2000,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/453430-PG21KR-462.jpg?v=1573693744"
      }
    },
    {
      "id": 382563549256,
      "title": "Embracing the hurt",
      "created_at": "2019-10-14T22:29:37-04:00",
      "body_html": "<p><em>Man, life is messy isn’t it.</em></p>\n<p>It’s kind of funny when I stop and think about it. I often joke that I wish my life was like a book or a movie where shit just worked out and I had all the money and health and power and wisdom I could ever need.</p>\n<p>Wait a minute. NO movie is like that!!! In fact, when I pushed myself I was like, shit! Almost every movie, book, play or TV show I have ever seen is fraught with drama. There is absolutely not one that I can recall that wasn’t, and if there is it probably wasn’t very interesting and I forgot all about it. And I know I am not alone in this world view.</p>\n<p>I wonder where it comes from, this belief that somehow life’s default is happy bliss, and the unexpected tragedies or heartbreaks and pain are the failures? How do we come to believe that we “deserve” a perfect life and when things go off the rails or we get our hearts broken or our feelings hurt or we fall on hard times, that those events are anomalies that are SO unexpected? Like, HOW and WHY are we still surprised when these things happen, and why do we let them hold such power over us and our happiness?</p>\n<p>Perhaps our perspective is off, and the story and strength really does come from the tests we seem to face in big and small ways every day. Whether it’s our kids pushing our patience over the crust of their not perfectly cut PB&amp;J or the death of a parent or loved one, these are life’s inevitable stories. The tragedy, the pain, the broken moments and tears are just honestly, the way it goes. I found myself thinking (whilst deep in the weeds of one of these dark times) where I felt beaten to my knees by the weight of my mistakes, that maybe my pain wasn’t a curse. What if instead of seeing every bruise as a failure where I should have known better, I was stupid and fucked up, I sucked! What if instead I took it as a gift? A moment to grow, to gain wisdom, strength, focus and specific energized direction.</p>\n<p>So I really started to think about my history with heartache. What was my earliest specific memory of it?</p>\n<p>When I was in the fourth grade, I was sitting in Ms. Doris’ class room, I was 9. Our seats were benches with desks attached and we each had one desk mate next to us. I sat next to the window. Farthest from the door into the class room. It was a hot day, as usual. There was no air conditioning and it was over 100 degrees in the Pakistani sun. My back was sticky and my long frizzy hair stuck to me like glue. I felt sick.</p>\n<p>Ms. Doris was talking about something; I have no clue what she was on about, my mind was elsewhere. I was thinking about my parents and how I was terrified they were going to get divorced, or that my mother was going to stop waking up one day. Our house was never normal, but it was normal to us. My mom was very sick growing up, she suffered from crippling migraines and even more insidious depression. <span> </span>She took pills to numb both and that landed her in bed, a lot. My dad was gone all the time for work. For some reason that one day, the pain of it erupted inside me like a volcano. In the middle of class, I burst into tears. Shaking and sobbing. People stared at me. Ours was not a culture of sharing feelings or expressing emotion. It was uncomfortable and I wanted to be erased. I remember feeling such searing pain, I thought for sure it would never end. I felt anger at my parents for not giving me the perfect life I deserved and believed everyone else had. I felt betrayed, and I felt ashamed.</p>\n<p>For so many years I felt like that experience and the many others were all bad. That the pain I had experienced throughout my life was some kind of failure in my story. A defect that wasn’t supposed to happen.</p>\n<p>As I sit here, 39 years old with 3 children, one of whom is 9, that story looks so different. I don’t feel anger, or shame or disappointment for my experience that day or the experiences of my abnormal home. I am sad that the decisions my mother made led to her untimely death, and I am sad for the fact that my children will never know her face, or her scent. But more than any of that, I find myself full of thanks and gratitude for my experiences.</p>\n<p>When I think back on those years, I realize now my poor parents were just stumbling along blind and in pain themselves trying to the right thing after a surprise pregnancy made them decide the rest of their lives at a young age. Together, for better or worse, they kept their surprise baby and raised a family together. They moved across the world, and suffered through a marriage filled with mistakes and regrets of serious choices made too soon. But above all that what our family shared was an incredible, deep and sincere love. <br><br>In my young years, full of naiveté and rose colored glasses about everyone else’s perfect life, our family’s short comings shouted louder than the blessings I see now. But that experience in its entirety is what has shaped me into who I am today. All of my pain has. My miscarriage at 21, chronic illness at 30, the death of a parent, a marriage in trouble, bad financial decisions and bad business decisions, fights and dreams abandoned, falling apart. They all made me.</p>\n<p>These aren’t scars to bear with shame, they are the landmarks of a life lived, a life learned and a life cherished. I would do just about anything to bring my mother back and have a conversation with her, but that isn’t going to happen. Her loss is irreversible and permeant. The sadness of her loss is deep and unyielding, but what a waste it would be of her life and her death, if I chose to dwell in the pools of pain rather than swim with gratitude for the life she gave me by her life and by her death. The pain that almost ended my marriage, could have been a weapon to wield forever. But it was instead the cement that built a foundation of intimacy and trust that will last a lifetime. A far better choice than the resentment and rage we could have picked. <br><br>Our pain is what it is. We all have it. No one is immune. Even those who wear the shiniest crowns and have the biggest whitest smiles have their own devastations. Somewhere in that suffering, is a gift. A gift that someday we can give to someone else who is lost and can’t find their way. <span> </span>A gift that will allow us to heal someone who really needs it. <span> </span>A gift, that lets us embrace the tears because we know they will yield to happiness. The very pain that feels unending is what gives us the opportunity to feel true happiness, aching belly laughs with tears; our hearts full of joy. Pain isn’t punishment, it’s just the human condition. And it is truly amazing that we have the power to take that pain and turn it into something precious, something incredible, something timeless and full of hope.</p>\n<p>I am forever grateful to my family for giving me the gift of perspective. For anyone reading this who is lost, or alone, or in that place I have been in many, many times. Know that the story isn’t over until it is literally, over. As long as you can breathe in and out, as long as the sun rises and sets, there is hope. </p>\n<p>XOXO</p>\n<p>Saira</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-10-14T22:35:00-04:00",
      "updated_at": "2019-10-14T22:54:33-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "embracing-the-hurt",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/382563549256",
      "image": {
        "created_at": "2019-10-14T22:35:23-04:00",
        "alt": "",
        "width": 1221,
        "height": 1238,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/73292548_898745853858058_3143638047438929920_n.jpg?v=1571106923"
      }
    },
    {
      "id": 183861575752,
      "title": "Parenting is so F******G hard!!!",
      "created_at": "2019-10-09T23:21:41-04:00",
      "body_html": "<p>You would never guess this post from that photo. NOPE. <br><br>Today I was tested. And I pretty much failed.</p>\n<p>My almost teenage son is at that age where he just knows everything. Half the time he is the sweetest most loving boy, and the other half, he is possessed by the hormonal devil determined to get a rise out of everyone. It was a hard day. <br><br>Today I experienced what my friend Debbie calls “Lettuce.” When her kids were young, she made tacos one night. A piece of lettuce fell off one child’s plate onto the floor. And as if in slow motion, the boys witnessed this happening, and just ignored it. And Debbie lost her fucking mind. It wasn’t about the lettuce of course. But everything before the lettuce. Every forgotten worn sock, every dirty dish left thoughtlessly for her to pick up, every unkind word said in teenage irritation, every thank you that was not spoken and every drop off and pick up that was just taken for granted. It was not about lettuce. It was about a mother’s love and sacrifice living invisibly among her children. <span> </span></p>\n<p>And so, lettuce happened. Today was my lettuce. <br><br>In that moment, as I freaked out about my son being late for pick up after asking me to come get him and then putting his headphones on while I was talking (mom he said, the sound was off) WHATEVER!!!!! Anyways, in that moment all I could think of was the endless days of staring into my newborn baby’s eyes filled with every great wish and hope for his future, his razor sharp tongue seemed impossible. How can they be the same people? How can this partial adult be the same child I cradled in my arms night after night? <br><br>We drove home and I lectured, I threatened to take away all his things, all his freedoms. I did what parents do when they get unhinged right? The grounding. The laying down of the law. The I WILL SHOW YOU WHO IS BOSS diatribe. We got home and he rushed off to his room, I think confused and worried about what would happen next. I sat in my car and wept. I just sobbed. I wished for my mother so I could ask her what to do? But she’s not here and well, I am 39. I kind of need to figure this shit out.</p>\n<p> </p>\n<p>Truth be told, I don’t think we ever figure anything out. It really is just treading water the whole time, jumping from maybe to maybe, hoping the lily pad doesn’t give way and drop us right into the river, so we can get soaking wet to climb up and repeat. <span> </span>I think I’ve been living under this illusion that everyone else has things figured out, and I am the one playing catch up, pretending I’m a grown up but really, I’m like a 15-year old waiting to get caught playing house with her boyfriend.</p>\n<p>But the more I step outside my closed insulated life, the more I see others just like me. Parents who are just as lost, just as clueless, just as confused and scared about tomorrow as I am. We don’t have the answers, but we do have the guts. This whole business of rearing adults to ready them for the future is a giant task. I know I thought my parents knew everything, but even now my dad will be the first to admit he knew nothing and just hoped everyday he would do the very best he could to keep us safe, alive, warm and fed.</p>\n<p>Today wasn’t a great day, on a dime it went from awesome to absolute shit. I faced the reality today that this is not going to get easier. <br><br>I don’t have the answers. I wish I did. I kept hoping some magic words would inspire me and wipe away the fight and we would both be healed. But instead, I sat with him and cried. I told him the truth. That in 5.5 years he would be on his own, a man in the world! That all this would be behind him and he would wish for the days of someone telling him what to do, waking him, feeding him, keeping him warm and safe. That these lectures will turn into mantras he will repeat to himself when he feels alone or uncertain. I reminded him, that no person on earth will ever love him the way I do. A mother’s love has no competitor. I told him I wasn’t the enemy, that I am his biggest advocate, biggest fan, LOUDEST cheerleader. But I shared that my greatest wish for him was to choose kindness not because he risked losing his gadgets and privileges if he didn’t, but because he knew it was the right way to be. <br><br>And as I sat there weeping, my 12-year old son tenderly took me into a hug and held me. He said he was sorry for hurting me and he would work on it. <br><br>I guess that is all we can ever ask for right? That the people around us try and do their best to be better tomorrow than they were today. That we can extend mutual forgiveness for our transgressions and commit to love first and learn from the past but not dwell in it. Today sucked, but I also feel like today I learned something, and I hope for my son’s sake, taught something.</p>\n<p><br>Parenting is hard. But just remember, even people who seem to have it all together…….</p>\n<p>We don’t.<br><br>XOXO<br>Saira</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-10-09T23:21:00-04:00",
      "updated_at": "2019-10-09T23:21:54-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "parenting-is-so-f-g-hard",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/183861575752",
      "image": {
        "created_at": "2019-10-09T23:21:41-04:00",
        "alt": "",
        "width": 938,
        "height": 940,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/72131688_10162269371280459_3031736780530384896_o.jpg?v=1570677701"
      }
    },
    {
      "id": 29343711304,
      "title": "When things go wrong, think again",
      "created_at": "2019-08-05T22:05:32-04:00",
      "body_html": "<p>Today was my 13th wedding anniversary. My husband and I decided to go out on a date and my dad had agreed to babysit my girls. <br><br>He decided to go to the grocery store and at 6:30 still wasn't back. 6:45, nope. 7PM NOPE. I kept calling, no answer. Finally at 7:30 my husband joked, maybe he's already here?? <br><br>Sure enough he had come back and was cooking up a storm. I was so irritated. Like come on dad, you couldn't just tell me you were back (albeit late) so I could start my date? <br><br>We finally left and got to the restaurant. We were gonna eat inside because well, evening time and bugs. But Butch said let's try to sit out side. Sure! Why not! <br><br>We sit down and the service is sooo slow. I'm like see, this is why you don't sit outside. Right? <br><br>About 2/3 of the way through our dinner, we hear Butch's name. He looks up, surprised to see an old friend from his school days. They were so happy to meet up, genuinely happy. Like running into your best memories. <br><br>Butch told his friend that he had just run into his mother a few weeks back and they had the best talk, and instantly his friends face changed. I could tell something was off. His friend shared that his mother had suffered a stroke and was not doing well. </p>\n<p>They shared so many happy memories of their youth, and it was so cool to hear them walk down memory lane. Butch was so colorful, sharing every detail of a stealth ice cream adventure that ended in a bike accident with two broken front teeth and a ride in a strangers Porsche who was late for a flight and drove 80 MPH down town roads to get 2 scared little boys to their parents. <br><br>After his friend left, I just kind of thought about the evening. And I realized that all the little events that happened led us to that encounter. I mean, if my dad hadn't been late, if I hadn't not realized he was home, if I had insisted that we stay inside and not eat on the patio, we never would have had this chance encounter. Two childhood friends wouldn't have had the opportunity to catch up after years and years, and Butch wouldn't have heard the news that the sweet old lady he was so excited to meet was gravely ill. <br><br>Sometimes things happen, we get inconvenienced, we miss our train, we miss our flight, we are late to dinner or we sleep in. We instinctually get angry, frustrated, we rush and bitch and complain. But what if instead of seeing it as something going wrong, we looked at these mishaps as fate's light touch. <br><br>There was no way tonight was a coincidence. There was a reason everything happened the way it did. And I felt blessed to learn a lesson. Shit happens in life, sometimes it means nothing, but sometimes it means something. Don't judge your mishaps, they could very well be nothing, or, they could be doorways of opportunity. <br><br>I imagine my life will be much more peaceful with the perspective that when things don't go according to plan, something much better might be waiting for me. Life is short, don't waste your time and energy getting cranky over dumb stuff. Keep your eye on the prize, which is the experience and the journey with all the oversleeping, and missed planes. <br><br><br></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-08-05T22:32:00-04:00",
      "updated_at": "2019-08-05T22:32:36-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "when-things-go-wrong-think-again",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/29343711304",
      "image": {
        "created_at": "2019-08-05T22:26:09-04:00",
        "alt": "",
        "width": 2320,
        "height": 3088,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/68674590_460461884810176_3195956658979209216_n.jpg?v=1565058369"
      }
    },
    {
      "id": 29241213000,
      "title": "Alternative Therapies for chronic illness",
      "created_at": "2019-07-22T16:31:24-04:00",
      "body_html": "<p>It's no secret that I suffer from adrenal fatigue and honestly traditional medicine has epically failed me. I have seen doctor after doctor and the only advice I get is to rest, and limit stress. </p>\n<p>Really? Thanks but I don't fancy living my entire life in a vortex of exhaustion, living with less energy than my 77 year old mother in law! That isn't living. That is surviving. At my last physical I shared with my doctor how depressing it was to constantly feel tired, foggy and have no energy to do anything, at all. She was very kind, but basically ran all the usual blood tests and said, well you have adrenal fatigue but the only real remedy is to rest rest rest. Excuse me while I sleep my life away. <br><br>So when a sweet friend of mine suggested I look into an alternative I was all too happy to dive headfirst and check it out. She suffers from MS, so her condition is far worse than mine, and she said she as feeling tremendous benefits from something called a magnetic protocol. Hey, the universe is basically a giant magnet, and the sun does a number on the earth when magnetic fields are disrupted so, why not in the body too! It makes so much sense!<br><br>I contacted the treatment provider and eagerly went to my first visit. <br><br>We had a great chat about what brought me in to see her, and she had me lay on a table and she put this magnet on my liver and some contraptions on my feet and i was waiting for the machines to come out. Probes that would send signals through my body, a computer. But nothing got wheeled out. <br><br>\"Is there some wifi connection that send these signals\" I asked? <br><br>She replied that no, she asked the questions in her mind and my body would respond. <br><br>Well, shit I just totally got swindled. I spent 180 bucks for a quack to have a psychic conversation with my feet? DAMNIT. But it's too late now. I am here, I've committed to spending the money, soooo. I just decided to surrender to the experience without too much judgement and see what happened. <br><br>So she does her thing, meanwhile, I am trying to keep an open mind. She tells me my body is informing her of all these things wrong with it, interestingly somethings i suspected did not show up. Hmmm. Then she asked a few questions about symptoms. Did I experience burning in my mouth. </p>\n<p>WTF. How did she know that? Because no joke, for like 6 months now I've been complaining of this weird burning sensation in my mouth and no one could figure it out. I didn't mention it to her. But she knew.....<br><br>Maybe there is something to this. <br><br>The exam continued and by the end she had a list of things my body had told her were going on. She suggested we start magnetic treatments to basically blast  them out of my body. Sure, why the hell not! Even though the skeptic in me is like of course you found all this shit wrong with me, I am your new cash cow! <br><br>But to be honest at this point, what have I got to lose. <br><br>Since I was going to be putting my scientific mind to rest and gamble on this, I decided I should do some research. I am not exactly sure how it works, but the basic premise is that the magnets create a a neutralization of pathogens in the body, and then once they are neutralized by these magnetic frequencies, our body sheds them and we begin healing. <span>It sounds like a load of voodoo magic, but when you consider that we are basically held in place within the endless universe by the forces of magnetic energy, maybe it isn't so crazy? We shall see. <br><br>In closing, I will continue to document my journey with this treatment, I plan to give it a whirl since thus far traditional medicine has been of little help. I remind myself that Shaman and Witch doctors and homeopathic practitioners and naturopaths have been treating maladies of the body through alternative means for thousands of years, many with great success. I mean just think about Reiki therapy!! It may be hocus pocus, but at this point I am willing to take a leap of faith and give it a shot.<br><br>Regardless though, it really made me sad to think about how many people are struggling with invisible illness, and doctors just don't have the tests to identify their issue or give it a name. In our quest for any kind of relief we just try anything and everything, hoping to find an answer. More often than not we turn to supplements and pharmaceuticals to try and treat the symptoms, never really knowing what is going on underneath to cause the symptoms in the first place.  <br><br>We are a culture of medicating the symptom, rather than investigating the cause. Take this pill and treat this, and oh, now take this next pill to fix what that other pill did to you. It's layer after layer of overmedication to treat a manifestation of disease rather than a thorough investigation into what the body is fighting to begin with. Holistic whole body care seems to be scoffed at as antiquated and the remedies are always more pills, more chemicals. I just don't know that I want to live that way. <br><br>So will this work? I have no idea. But the definition of </span>insanity is doing the same thing over and over again, expecting a different outcome. Only way to avoid going insane and making zero progress is to do something totally different than I have been doing. <br><br>Here I go!! Stay tuned for updates!!</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-07-31T13:38:00-04:00",
      "updated_at": "2019-07-31T13:38:55-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "alternative-therapies-for-chronic-illness",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/29241213000",
      "image": {
        "created_at": "2019-07-22T20:03:09-04:00",
        "alt": "",
        "width": 400,
        "height": 323,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/19061.jpg?v=1563840189"
      }
    },
    {
      "id": 29236985928,
      "title": "When Fate shows her face",
      "created_at": "2019-07-21T18:36:39-04:00",
      "body_html": "<br>If you don't believe in fate, you just might at the end of this story. <br><br>Today, Facebook reminded me of a memory from 7 years ago. An impromptu trip to the whales tale in New Hampshire with my mother in law, sister in law and her husband, her kids my brother in law, and my husband and my kids. <br><br>Now normally in July, my mother in law would have been on a trip to Alaska with her husband, but that year she decided to skip and stay home to visit with her daughter who was coming from Pennsylvania for 2 weeks over the summer. So when her daughter visited, we thought let's all take trip to the White Mountains! It was the first time that my mother in law had been with ALL her kids and her grandkids. Ever. <br><br>We had two awesome weekends, and our family time concluded with this trip, 7 years ago today at the whales tale where we spent the day in wave pools and water rides. We had the best time, laughing and enjoying the beautiful day and each others company. It is one of my favorite memories. <br><br><img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/407366_10151154532170459_1343019115_n_large.jpg?v=1563750028\" style=\"float: left; margin: 25px 25px .25px .25px;\" width=\"281\" height=\"210\"><br><br><br>A week later, Uncle Mike (my husbands brother) came to the house to hang out. We chatted and randomly, I asked him how long it had been since he had gone to the doctor. He laughed and said it had been 8 years. I insisted he go get a check up, and he promised he would. <br><br>Not 2 weeks after that, Mike suffered a massive stroke driving on the road, and after a week in the ICU, passed away. <br><br>It was a shocking and horrible time for our family. Mike was a gem, a treasure of a human who touched the lives of every person he ever met. He was the fun uncle who visited often and always brought the biggest chocolate bunnies at Easter and the best presents at Christmas. He was super in every way. At his funeral, lines of people coiled around the building waiting to pay their respects. It felt like a horrible nightmare. And I couldn't help but feel those two weekends were no accident. <br><br>For my mother in law to skip that trip, for my husbands sister to be visiting, for us to have those weekends together for the first time ever as a family, it was a gift from someone, or something and I get chills every time I think about it. <br><br>I learned a lot from losing Mike. I learned that life has small gifts we often overlook, and that I should take nothing for granted. I learned how important it is to make time to take care of your health no matter how busy you are because you will either spend the time preventing issues or likely spend more time fixing them. I learned that time should always be made to spend with the people who matter to you, and words you want to say should be said, even if they sound sappy. I learned that more people than you realize care about you, and that friendships are worth maintaining and cultivating, that relationships are everything. I learned that most things that consume our time and our attention day after day are actually utterly meaningless, and in the face of actual tragedy are so insignificant, we wonder why we ever allowed the to occupy real-estate in our lives. <br><br>In losing Mike, I gained a whole new appreciation for the life I have been gifted. Somedays I get sucked back into the minutia like any person does I guess, but then I remember Mike, and those fateful 2 weekends and I feel less alone, and reminded that there is something greater than us. Perhaps a fate, that gave my mother in law (and us) those memories to cherish forever. <br><br>Watch out for life's tiny gestures, make the time to make memories and cherish the ones you love. Reach out to that friend you haven't talked to in years but think of often. Make the most of every moment, because you just never know when you may not have that chance again. Sometimes I think life tries to tell us, but we get distracted and busy with the mundane. Don't get distracted. Make the time to do the things that really matter. <br><br>And for Uncle Mike, I will continue to try and do that, everyday. <br><br>XOXO<br>Sai<br><br>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-07-21T19:05:00-04:00",
      "updated_at": "2019-07-21T19:05:40-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "fate-more-than-a-fairy-tale",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/29236985928",
      "image": {
        "created_at": "2019-07-21T18:48:26-04:00",
        "alt": "",
        "width": 960,
        "height": 720,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/486565_3872385700895_701481421_n.jpg?v=1563749306"
      }
    },
    {
      "id": 29165289544,
      "title": "A wand raised in farewell",
      "created_at": "2019-07-02T16:00:55-04:00",
      "body_html": "<p>Today is a sad day. <br><br>I was on a zoom with my sister, chatting about Facebook ad's and my friend sent me a message to see if I had heard that a former colleague of ours had died. As soon as she said her name my heart sank and I felt sick to my stomach. <br><br>Vanessa Neimeyer wasn't a close friend of mine, but we bonded over our mutual love for movies, entertainment and of course, Harry Potter. We had a few late night chats about her adventures in casting, how hard it was but how rewarding. I asked her for help as I was thinking about pursuing a career in entertainment and she shared openly her advice, her stories and her incredible zest for life. I would often see her posts pop up, they were so authentically her and I always smiled. </p>\n<p>She never made any apologies for her independent, pure and bold spirit. She was someone I admired because she just was who she was. And she didn't ever make any pretense to be anyone but that. A lesson we can all take something from. <br><br>When I read the article that she had been killed by someone trying to escape police apprehension, and this person then crashed into her home where she slept in her bed and took her beautiful life, I wept. I found myself sobbing. Even though we weren't close, she was a human being, someone who had her whole life ahead of her, someone who had touched my life and given me hope when i needed it, and often her posts reminded me how important it was to find joy in life, and to make time to LIVE it. She didn't deserve to have her story end this way. <br><br>I think what struck me so hard was the fact that just a few hours before she died she made an Instagram post about July 4th, and just a day ago I thought I should message her to say hi and see how her trip to the Harry Potter ride opening went. I didn't. I thought, I will message her later. Later will now never come. She had no idea that when she laid down to rest last night, it would be her last. <br><br>This morning, before I heard the news, I was stressing out about airfare for a trip I need to take. I was kicking myself for falling asleep and missing out on a $100 deal. <br><br>Who gives a fuck about that. I mean really. And yet, how many of us spend hours upon hours a day, 100's maybe a month dwelling on this kind of nonsense? All of us. <br><br>Perspective. <br><br>Life is not forever. Next moments are not guaranteed. Only this one. Right now is the one we can count on. Be purposeful. Be mindful. Be grateful. Be present and be joyous. Be free of stress and judgement because I will never ever in my life forget Vanessa. I will never forget that she was full of life, she loved to live. And that right was taken from her by someone else, and by something totally out of her control. <br><br>Our life is to be treasured. To be cherished. Our friendships should be tended to and cared for. The feelings we have should not stay silent feelings, we should share them. I wish I had told her how much her conversations meant to me. I wish I could say, Vanessa I applaud your free spirit and your drive and dedication to adventure. I wish I would have told her that in my darkest hour, one passing chat made me smile and reminded me of life's endless possibilities and hope. <br><br>All that any of us can really hope for is to leave a legacy of positive influence behind us, that somehow in someway we have an impact and leave a mark. Vanessa no doubt achieved that. <br><br>Today I am sure I will cry, and mourn the loss of a wonderful person. I will pray for her family and her friends and loved ones that they find some peace and healing in time. <br><br>I hope Professor Snape was there to greet her when she arrived in Heaven. Rest in peace fellow Slytherin. </p>\n<p>XOXO</p>\n<p>Sai</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-07-02T19:25:00-04:00",
      "updated_at": "2019-07-02T20:17:37-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "taken-too-soon",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/29165289544",
      "image": {
        "created_at": "2019-07-02T19:22:18-04:00",
        "alt": "",
        "width": 712,
        "height": 727,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/65882338_10157406008362710_2377813041753358336_n.jpg?v=1562109738"
      }
    },
    {
      "id": 29154148424,
      "title": "Your biggest obstacle - your attitude",
      "created_at": "2019-06-28T19:12:08-04:00",
      "body_html": "<p><br>Often, we believe that the biggest obstacles keeping us from our goals are circumstances, environment, health, education, privilege, money, weight, marital status etc etc. It is an<strong> external entity</strong> that is responsible for us not achieving what we want, or going after what we desire. <br><br>I have many times, found myself in this exact dialog with myself. The self doubt, the negative self talk. A million and one excuses for <strong>why my life isn't what I want</strong>, and how it <strong>can't be</strong> because of things that are totally outside of my control, or seemingly out of my control. I have these silent conversations with myself that usually result in a sour mood, demotivation, depression, anxiety and withdrawal from socialization. <strong>It also turns into a self fulfilling prophecy</strong> and I find my creativity diminishing, my interaction dwindling and my business suffering, along with my family and marriage. </p>\n<p><span style=\"text-decoration: underline;\">Yikes. </span><br><br>I want to tell you a story about grass. Yes. grass. <br><br>It all started from a book called Kitchen Table Wisdom. The author talks about her rushed walks to and from work as a young resident in NYC. She was always busy, stressed, get to the next thing, climb the next mountain, get to the next goal. <em>She was racing through her life in fast forward</em>. One day, on the walk she had done a dozen times, she sees something that stops her dead in her tracks. <span style=\"text-decoration: underline;\">She sees grass growing out of the concrete. </span><br><br>Funny, all of us have no doubt observed this and never stopped to really think about what that means. She stops, and she absorbs the moment and the realization that these small blades of grass had to <strong>fight</strong> through CONCRETE, to find their way to the surface and meet the sun. <br><br>Wow. Mind blowing right? I know I have see blades of grass breaking through the roads and never really understood the power behind what I was seeing. <br><br>Will. And a naked truth. Nature will fight hard to survive. <strong>Even under seemingly insurmountable odds,</strong> it will push, it will fight,<strong> it will endure</strong> as long as it can. And in this case, it will win. And tufts of grass will push their way through the concrete to drink the sunshine. <br><br>How do we become that grass? How do we look up and see no light, no sun, no hope only slabs of heavy weights and still push up and out? Surely if a blade of grass managed, <span style=\"text-decoration: underline;\"><strong>we can too. </strong></span><br><br>The first step for me was to be honest about my addiction to negative self talk, and the comfort I found in hiding behind inevitable failure. <strong>A bad attitude</strong> is not a permanent state of being; it <strong>is a habit, and a choice.</strong> The first step towards breaking through that slab of concrete holding you down, is to recognize that 9 times out of 10, it was you who put it there to begin with.<br><br>It is a hard truth to face. I know for me I have health issues, I have anxiety, I have depression, I have a million other things going on that could prevent me from achieving, and often they do! But I also know of friends who battle with cancer, MS, lupus, paralysis, HIV, and yet they find a way to accomplish massive incredible things, everyday. The difference between them and me? <strong>Attitude. </strong><br><br>Over the next few weeks, I am personally going to be working on steps to untangle myself from bad habits that have festered and grown over the years, and have kept me from accomplishing the great things I know I can. I will share those lessons with you as they happen, because maybe you are looking for a way forward too. And maybe, as I find my way, you will find yours. <br><br>As of today, I know i need to face the fact that <strong>my attitude is what is holding me back</strong> from taking everything in my life to the next level. Sure, I have limitations, I have roadblocks and barriers. But if that grass can find a way, so can I. <br><br>Stay tuned! I am hoping as I work on my own mindfulness, and face some hard but important truths about the prisons of my own making, I can help liberate others. <br><br>Shine on!<br>XOXO<br>Sai <br><br><br></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-06-28T19:34:00-04:00",
      "updated_at": "2019-06-28T19:34:13-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "your-biggest-obstacle-your-attitude",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/29154148424",
      "image": {
        "created_at": "2019-06-28T19:26:09-04:00",
        "alt": "",
        "width": 3024,
        "height": 3024,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/65570322_492533764835983_584010643384827904_n.jpg?v=1561764369"
      }
    },
    {
      "id": 29117349960,
      "title": "Becoming a different me",
      "created_at": "2019-06-25T21:12:17-04:00",
      "body_html": "<p>When I was young, I remember fantasizing about becoming a mother! My first baby doll was named Karen, and she had a pink dress and white shoes, and I was EPIC at the motherhood thing. <br><br>We went to the imaginary park everyday, we ate endless snacks, we laughed and giggled, we played board games and watched movies. I was the cool mom, the fun mom, the endless fountain of energy mom. It was fantastic. And I knew that when I grew up and had MY own kids, I would never be like my father or my mother. I wouldn't be too tired to play like mom, or too busy to play like dad. <br><br>And then a few days ago, I was getting ready for the day and looked in the mirror, only to be hit by a ten thousand pound reality check. I was my mom and dad. I am always tired, always running from point A to point B. Always stressing out and never having time to live and enjoy because I am too busy fighting to survive. <br><br>Wow. That blows. <br><br>So I sat down and really cornered myself and thought about what kind of life I wanted to live, rather than the kind of life I have defaulted to living. You know, I always wonder why my 12 year old is a stuffy stress bucket, with a short temper. The reflection told the whole truth of how that happened. <br><br>The scary truth is we live in a culture that has programmed us to believe that \"stress\" or feeling \"stressed\" is a productive activity. If we are rushing, stressing, chasing the next goal, chasing the next milestone, well that means we are working! It means we care, and that we are committed to achieving. If we take time off, have a sick day, go on vacation or sleep in, we are lazy and without drive. <br><br>#bigfatlie <br><br>I know this, but breaking that habit is so hard. Choosing to walk away from working to play candy land, choosing to close my laptop to go to a graduation, choosing to put the phone away, and eat dinner as a family, choosing to take it easy and not work myself into the ground, they are all MY <strong>choices</strong>. But I feel tremendous guilt when I make those choices. And I know, I am not alone in this.  <br><br>It is time for us to make different choices. It is time to think about who we want to be as people, as parents, as spouses, and not who we happen to be. Bad habits are easy to fall into and hard to break, but once we are aware of them, we can control them. <br><br>I want to be a different kind of mom. I want to be energized, I want to inspire my children to play, and giggle and laugh and take it easy. Of course I want them to be driven, and motivated and reach for high goals, but I also want them to know how to experience joy, and self forgiveness. <br><br>Who we are is our choice. Funny isn't it? Doesn't always seem that way. But it really, truly is. You can be whoever you want to be. So don't ever believe you can't be who you want to be. You get to choose who you are, and you are never ever too old to reinvent yourself. <br><br>And if you ever doubt it, just remember I dragged my ass to NYC and went to acting school at 38! Your only limitation is your will. <br><br>#mywillbeatsmywont </p>\n<p>shine on!</p>\n<p>XOXO </p>\n<p>Sai</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-06-25T21:24:00-04:00",
      "updated_at": "2019-06-25T21:24:36-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "becoming-a-different-mom",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/29117349960",
      "image": {
        "created_at": "2019-06-25T21:12:17-04:00",
        "alt": "",
        "width": 2311,
        "height": 2311,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/averi_saira.jpg?v=1561511537"
      }
    },
    {
      "id": 28887646280,
      "title": "8 Beauty Must Have Items",
      "created_at": "2019-05-12T00:01:35-04:00",
      "body_html": "<p>Below are the 8 must have products I use on my skin! I hope they bring you radiance!! </p>\n<p><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/91c583c9-1692-4e0e-8b13-4878166e3a5a.jpg\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"> <br>This is the best coconut oil to gently and effectively clean your skin. Massage gently onto dry skin, and it will effortlessly melt makeup, mascara, lipstick and more. Can be purchased from <span style=\"color: #0000ff;\"><strong><a href=\"https://www.amazon.com/gp/product/B00ZED1G4C/ref=as_li_tl?ie=UTF8&amp;tag=myblogstore05-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=B00ZED1G4C&amp;linkId=bf609986c0505c24eb59dfe47530a381\" title=\"Shea Coconut Oil\" style=\"color: #0000ff;\">Amazon</a></strong></span>. </p>\n<p><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/4c9bae81-a0a3-4b7f-87e4-3353b3093dde.jpg\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"></p>\n<p>This incredible smooth and gentle milk will remove any remaining impurities on your skin. You will feel refreshed, and clean without feeling tight or dry. Available at <span style=\"color: #0000ff;\"><strong><a href=\"https://www.amazon.com/gp/product/B00C35J84O/ref=as_li_tl?ie=UTF8&amp;tag=myblogstore05-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=B00C35J84O&amp;linkId=7cbbac6e030d6cc7fcc1bb4ddf136f06\" title=\"Cleansing Milk\" style=\"color: #0000ff;\">Amazon</a></strong></span>.</p>\n<p><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/072fe0a0-993c-4226-8337-b244cda1ebcd.jpeg\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"></p>\n<p>Skin needs chemical acids to help break down dead cells and penetrate into pores to dissolve impurities. Use this at night every other day to start! This will help keep your skin's texture smooth, and reduce the appearance of large pores. Available at <span style=\"color: #0000ff;\"><strong><a href=\"https://www.amazon.com/gp/product/B014JOB038/ref=as_li_tl?ie=UTF8&amp;tag=myblogstore05-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=B014JOB038&amp;linkId=c7cea9f9c01893b5e66ebd3dd1751fd9\" title=\"Glow tonic \" style=\"color: #0000ff;\">Amazon</a></strong></span>. </p>\n<p> </p>\n<p><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/c40d3cea-953e-452f-8b6d-5f529fd19fa6.png\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"></p>\n<p><span>Vitamin C is an extremely important elixir to make your skin radiant and healthy. This glow serum, is affordable and effective, Use once a day in the AM after you wash your face and before you apply any creams. It will help even your skin tone and reduce dark spots. Purchase directly from </span><strong><a href=\"https://maelove.com/collections/our-lineup/products/the-glow-maker\" title=\"Mae Love\">Mae Love on line</a></strong><span style=\"color: #0000ff;\"><strong>. </strong></span></p>\n<div><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/637a5f37-4f39-4b51-afd8-3c0b191df125.jpg\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"></div>\n<p> </p>\n<span>Hyaluronic acid is a MUST have, and you can grab this product (Hado Labo) on </span><span style=\"color: #0000ff;\"><strong><a href=\"https://www.amazon.com/gp/product/B06X3R1LL3/ref=as_li_tl?ie=UTF8&amp;tag=myblogstore05-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=B06X3R1LL3&amp;linkId=cf7990dc471f19ed991d7964e7f3873e\" title=\"Hada Lobo\" style=\"color: #0000ff;\">Amazon</a></strong></span><span><span style=\"color: #0000ff;\">.</span> This stuff will help hydrate your skin, but even more it will regulate moisture all day. So whether you get dry at the end of the day, or look like an oil slick, this will help normalize your moisture all day long so your skin is the same at the end of the day as it is at the start. </span>\n<p><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/961601ed-1566-47d1-ac97-ca807f025189.jpg\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"></p>\n<p><span>The best lightweight hydrator, Tatcha water gel! Use this after your Hado Labo to ensure your skin is properly hydrated and ready for make up. This is a perfect choice for almost all skin types and won't feel heavy on your skin during the day. Available at </span><span style=\"color: #0000ff;\"><strong><a href=\"https://www.amazon.com/gp/product/B01N6JBR04/ref=as_li_tl?ie=UTF8&amp;tag=myblogstore05-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=B01N6JBR04&amp;linkId=8761c42228ae315af0f82a2aa463cee3\" title=\"Tatcha\" style=\"color: #0000ff;\">Amazon</a></strong></span><span><strong>.</strong> </span></p>\n<p><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/08362d08-9147-4e90-af98-4a0d165a1b24.jpeg\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"></p>\n<p><span>Retinoids are an important part of any good skin care routine, especially as we try to minimize the evidence of aging. Use this only 2X a week in the evening to start. It is quite potent so only use a small amount, and do not use this the same nights you use an acid. Apply a thin layer in the evening after you finish washing your face. Always use sunscreen the next day to protect your skin. Retinoids are a powerful Vitamin A and work to minimize the signs of aging, do not use if you are nursing or pregnant. Available at </span><span style=\"color: #0000ff;\"><strong><a href=\"https://www.amazon.com/gp/product/B07799WY99/ref=as_li_tl?ie=UTF8&amp;tag=myblogstore05-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=B07799WY99&amp;linkId=88e2942b634c5f143898e7ab364cccc2\" title=\"Retinol \" style=\"color: #0000ff;\">Amazon</a></strong></span><span>. </span></p>\n<p><span><img alt=\"\" src=\"https://gallery.mailchimp.com/cf9926818cee5700ecd0756a3/images/0723631e-d05f-4fb0-8ad4-60856b4c8524.jpg\" width=\"200\" class=\"mcnImage\" style=\"display: block; margin-left: auto; margin-right: auto;\"></span></p>\n<p><span> Vintners Daughter is a luxury item, and certainly not a must have BUT if you really want to indulge and give your skin the red carpet treatment, this oil serum is LIFE. A combination of 22 active ingredients found in nature,  this is made like a fine wine for your skin. After just one use your skin will glow like a movie star. Use in the evenings as your last skin care step.  You can buy this <strong><a href=\"https://vintnersdaughter.com\" title=\"Vintners Daughter \"><span style=\"color: #0000ff;\">directly on their website</span>. </a></strong></span></p>\n<p><span> <em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em></span></p>\n<p> </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-06-13T17:19:00-04:00",
      "updated_at": "2019-06-17T19:35:01-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "8-beauty-must-have-items",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28887646280",
      "image": {
        "created_at": "2019-05-12T00:16:06-04:00",
        "alt": "",
        "width": 1125,
        "height": 1105,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/60138791_384078288865501_2348647903121113088_n.jpg?v=1557634566"
      }
    },
    {
      "id": 29018914888,
      "title": "Today I was strong",
      "created_at": "2019-06-12T17:44:59-04:00",
      "body_html": "I know I have been quiet the past few months, as someone who struggles with chronic illness, it has been a really tough few months. About a year and a half ago I was diagnosed with sever adrenal fatigue. Translation, my body was put through too much stress and my adrenal glads that produce stress hormones were overtaxed, throwing my entire adrenal and immune system out of whack. This is very very hard to recover from, and the symptoms suck. <br><br>Chronic illness, depression, anxiety; these are all invisible. To the outside world we just get asked if we are tired, why we aren't talkative or social, why we don't make plans or go to the playground, or worse silently judged for being lazy. That is probably the worst one. It is a struggle most days to even wake up and get out of bed. And it isn't just oh I'm gonna sleep in, it's like you have the flu. Everyday.  But everyday I get up, and I push and somedays it is like swimming in mud. <br><br>But today, today I felt strong. Today, I woke up and I had energy! I felt like my old self again, and I raced through tasks without that dreaded feeling of when will this be over. For someone who normally feels like she's hungover, this was HUGE. I had a FANTASTIC day! <br><br>I really gave some thought to what was different about the preceding days that led to how I felt, and the only thing I came up with was my walks. I had fallen out of the habit of my daily walks but over the past 2 weeks recommitted myself to walking at least 5 days a week. I started slow, and have added distance every time I hit the pavement. <br><br>2 weeks in, today was the first day I was out and felt like I wanted to go further, and push harder. I relished the feeling of sweat and breathlessness. I haven't felt that way in a very long time. <br><br>I know how hard it is to start climbing the mountain when you are broken and exhausted. Making the choice to start moving again felt like I was about to hike Everest. But i just did the very best I could do, and promised myself to build from there. Bit by bit. <br><br>You can feel better, even if you don't feel that way today. The first step is choosing to make a change. And walking in the fresh air is a great place to start. <br><br>Today, I was strong. Tomorrow I will be stronger. I know I will 100% hit a wall and probably have a few tough days too, but I will hold onto this moment to remind myself that I will overcome it. Just like I did today. <br><br>And maybe, if I can do it. So can you. <br><br><br>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-06-12T17:53:00-04:00",
      "updated_at": "2019-06-12T17:53:13-04:00",
      "summary_html": "When you struggle with chronic illness, good days can be hard to come by. But today I felt like maybe I COULD have more good days than bad. Today I was strong.",
      "template_suffix": null,
      "handle": "today-i-was-strong",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/29018914888",
      "image": {
        "created_at": "2019-06-12T17:44:59-04:00",
        "alt": "",
        "width": 1117,
        "height": 1117,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/64260947_383658039023495_2901018840991268864_n.jpg?v=1560375899"
      }
    },
    {
      "id": 28486139976,
      "title": "Why the passing of Luke Perry made us all gasp",
      "created_at": "2019-03-04T17:57:23-05:00",
      "body_html": "<p>It isn't like I sit around the house dreaming of Luke Perry, to be honest, <strong>I haven't really thought about him in decades</strong>. Sure, his name popped up in discussions about Archie and of course 90210, but it isn't like he was the center of the social conversation in regards to pop culture, <strong>at least not these days</strong>. <br><br>But, today when I read that he had died, I quite literally choked up. I felt tears running down my face, and I felt upset all afternoon. <strong>I told my sister, how silly I felt!</strong> It isn't like he was my friend, or even an actor I watched or sought out when new stuff was released. <strong>And yet, my heart broke today reading of his passing. </strong></p>\r\n<p>Perhaps it was because he was so young,<strong> to die at 52 is just so deeply saddening.</strong> My mother died at that age, and now being 38 myself I realize how young that really is. You are just starting to figure out who you are, and be comfortable in your skin. Only to have your life cut short. <br><br>Perhaps it was because it was sudden and without warning. My brother in law died in much the same way. Just driving down the street, and BAM. He suffered a massive stroke and passed away shortly after. <br><br>Or, perhaps it was because <strong>Luke Perry represented something about our generation.</strong> He was the amazing bad boy/good boy who loved his girl with all his heart. We cherished the romance between him and Brenda, we rooted for him! Even when he was messed up, or making bad choices, he was just our guy! He was the TV crush for so many young ladies growing up not just in the USA, but overseas like me and my sister. <strong>He was THE American boy!</strong> The one so many of us dreamed would notice us, or ask us out to the school dance and then eventually become the boyfriend who would hold our hand down the halls. </p>\r\n<p>It wasn't just that he represented our aching teenage hearts, but I think it is also that as the generation that grew up watching him live out this teen to adult soap opera, <strong>we see ourselves in him</strong>. We see our brother, our boyfriend, our class mate, our best friend. <strong>He is us.</strong> And to read the words on the page, that this mirror <strong>and wish</strong> of our generation had died so suddenly, so tragically and so young, is just that painful reminder that we are temporary. It is all borrowed time isn't it? And if it can happen to Dylan, it can sure as hell happen to us. <br><br>So today, I felt a deep sadness. For the loss of  a heartthrob of my generation. I felt a profound humility, that life is not to be taken for granted in the chaos of just making it and surviving. <strong>That would be such a waste, to be living to survive, rather than living with purpose, joy and intent. </strong><br><br>I remind myself of this so often. I KNOW all of this to be true, yet, I fall victim over and over again to the habits of routine and stress. To the grind of the everyday, and the monotony of just get it done. <br><br>But today; today I got shaken. <strong>I got a bitch slap in the face reminding me that we are all incredibly special, and yet, not special at all.</strong> The clock ticks on no matter who you are, or what you do. So, I hope today I can really internalize in a good way this bitch slap. And <strong>be grateful</strong> for what I have rather than constantly chasing what I don't. Hug my kids a little longer before rushing off to check off my next box, kiss my husband more and tell him he is amazing. Make more time to live my life for myself rather than a dollar bill and a thing that in the end is just gonna get left behind when my clock runs out. <br><br>Today, the world lost someone who didn't give us world peace, it isn't like he was Ghandi or moved mountains, or was a humanitarian hero. <strong>He was just a dude</strong>, who acted in some great shows and movies. But he was a dude <strong>who is all of us</strong> dudes (and dudettes.) He is someone that so SO many related to. So, in his passing <strong>I hope we relate again,</strong> and take this opportunity to be reminded that we have an amazing opportunity to love, to live, to be thankful and joyful, and we should hold on to that for as long as we can, as hard as we can. <br><br>RIP Luke Perry. <br><br></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-03-04T18:13:00-05:00",
      "updated_at": "2019-06-12T17:59:00-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "lucky-perry-dies-and-an-entire-generation-gasped",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28486139976",
      "image": {
        "created_at": "2019-06-12T17:59:00-04:00",
        "alt": "",
        "width": 300,
        "height": 300,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/luke-perry-20810855-1-402.jpg?v=1560376740"
      }
    },
    {
      "id": 27975417928,
      "title": "WOW hair \"cocktails\"",
      "created_at": "2018-08-04T00:03:27-04:00",
      "body_html": "<p><span style=\"color: #000000;\">I was at my favorite salon, ChillSpa in Manchester, NH (awesome place by the way) and the day I was there so was this lovely gentleman educating us all about WOW hair care products. I listened only because I am a product junkie and well, this dude was hysterical. Like, super-duper funny but also, knows hair. Good combo! So, he is talking about these three hair “cocktails,”they were <strong>Kale Cocktail, Coconut Cocktail</strong> and <strong>Carb Cocktail</strong> and they came in these fancy silver bottles. Ok, you have my attention. So back to Ulta I go, sheesh I should buy stock at this place! Each bottle costs $25 and naturally I grabbed them all.</span></p>\n<span style=\"color: #000000;\"> <img alt=\"Wow hair care\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/wow_hair_large.jpg?v=1534719040\" style=\"float: left; margin: 25px;\" width=\"135\" height=\"203\"></span><br><span style=\"color: #000000;\">The Kale cocktail <strong>claims to strengthen hair, detangle and reduce breakage</strong>. The Coconut cocktail <strong>says it will provide hydration, shine and and silkiness.</strong> The Carb cocktail i<strong>s apparently heat activated and claims to give hair fullness and volume</strong>, but I personally <span style=\"text-decoration: underline;\">didn't notice any change</span> in the size or thickness of my hair with that product. </span><br><br><span style=\"color: #000000;\">I will say, they smell delicious, not overwhelming or perfumy. <strong>The Kale and Coconut cocktails made my coarse curly hair soft, shiny and manageable</strong> but a little goes a long way so avoid using a ton which will create a greasy vibe. </span><br><br><span style=\"color: #000000;\">Not cool unless you are a grunge rocker. </span><br><br><span style=\"color: #000000;\"><strong>I actually looked at my hair under my microscope</strong> (yes I am a giant nerd) after applying the products and my strands were solid and smooth, no frays or breaks. Far cry from the norm!</span><br>\n<p><br><span style=\"color: #000000;\"><strong>I would recommend</strong> the Kale and Coconut cocktail to anyone who wants healthy, shiny hair, without being weighted down or smelling like a perfume lady spritzing your face at Macys. The Carb cocktail didn't really do much for me. </span></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-02-20T09:30:00-05:00",
      "updated_at": "2019-02-20T09:30:34-05:00",
      "summary_html": "<span style=\"color: #000000;\">The bottles say WOW, do they deliver?</span>",
      "template_suffix": null,
      "handle": "wow-hair-cocktails",
      "tags": "beauty, product reviews, selfcare, skincare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/27975417928",
      "image": {
        "created_at": "2018-08-04T00:03:27-04:00",
        "alt": "",
        "width": 2688,
        "height": 4032,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/wow_hair.jpg?v=1533355407"
      }
    },
    {
      "id": 28350152776,
      "title": "Our defining moments",
      "created_at": "2019-01-27T20:07:09-05:00",
      "body_html": "<p>It was a Sunday of rest for me, so of course that means I had to binge watch something, and I ended up watching a show called The Eighties on Netflix. <strong>It was like watching a memoir of my youth</strong>. So many historical moments that were lost in a sea of memories came back fresh as new.</p>\n<p>When we are young the days drag on and it seems like forever to get from one weekend to the next, one play date to the next, one birthday to the next! <strong>Entire eternities stretch between our milestones</strong>, and despite what seems like forever, we blink and 3 decades have raced by.</p>\n<p>How does it happen? That on one hand life can seem a snails pace, and the next fast enough to give you whiplash. It makes no sense. <strong>And most of life is just a blur, most moments don't stand out, they just blend together, hour after hour, day after day. </strong></p>\n<p style=\"float: left;\">But, there are moments of life that stand out, <strong>defining moments that shine bright.</strong> There are the obvious ones, marriage, the birth of a child, divorce, death of a parent, getting into college and losing your virginity. These are milestones that most remember as rights of passage through life.<strong> I am talking about moments that are unique to each of us.</strong> Experiences that stand out to us but to someone else might seem totally stupid or meaningless. <em>It is these unique, incredibly personal events that shape us as individuals and give our lives even more meaning. </em><br><br><img alt=\"aha concert\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/aha_conert_stage_large.jpg?v=1548724627\" style=\"float: left; margin-top: 15px; margin-right: 15px; margin-bottom: 15px;\" width=\"285\" height=\"214\"><br>I have a bunch of these memories that stand out for me, but one in particular was a trip my sister and I took to Europe last year to see A-ha in concert. I will never forget the way I felt when I heard the first song played live, the voice of my childhood just feet away from me.<strong> A soundtrack to decades of my life suddenly just, right there, in person. </strong></p>\n<p style=\"float: right;\">I will never forget the smell of the air in Vienna, or the strange food and grocery stores in the middle of shopping malls. I will never forget the incredible Alps, and the train conductor who thought my sister and I were the worst passengers EVER and who yelled at us constantly to BE QUIET!!! I will never forget the sight of Zurich, so majestic and perfect it seemed impossible that it was real. <br><br>I have had several low lows since that trip, and when things have seemed so bleak <img alt=\"aha black and white\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/aha_b_w_large.jpg?v=1548724679\" style=\"margin-top: 15px; margin-left: 15px; margin-bottom: 15px; float: right;\" width=\"239\" height=\"179\">and dark,<strong> I remember that trip</strong>. I listen to an A-ha song from their concert album and those moments come back as if I was there again. It is a sanctuary of happiness, and more than a memory, it's a visceral connection to an experience. <br><br><strong>I have spent most of my life striving for things,</strong> but when I really stop and think about what has made me who I am, or what has brought me the most joy, the most peace and the most hope, <strong>it isn't things</strong>. Its experiences. It is the stories I have created myself to furnish my life that live on in perpetuity. I am quite certain that when I die, I will remember that trip. I will remember walking the streets of Europe with my sister, I will remember hearing Morten Harket's voice and tearing up that the 30 year wait was worth it! </p>\n<p><strong>Life is so incredibly hard for most of us</strong>, and we spend a lot of it between crisis and bills. <strong>A constant battle between survival, and living</strong>. If there is one wish for this year, for me and my family, it is that we can be champions of personal experience. That we can pursue moments and experiences that will shape us and help us be more fulfilled, more happy and more at peace. </p>\n<p>Try to say YES more to going out with friends, date night with your husband, trips or time off. Try to say YES to experiencing your life, rather than being a bystander to it. This life is for you. Pick one day and make it your yes day, and see where the world takes you!</p>\n<p>I would LOVE to hear some of your stand out memories, or maybe something you want to do and hopefully after reading this blog, you will! Let's hear them!!</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-01-28T20:40:00-05:00",
      "updated_at": "2019-01-28T20:40:55-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "defining-moments",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28350152776",
      "image": {
        "created_at": "2019-01-28T20:18:29-05:00",
        "alt": "",
        "width": 2320,
        "height": 2328,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/aha_concert.jpg?v=1548724709"
      }
    },
    {
      "id": 28339634248,
      "title": "You are NOT a grasshopper",
      "created_at": "2019-01-22T11:08:37-05:00",
      "body_html": "<p>If my sister says this to me ONE MORE TIME....<strong>.it means I haven't been listening. </strong></p>\n<p>I talk to my sister a lot. She is someone who has suffered through decades of an exhausting sibling relationship.<span style=\"text-decoration: underline;\"> I am not an easy person</span>. I suffer from a host of psychological and emotional issues and my coping mechanism is validation and conversation. Which means lucky Minessa gets to sit on the phone and deal with me and my neurosis. Day after day, year after year. </p>\n<p><strong>I don't mean to be a burden to her, and she doesn't make me feel like one</strong>. But I know that I am. And often, when i speak to her about my struggles she says to me, <strong>\"Saira, YOU are NOT a grasshopper!!!</strong><em> If you don't like something, YOU have the power to make a change.\" </em></p>\n<p>I will be honest, for many many years, I dusted her comments off as lack of understanding,<span style=\"text-decoration: underline;\"> she just doesn't get it.</span> She doesn't understand what it's like to be me. Trapped like a hamster on a wheel in my own mind, constantly spinning around in anxiety, hypochondria, worry and fear. I hide it well from the world, <strong>but in reality I am a high functioning anxious mess. </strong><br><br></p>\n<p>This past year I have tried to let the words sink in rather than bounce off. I am NOT a grasshopper, I am not a prisoner of \"that's just the way it is\". <em>I have the choice to retrain my brain by taking action to create the life I want. </em><br><br>I know so many others who are trapped, just like me. Thought patterns that day after day just become a part of us, and it feels like there is no escape. Our brains are like river beds and our thoughts are like water. <strong>When the water flows in the same spots over and over again, pathways are made</strong>. And after a while, when we are triggered and start to think, the thoughts go to the pathways that have already been made. Panic, anxiety, fear etc etc. </p>\n<p>But JUST as these pathways were made,<strong> they can be unmade</strong>. By taking a different action when you start to feel your mind going to those places. Step 1 is to accept that these are habits of comfort, as whacked as that sounds. The thoughts may make us feel bad, <strong>but the ritual of anxiety is comforting in its familiarity</strong>. Just like smoking a cigarette or eating ice cream. <em>Our brain takes twisted comfort in the familiarity of our anxiety. </em></p>\n<p>As my sister says.<strong> I am not a grasshopper.</strong> I am a person who is capable of change. I think personally I have come to see fear as a prophylactic. As long as I am scared, or anxious, I am protected. I think we all know that just isn't true. <strong>We aren't safer because we worry,</strong> we aren't preventing XYZ from happening because we obsess about it. We cannot always control what will be, but what<strong> can always control how we feel about what happens, and how we feel along the way. </strong></p>\n<p>So, today is the start of a new habit. When my brain starts to have those feelings of anxiety, or fear or dread, instead of letting myself get sucked into the raging river or habitual emotion, I am just going to say, <strong>not today grasshopper.</strong> I am going to DO something else. I am going to pick up some pliers and make an earring, I am going to ship I am going to interact with my community and tell them, hey I am on the way to an anxiety attack, make me laugh! <strong>I am going to CHOOSE not to let habit dictate my life. </strong></p>\n<p>If you are like me, and you struggle too, I invite you to comment below, <a href=\"http://community.sairavalley.com\" title=\"join\">join my community</a>, and we will conquer together. Just because this is what life is like today, doesn't mean it has to be like this tomorrow. <strong>Change is a choice. And I am going to choose it. </strong></p>\n<p>Be sure to check out our podcast later this week where Minessa and I will discuss this exact topic. </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-01-22T11:51:00-05:00",
      "updated_at": "2019-01-22T12:04:03-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "you-are-not-a-grasshopper",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28339634248",
      "image": {
        "created_at": "2019-01-22T11:51:48-05:00",
        "alt": "",
        "width": 2261,
        "height": 2261,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/18_size.jpg?v=1548175908"
      }
    },
    {
      "id": 28308242504,
      "title": "How I am still happily married, 2 decades and 3 babies in!",
      "created_at": "2019-01-08T13:12:12-05:00",
      "body_html": "<p>2 decades is a really long LONG time for a 38 year old; <strong>it's more then half my life!!</strong> That's how long I have been with my husband (on and off) until we finally got married in 2007. We have 3 kids, run a business, a family, a house, and somehow we do it happily, and in love. </p>\r\n<p>People always ask me, <strong>what is your secret.</strong> How is it after so many years together you can still be happy, and in love?</p>\r\n<p style=\"float: left;\"><img alt=\"Butch and saira youth\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/butch_and_saira_youth_39e00653-b9ce-4eca-9a08-ff92e07cd7aa_large.jpg?v=1546974470\" style=\"float: left; margin: 10px;\" width=\"241\" height=\"221\">It's true. After 20 years of either staring at his picture, or his face, I still feel the same way about Butch as I did when I first saw him at a nightclub in Boston. I was 18 and my sister and I would go to a club called Axis for 80's night. We danced to the best music and laughed and had the most fun I think I have ever had in my life! <br><br>One night, I saw him. And I swear it was quite literally <strong>love at first sight.</strong> It would be months before I would work up the courage to talk to him. I remember the moment so clearly. Depeche Mode was playing over the speakers, Policy of truth, and he was walking through the crowd. Hair slicked back, side burns perfectly groomed like Elvis, and I walked over to him and placed my hand on his arm and said, \"Excuse me, I just have to tell you, I think you might the most handsome man I have ever seen.\" <br><br>I was shaking, so afraid he would reject me. <strong>But he smiled</strong> and put his hand on mine and said, \"Thank you so much.\" Our first date, I lied to him and said i REALLY wanted to see the Exorcist (a movie I swore I would never watch because it's the only movie that ever scared my father) and we ended up watching the movie and walking around Boston all day. It was like a fairy tale. <strong>And I was smitten. </strong><br><br><img alt=\"Date night\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Butch_and_saira_date_large.jpg?v=1546974510\" style=\"float: right; margin: 10px;\" width=\"230\" height=\"173\">Our love affair was far from easy. while it had a passionate romantic beginning, it has been weighted by battles with  depression, death, financial struggles, anger, miscarriage, separation for long periods due to work and dreams, and a million other mountains in between. By all counts, we really should have split up a dozen times over. <strong>There have been times where life has brought us both to our knees</strong>, and marriage seemed like the hardest thing to stick out. Where we were miserable frankly. And yet, we remain strong, we remain loving, and we remain together. <br><br>We have a few elements of our marriage that are less or more traditional depending on the time period you are referring to. The first is <strong>we don't share a bedroom.</strong> Originally we kept separate bedrooms because Butch snored like crazy and it made sleep very difficult for me. We also had very different sleep schedules so it never made sense for one of us to disturb the other. Over time we found that we liked having separate spaces, where we could have privacy and live how we wanted independently,<strong> and when we were together it was by choice, not by default.</strong> Besides, I like pink bedding. <br><br><img alt=\"butch and sai kissing\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/butch_and_sai_kissin_large.jpg?v=1546977968\" style=\"float: left; margin: 15px;\" width=\"272\" height=\"204\">We are very open and honest, even if that honesty might mean something painful or it's something we know the other person doesn't want to hear. <strong>We have a deep respect for the truth between us, that above all else, what hurts relationships more than anything is lack of honesty.</strong> Being truthful about painful things is never easy, but we believe that as spouses we are each others safest place first and foremost. But, we behave with rules in place that honesty requires open mindedness, and a loving non judgmental ear. <br><br>Forgiveness, <strong>and letting go</strong>. No person is perfect, no marriage is either. People make mistakes, say mean things out of pain, and can be distant or cold not out of any directed malice to their partner, but rather an internal struggle that keeps them from connecting with those around them, especially their spouses. Butch and I are happy but not because we are immune from struggles. <strong>But because we don't hold our arguments or pain as weapons against each other.</strong> Whatever has happened good or bad, it has all been part of our journey together as husband and wife and as friends. <br><br>Knowing our roles. And no, this doesn't mean traditional roles. It means <strong>we each have a part to play in keeping our home and our life running</strong>, and we agree to those roles and stick to them. So for example, I am the one who does dishes. That is my job, Butch cooks, that is his job. Having an agreement on who does what helps avoid arguments of why didn't you do XYZ. <strong>It provides balance, and harmony when everyone knows what is expected of them. </strong></p>\r\n<p style=\"float: left;\">Learning and dreaming together. Butch was on the road for a long time on and off during our early years, he traveled with his race car. And I won't lie, I hated it! But <strong>he taught me how important it is to support someones dream, even when it isn't your own.</strong> Butch supports my dream to be an actress, even though it means me being away from home for extended periods of time and for him to essentially be a single parent while I am away. <br><br>Vacations. You know, money is always tight. That is just the way life is for most people. Taking vacations <strong>seems like an impossible task both in regards to money, and time.</strong> but family vacations even if they are small, are meaningful and build not just memories, but strength within your family. Whether that family is 2 people or 12. Make time to step out of your life, out of your home, and experience the world together. <strong>It forges a new kind of bond, and memories that will last a lifetime. </strong><br><br><img src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/kids_pic_large.png?v=1546977846\" alt=\"kids\" style=\"display: block; margin-left: auto; margin-right: auto;\"></p>\r\n<p style=\"float: right;\">And last, our children. <strong>Our kids are stressful</strong>, like, oh my god. STRESSFUL. But they are also wonderful, and full of magic. Most days are chaos in our house, we are not organized, we are a mess. <strong>There is absolutely NO organization</strong>. I still feel like I am playing house most days, waiting for my kids to realize their parents are giant frauds who have NO idea what the are doing day after day! But do any of us? <br><br>I recall as a child thinking my parents knew it all. Man oh man, now I know they were just stumbling through, doing the best they could to give us as much love and stability as possible. But they were CLUELESS. <strong>Butch and I know we are not the perfect parents,</strong> and we both try to help the other along without being sensitive or getting hurt feelings about constructive criticism. Parenting in our home is a two parent job (because there are two of us) so we have to be united on our stance. It doesn't come naturally, <strong>but it comes with  honesty and openness about tough things.  </strong></p>\r\n<p style=\"float: left;\"><img alt=\"Butch and saira annv\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Butch_and_saira_annv_large.jpg?v=1546978608\" style=\"float: left; margin: 10px;\" width=\"208\" height=\"278\">I think in closing, what has helped me and Butch above ALL the other things I have already mentioned above, <strong>is that our desire to be together is greater than any desire to be apart.</strong> We are best friends, we are more than married. We choose to be together, and when you make that choice to be deliberate and on purpose with your relationship, it makes other things a lot easier. <br><br>We aren't perfectly married, and in most cases we don't follow the normal standard of what a married couple looks like. Separate rooms, brutal honestly, role reversal for some of the home stuff;<strong> but we came up with a marriage that worked for us</strong> so we could maintain our sanity, our intimacy and our happiness. <br><br>I have been with this man for more than half my life. Through so many trials. But he is my favorite person, and I hope for another 60 years together! </p>\r\n<p style=\"float: right;\"> </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-01-08T16:29:00-05:00",
      "updated_at": "2019-01-08T16:33:36-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "how-to-be-happily-married-after-over-2-decades-together",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28308242504",
      "image": {
        "created_at": "2019-01-08T16:33:36-05:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/wedding_pic.png?v=1546983216"
      }
    },
    {
      "id": 28291366984,
      "title": "How I lost 35 LBS in 6 months without fad diets or gimmicks, and how YOU can too.",
      "created_at": "2018-12-26T12:59:20-05:00",
      "body_html": "<p style=\"float: left;\">With the new year approaching, I know many of my friends and family are looking to live a healthier lifestyle and lose weight. But this story isn't about weight, but rather, what carrying extra weight does to your health and longevity. <br><br>I went on a weight loss journey last year and lost 35 lbs in just 6 months. But as you embark on this journey, be aware. Anyone who tries to sell you a pill, or magic drink that they claim is going to melt your pounds, isn't looking out for the health or size of your bottom, they are looking out for the health and size of their bottom. The only way to BE healthy, is to eat healthier foods and move your body in healthy ways. <strong>But it doesn't mean crazy work outs, or crazy diets, or giving up every single thing you love. Read my story to find out how I lost 35 lbs and then another 10, just by following a simple, sustainable 2 step plan. </strong></p>\n<p style=\"float: left;\">I topped the scales at 191 pounds in the Fall of 2017. <span style=\"text-decoration: underline;\">My health was in the toilet</span>, my cholesterol was high, my blood sugar was borderline diabetes and I couldn't even take a walk with my kids without breaking into a sweat and running out of breath. <br><img alt=\"SV and MAK \" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/sv_overweight_2_large.jpg?v=1545944217\" style=\"float: left; margin: .5px 1px .5px .5px;\" width=\"149\" height=\"331\"><br>At just 37 years old, <strong>I didn't understand how I had let myself go</strong>. I had three kids, and I worked long hours, but I didn't think my diet was that bad, or that my lifestyle was sedentary enough to pile the pounds on like that. <br><br>The scale and my lab tests disagreed. <strong>I knew I had to make a change, or my poor health was going to put me into an early grave. </strong><br><br>The first step for me towards better health was <strong>accepting</strong> that if I wasn't happy or healthy, <em><strong>I had to make a change</strong></em>. I couldn't expect to be healthier, be at a better BMI and body weight without making any changes at all. But to make changes, I first had to figure out <span style=\"text-decoration: underline;\">WHAT</span> needed to change. And that meant being 100% honest with myself about the choices I was making, and believe me, <strong>that was really REALLY hard. </strong><br><br>I began evaluating my diet and what I was<strong> regularly</strong> putting into my body. For me it was Dr. Pepper (aka nectar of the Gods), ice cream and eating meals out of the house. I was astonished when I realized how many calories <strong>I was drinking every single day</strong>. So my first step was to cut Dr. Pepper out of my diet completely and I cut my ice cream and eating out by 2/3.</p>\n<p>Now before we go any further, two things. The first is that you will notice is that I limited ice cream and eating out, but I completely cut out Dr. pepper. <strong>Why?</strong></p>\n<p style=\"float: right;\"><img alt=\"Sv with MAK and AB\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/SV_overweight_large.jpg?v=1545944325\" style=\"float: right; margin: .5px;\" width=\"239\" height=\"179\">Because I know myself, and I am not capable of \"cutting back\" on Dr. Pepper. It is my krypotine and I have <strong>no self control when it comes to it</strong>. My sister's krypotine is ice cream. So she can have just one Dr. Pepper once in a while, but if she cracks open her Haagen Daaz coffee ice cream, she will eat the whole pint, night after night. I have found this reality to be true for most people, they have a gateway food that lowers their ability to set limits and controls with other foods, and it creates a cascade of poor food decisions. </p>\n<p>When you are evaluating what you <strong>need to CUT</strong> our of your diet VS. what you need to <strong>REDUCE</strong> from your diet, <strong>separate your food into categories of self control and no self control. If you cannot control how much you eat, you have to cut it out.</strong> This is where that brutal honestly comes into play, AND where keeping the weight off comes into play. <em>By eliminating my highly addictive food items, but limiting others</em>, I created a \"diet\" that I could stick to over the long term. You want to<strong> create eating habits that you can sustain. </strong></p>\n<p>Second, I realize how hard this is, I don't say this lightly as if it's easy to just drop something highly addictive like a sack of potatoes. But YOU have to make a decision about what matters more.<strong> Your health, or your habits. </strong></p>\n<p>By removing Dr. Pepper from my diet <strong>I lost 10 lbs in 10 days</strong>. No joke. </p>\n<p>It was also important for me to<strong> re-evaluate my relationship with food.</strong> For many years, through depression, stress and anxiety, food was a ritual. <em>And I had imbued food with this healing power</em>. As long as I saw food as  a bandaid for whatever my woes were for the day, the longer I would stay trapped in a cycle of eating my pain, and making my physical and mental health worse. I had to <strong>reframe food as fuel for my body, not medicine for my soul</strong>. This shift in mindset really helped support better decision making. </p>\n<p style=\"float: left;\"><img alt=\"walking\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/walk_large.jpg?v=1537980514\" style=\"float: left; margin: .5px;\" width=\"189\" height=\"126\">Step 2 was <strong>movement</strong>. When you are 1 pound away from obese, and have other health issues like creaking joints and achy muscles, moving can be very, very hard. But the good news is you do NOT have to RUN a marathon your first week. <strong>All you need to do is take small steps</strong>. So here is what you are going to do. </p>\n<p>You are going to put on some sneakers, dress for the weather, grab a bottle of water and <span style=\"text-decoration: underline;\">GO OUTSIDE. </span><br><br><strong>Why outside? </strong></p>\n<p>For one the fresh air is really REALLY good for your mind, your body and your soul. Second, when we walk on a treadmill <span style=\"text-decoration: underline;\">we can get off when we get tired</span>. But to effectively lose weight and build stamina, <strong>we have to PUSH ourselves</strong> a little bit more everyday. When you walk outside, when you get tired <strong>you have to turn around and get back home.</strong> There are <span style=\"text-decoration: underline;\">no stop buttons or easy off options</span>. This is again when brutal honesty with yourself and your goals will matter. <span style=\"text-decoration: underline;\">Put yourself in the environment where you have the <strong>maximum opportunity to succeed. </strong></span><br><br>The first time I walked outside,<strong> I only managed 1/4 of a mile</strong>. Which means 1/8 of a mile out, and 1/8 of a mile back. I was devastated that it was all I could do. I came home and cried and thought the road ahead was <strong>so endless</strong> I should just drown myself in Dr. Pepper and leave this foolish notion of healthy living behind. </p>\n<p style=\"float: left;\"><span style=\"text-decoration: underline;\">But I didn't.</span> I let myself have my 5 minute pity party, and committed to no Dr. Pepper, and to walking again the next day. And I also promised myself that I would add a few steps to my walk every single day. <br><br><img alt=\"Stop sign win\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/walking_to_stop_sign_large.jpg?v=1545944530\" style=\"float: right; margin: .5px;\" width=\"187\" height=\"250\">So the next day, I walked again. But when I got to the landmark where I turned around the day before, <strong>I pushed a few extra steps before turning back</strong>. It was through this daily method of <strong>slow increase</strong> that I took my walks from <strong>1/4 of a mile to 3 miles, 6 days a week</strong>!! <br><br>This image captures a HUGE win for me, it was the day I made it to the END of Blood road (my walking path). And walking from the beginning of Blood road to the end and back is a TWO mile walk. When I began, and could only manage 1/4 of a mile, I never imagined the day would come where I would make it 2 miles. But as you can see, I made it to 2, and then on to 3. <strong>Just by adding a few steps a day!</strong><br><br>In fact, my walks became the ANCHOR activity of my day, and created tremendous momentum and added stability to my life. I found that after a few weeks of adding steps, and moving consistently, <strong>my weight started to melt off.</strong> My energy increased and I wanted to exercise more! I paid more attention to what I ate <strong>not by force, but by desire</strong>. Because I knew how hard I had worked to walk that day, and I wanted to maintain the results of that work so I was motivated to <strong>make smarter choices. </strong><br><br><strong><img alt=\"side by side\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/weight_side_by_side_large.jpg?v=1545944672\" style=\"float: left; margin: .5px;\" width=\"220\" height=\"220\">By doing this for 6 months, I was able to lose 35 lbs, and 15 months later, I have not gained back a single pound</strong>. In fact as my energy increased I added in barre classes and a personal trainer to lose an additional 10 pounds in 3 months! <span style=\"text-decoration: underline;\">But I had to build up to that by taking incremental steps to build my stamina, endurance and strength.</span> I still eat ice cream, I still eat chips and enjoy eating out, <strong>I haven't given up any of the of the foods I love</strong>, EXCEPT Dr. Pepper. And I am convinced, that making that one simple change, helped my body and my brain recalibrate to have a consistently healthier relationship with food that I have sustained. <span style=\"text-decoration: underline;\"><br><br></span>Weight loss and reclaiming your health doesn't have to be like climbing Mt. Everest. <strong>You can do HUGE things, with small steps</strong> but you have to be ready. Ready to have an <strong>honest</strong> talk with yourself about what you are doing to sabotage yourself, what you need to cut out of your diet and get yourself moving outside. I started my weight loss journey in October 2017, <em>and went right through a brutally cold New England winter.</em> I walked in snow, sleet and -15 degree weather. I made no excuses because in the end, no matter how I rationalized or justified my choice to my mind, my body would know. </p>\n<p style=\"float: left;\">If you want to be healthier, stronger, leaner and FEEL good, you owe it to yourself to start NOW. You CAN do it. To get my FREE cut the crap guide, <a href=\"https://mailchi.mp/910875b37228/it75cuokpg\" title=\"Mailing list landing page\">just click here</a>! <br><br>This isn't a journey or a story about weight or vanity, but about health.  If you found this article helpful, Be sure to share it! You can also check out more of my story and additional tips on <a href=\"http://sairavalley.com/wp-content/uploads/2018/12/Cut-the-crap-Guide.pdf\" title=\"Youtube video for weight loss\">youtube! </a></p>\n<p style=\"float: left;\">Shine on my friends, shine on!<br>XOXO</p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<br>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p style=\"float: left;\"> </p>\n<p> </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2019-01-02T12:18:00-05:00",
      "updated_at": "2019-01-02T21:00:21-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "how-i-lost-45-lbs-in-6-months-without-fad-diets-or-gimmicks-and-how-you-can-too",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28291366984",
      "image": {
        "created_at": "2018-12-27T16:10:01-05:00",
        "alt": "",
        "width": 2048,
        "height": 2048,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/weight_side_by_side.jpg?v=1545945001"
      }
    },
    {
      "id": 28277833800,
      "title": "Chicken Pot Pie",
      "created_at": "2018-12-17T15:14:38-05:00",
      "body_html": "<p>OK listen up. If you do not have <a href=\"https://amzn.to/2BowFIl\">an instant pot, get one</a>. It will save you a TON of time and it is perfect for making the stuffing for chicken pot pie, along with MANY other things. <br><br>My son is obsessed with this pot pie recipe. It is fast, healthy and delicious! This will make two pies so you will have plenty of left overs. <br><br><span style=\"text-decoration: underline;\"><strong>Ingredients:</strong></span></p>\r\n<ul>\r\n<li>4-6 chicken breasts </li>\r\n<li>2 cans condensed chicken soup </li>\r\n<li>1 can water (use the empty soup can)</li>\r\n<li>1 bag chopped frozen onion (or 2 diced fresh)</li>\r\n<li>2 tsp Garlic powder</li>\r\n<li>1 tsp Salt</li>\r\n<li>1 tsp Pepper</li>\r\n<li>4-5 yellow potatoes (cubed)</li>\r\n<li>2 bags of mixed frozen peas, carrots and corn (or any veggies you prefer)</li>\r\n<li>2 ready made pie crust </li>\r\n</ul>\r\n<p><br><span style=\"text-decoration: underline;\"><strong>Instructions:</strong></span><br>I use my Instant pot for this recipe. Pour condensed soup and water into the pressure cooker, then add dry spices and onions and mix well. Add whole chicken breasts and close the pot, cook for 30 minutes. If you don't have a <a href=\"https://amzn.to/2QAH3ak\" title=\"genius chopper\">genius chopper</a>, you need one for any and all chopped potatoes. They make it VERY easy to cut fast. Just be careful the blades are sharp!<br><br>Open pot and use two forks to shred the chicken. The chicken should be VERY tender after cooking under high pressure for 30 minutes. If you find its still a bit tough, you can cook an additional 10 minutes. Shred chicken and then add frozen vegetables. <br><br>Roll out the crust and place into two pie pans. Use a ladle to scoop the pot pie mixture into the pie crust. Cover with top crust. You can use an egg wash on top of the crust to add a glossy golden finish! <br><br>Bake according to the pie crust instructions and chances are you will also have left over filling to eat as chicken stew!<br><br>Happy Feasting!<br><br></p>",
      "blog_id": 22436937800,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-12-17T15:30:00-05:00",
      "updated_at": "2018-12-17T15:52:11-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "chicken-pot-pie",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28277833800",
      "image": {
        "created_at": "2018-12-17T15:52:11-05:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/pot_pie_2.png?v=1545079931"
      }
    },
    {
      "id": 28276228168,
      "title": "Mashed Potatoes",
      "created_at": "2018-12-16T23:34:22-05:00",
      "body_html": "<p>Nothing says home cooked meal like mashed potatoes. They are the perfect side dish for meatloaf, fried chicken, chicken picatta, the list goes on and on! <br><br>The perfect mashed potato really comes from the right type of potato. I personally LOVE to use a good yellow potatoes. White ones tend to have a watery consistency so I avoid them. The recipe below is for a family of 4, so just increase the number of potatoes used based on people. Generally 1-1.5 potatoes per person is the right amount. <br><strong><br>Ingredients:</strong></p>\n<ul>\n<li>4 – 6 medium potatoes </li>\n<li>water</li>\n<li>salt</li>\n<li>butter</li>\n<li>milk (optional)</li>\n</ul>\n<p>You can add a handful of cheddar, or parmesan to the mashed potatoes for extra flavor as well. </p>\n<strong>Instructions:</strong><br>\n<p><span style=\"font-weight: 400;\">Peel potatoes and cut into cubes. I love the <a href=\"https://amzn.to/2R0j2sK\" title=\"genius chopper\">genius chopper for this</a>, because you can literally put an entire potato into the chopper and smash it down and be done in under 60 seconds. <br><br>Put chopped potatoes in saucepan with enough water to cover potatoes. Bring to boil. Turn heat to simmer and boil till potatoes are soft. Drain water. <a href=\"https://amzn.to/2S3PUOv\" title=\"hand masher\">Use a hand masher </a>, I like this one because it's super easy to mash AND clean. The ones with the square cut outs are a nightmare!<br><br>Add butter and salt to taste. If you want creamy mashed potatoes add a little bit of milk at a time, do NOT add a ton at once, you cannot take milk away! So just 1 TBS at a time until you reach the desired texture. <br></span></p>\n<p><span style=\"font-weight: 400;\">Mashed potatoes are a GREAT leftover. So if you are making them, cook extra to have for lunch or dinner the next day. This will save you time AND money. And that is a win, win. Literally. <br>Happy Feasting!</span></p>",
      "blog_id": 22436937800,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-12-16T23:39:00-05:00",
      "updated_at": "2018-12-16T23:39:12-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "mashed-potatoes",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28276228168",
      "image": {
        "created_at": "2018-12-16T23:34:22-05:00",
        "alt": "",
        "width": 500,
        "height": 494,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/mashed_potatoes.jpg?v=1545021262"
      }
    },
    {
      "id": 28276162632,
      "title": "Home Made Fried Chicken",
      "created_at": "2018-12-16T22:55:47-05:00",
      "body_html": "<p style=\"float: left;\">Growing up fried chicken was a <strong>BIG staple for us.</strong> We ate it a lot and my parents loved white meat, so they forced me and my sister to eat the dark meat. YUCK. So now, I only make fried chicken with chicken breast, but you can 100% use legs or thighs as well.<img alt=\"Fried chicken\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/fried_chicken_dinner_large.jpg?v=1545020141\" style=\"float: left; margin-top: 15px; margin-right: 15px; margin-bottom: 15px;\" width=\"221\" height=\"213\"><br><br>A good fried chicken <span style=\"text-decoration: underline;\">should have a crispy but not heavy crust</span>. You can achieve this by using <strong>less egg and more milk</strong>, <strong>and adding baking soda to your dry ingredients.</strong> The baking soda gives the crust some rise, while the egg creates some stickiness for the batter without making it pasty or heavy. <br><br>Got picky eaters? No problem! Make the first round of chicken as I have instructed, but then add parmesan cheese to the dry mix, or c<span>ayenne pepper</span>. Fry up and you have TWO batches of fried chicken with the same amount of work. No extra dirty dishes. <br><br>You can even grab a packet of dry Ranch seasoning and add it to your dry mix for some added flavor. <strong>The options are endless!!</strong> I love to eat fried chicken with mashed potatoes or home made potato salad. Be sure to look for those recipes coming soon!</p>\n<p style=\"float: left;\"> </p>\n<p><span style=\"text-decoration: underline;\"><strong>Ingredients:</strong></span></p>\n<p class=\"para-style-body\"><em><strong>Flour Mixture</strong></em></p>\n<ul>\n<li>4 small Chicken Breast (filet these</li>\n<li>2 cups Flour</li>\n<li>2 TBS Garlic powder</li>\n<li>1 TBS Onion Powder</li>\n<li>1 tsp Salt </li>\n<li>1 tsp Pepper</li>\n<li>1/2 tsp Baking soda</li>\n</ul>\n<p class=\"para-style-body\"><em><strong>Wash Mixture</strong></em></p>\n<ul>\n<li>2 cups almond milk (or plain milk)</li>\n<li>1 egg</li>\n</ul>\n<p class=\"para-style-body\"> <strong>Instructions:</strong></p>\n<ul>\n<li class=\"para-style-body\">Mix dry ingredients in one bowl, wet in another.</li>\n<li class=\"para-style-body\">Filet chicken if the breast is thick.</li>\n<li class=\"para-style-body\">Heat preferred oil, but don't try to submerge the chicken. We want fried, not deep fried!</li>\n<li class=\"para-style-body\">Dredge chicken in the flour mixture, then dip into egg mix. repeat.</li>\n<li class=\"para-style-body\">Place into fry pan and fry both sides until deep gold brown.</li>\n<li class=\"para-style-body\">Lay chicken on paper towel to soak up excess oil</li>\n<li class=\"para-style-body\">Serve with mashed potatoes!</li>\n</ul>\n<p>TIP: Fried chicken is GREAT for leftovers. So, I always make double the amount I know I need so i can have some tucked away for lunch or dinner the next night. It won't add much time, but it will save you time and money! And that is always a plus!</p>\n<p><br>Happy feasting!! </p>\n<p> </p>\n<p> </p>",
      "blog_id": 22436937800,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-12-16T23:24:00-05:00",
      "updated_at": "2018-12-16T23:40:39-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "home-made-fried-chicken",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28276162632",
      "image": {
        "created_at": "2018-12-16T23:08:35-05:00",
        "alt": "",
        "width": 490,
        "height": 473,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/fried_chicken_dinner_1a3ad0a8-3728-4056-92a9-1baf89d2830a.jpg?v=1545019715"
      }
    },
    {
      "id": 28245819464,
      "title": "The benefits of tryptophan",
      "created_at": "2018-12-02T19:06:52-05:00",
      "body_html": "<p><strong>I suffer from adrenal fatigue.</strong> I will go into all the details about my battle in another post, but suffice it to say, it sucks. It can make it very hard to fall asleep, and then very hard to wake up and overall affects my mood and happiness. </p>\n<p>I also suffer from <strong>anxiety, hypochondria, and a host of other psychological issues</strong>. I was on medication to help me cope for over a decade, Zoloft to be exact. But over the years, the zoloft contributed to weight gain, moodiness, depression, loss of sex drive, and it frankly didn't make me feel better. <strong>I personally just felt numb. Which I suppose is good if you usually feel bad. </strong><br><br>I successfully weaned off of Zoloft <span style=\"text-decoration: underline;\"><strong>under the supervision of my doctor</strong></span>, and after a year of this slow wean, I was drug free, and left to cope with my issues unmedicated. <br><br>This is the time when I started to be very interested in how to help my body heal through diet and exercise. Now, let me be plain. <span style=\"text-decoration: underline;\">This is just MY experience</span>. I fully recognize that medication is a vital part of the health and wellness of a great part of our society, and I am relieved that we live in a time where there are such amazing products available to help people on a chemical level live full and happy lives. </p>\n<p>However, for me personally, after trying 6 different medications without feeling like i was IN my life, <strong>I decided I needed to try something new. </strong><br><br>My doctor had told me that part of <strong>my issue</strong> was serotonin ( feel good hormone) and the medication she put me on was designed to help me body keep more of it in my brain. <br><br><strong>So I wondered, how does you body actually MAKE this neurotransmitter? </strong><br><br>In simple plain terms, your body uses an amino acid called tryptophan to manufacture serotonin! Say what!! <br><br><strong>That's right.</strong> That delicious turkey meat you eat that makes you sleepy, contains an essential amino acid we all know well. But it does a heck of a lot more than anecdotally make you sleepy. <br><br><em>Your body must get tryptophan from diet</em>, it is not something it can produce on its own. Foods like turkey, eggs, oats, milk, yogurt,  red meat, fish and almonds to name a few are high in tryptophan. </p>\n<p>When we consume these foods, <span style=\"text-decoration: underline;\">t</span><span><span style=\"text-decoration: underline;\">ryptophan has the least representation</span>, which means all those other amino acids kick it to the curb. The best way to support the absorption and </span>transmission of this critical amino acid to help you make that happy hormone,<strong> is to increase your body's insulin by consuming carbs. </strong></p>\n<p><span style=\"text-decoration: underline;\"><strong>YES!!!</strong></span> I Love me some CARBS!!!</p>\n<p>The way it works is this. When you eat carbs in addition to the proteins mentioned above, your body will divert the other amino acids to your Popeye muscles but for <strong>some chemical magical reason</strong>, it doesn't mess with the tryptophan. Leaving her to help your body make that awesome hormone we all need to help us with our general feelings of well being. <br><br>Whew. That was a lot. <strong>So what is the bottom line. </strong></p>\n<p>Tryptophan helps your body make serotonin, and eating proteins rich in tryptophan with a light carb on the side can help maximize your body's opportunity to absorb and manufacture what it needs to make you happier. <br><br>I personally <a href=\"https://amzn.to/2zGEVTQ\" title=\"Supplement \">added a supplement</a> to my diet as well. I am not sure yet if it has helped, but it hasn't hurt either!! <br><br> <em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-12-02T20:14:00-05:00",
      "updated_at": "2018-12-02T20:15:11-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "the-benefits-of-tryptophan",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28245819464",
      "image": {
        "created_at": "2018-12-02T20:13:21-05:00",
        "alt": "",
        "width": 1000,
        "height": 1000,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/be_happy.jpg?v=1543799601"
      }
    },
    {
      "id": 27977089096,
      "title": "Acid for your face? Go figure!",
      "created_at": "2018-08-05T00:13:51-04:00",
      "body_html": "<p style=\"float: left;\">I am 38 years old, and I will admit that the first time I got a facial, I was 38.....<br><br>I was informed by many wiser and more seasoned in skincare that 38 was far too old to not have received a skin pampering session with a professional, <strong>but that in lieu of it perhaps I should try an at home facial</strong>. This is scary territory because we have ALL seen those coming of age movies where the at home facial results in a 3-month long breakout session with redness and embarrassment. <strong>But I was guided towards Baby Facial by Drunk Elephant and I figured, what the heck!</strong> <br><br><img alt=\"Drunk Elephant Baby Facial \" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/BabyFacial_large.jpg?v=1534719569\" style=\"float: left; margin: 25px;\" width=\"221\" height=\"221\">This mask is an AHA/BHA cocktail that works to <strong>melt away the gross stuff on your skin and resurface it to give you better texture and smoothness</strong>. If you suffer from bumps on your skin, closed comedones, blackheads or just dullness in general, adding a good acid facial to your skin care regimen can be just the thing you need to de-age yourself. I grabbed mine at Sephora and stock up during their VIB events for extra savings. So here is my personal experience with this baby facial business.</p>\n<p>I expected with the pale pink bottle and the name, that this would be a mild facial, good for a skin care virgin. <strong>LET ME ASSURE YOU THIS IS NOT A BABY FACIAL!</strong> Nope, no NO! You can feel the tingle the moment this product touches your skin. It has a faint almond smell and comes out looking like foundation. <strong>A little goes a LONG way.</strong></p>\n<p>Ok, how do we do this?<br><br>First, I made sure my skin was clean (I use the double cleanse method explained in my skincare post) but I stop after the second face wash. To avoid over treating your skin and looking like a lobster,<strong> do not use any other acid products on your skin prior to this treatment. I'm serious!<br><br></strong>I applied a thin layer and instantly knew this stuff was  <strong>working</strong>. I was prickling and tingling all over my face. I let the mask sit and soak in for 20 minutes, and then I wiped it off using a warm wet face towel. The mask really clings to your skin, so I like to use the towel to make sure it all comes off. <strong>Then I doused my skin in the marula oil that comes with the facial to pamper and moisturize after that rigorous face bath</strong>.</p>\n<p>do NOT use a retinoid after an acid treatment. You will have a very angry face. <br><br>The results were awesome. I did not notice the outcome till the next morning when I woke up and <strong>my skin was smoother, more radiant and the tiny black pores</strong> i usually see on my nose and chin (under my 20 million X makeup mirror) looked, clean!</p>\n<p>It only took one use for me to be hooked, and I use this once a week and it is by far one of my absolute favorite treatments. It just works. </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-11-28T22:25:00-05:00",
      "updated_at": "2018-11-28T22:25:48-05:00",
      "summary_html": "<span style=\"color: #000000;\">Baby Facial you say? Nothing baby about it!</span>",
      "template_suffix": null,
      "handle": "t-l-c-sukari-babyfacial-by-drunk-elephant",
      "tags": "beauty, product reviews, selfcare, skincare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/27977089096",
      "image": {
        "created_at": "2018-08-05T00:13:51-04:00",
        "alt": "",
        "width": 1000,
        "height": 1000,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/BabyFacial.jpg?v=1533442431"
      }
    },
    {
      "id": 28232024136,
      "title": "When our parent dies",
      "created_at": "2018-11-23T22:29:37-05:00",
      "body_html": "<p>We know from a fairly young age that <strong>we will outlive our parents</strong>. It’s no secret, <span style=\"text-decoration: underline;\">just an unpleasant mathematical truth</span>. Yet it’s a surprise when it happens. I think anyone who has faced the imminent death  or sudden death of their parent will agree that even when expected, it’s a shock. <strong>Like, man I didn't see that coming. </strong><span class=\"Apple-converted-space\"><br></span></p>\n<p>Nothing really prepares us to face that moment, the single second that divides our life forever into before and after. It’s just one second, one moment, and suddenly <strong>nothing is the same.</strong></p>\n<p>I remember the day I found out my mom was sick, and she wasn’t going to get better. I remember thinking that the end would never actually come. The very prospect of her life being over was just too absurd to entertain. She’s mom. She’s invincible. The doctors are wrong. I knew in my logical brain what was happening. I knew she was dying, <strong>but my heart just figured the clock wouldn’t run out</strong>. That it would just tick on, in this pseudo purgatory. </p>\n<p>I went about my life, we all did. Cooking, cleaning, working, doing laundry. The mundane robotic routine of life. It felt strange to get up, get dressed and go to work. People would come in and out complaining about XYZ and in the back of my head all I could think was, <span style=\"text-decoration: underline;\"><strong>my mom is at home dying</strong></span>. <strong>This is really not a priority</strong>. I thought how on earth can people get so caught up in this, stuff?? But, I did what was expected because that's the way it is. </p>\n<p>She slipped into a coma at home and still I thought she would wake up. I knew she wouldn’t. <span style=\"text-decoration: underline;\">But I thought she might.</span> I sat with her, read her words from some book she was reading that I thought might comfort her. I sat and watched and she just looked, asleep.<strong> Just a sleep that lasted for days. </strong></p>\n<p>Then the day came, when she took a breath and didn’t take another. There is a shock that<strong> hits you like a tsunami.</strong><span style=\"text-decoration: underline;\"> A combination of numbness and rage and confusion</span>. Your mind knows what’s happened but your soul is paralyzed.</p>\n<p>I don't think we can really comprehend stillness of the body, we are so used to the rise and fall of breathing we see it even when it’s not there. And then you realize there is no more,<strong> just stillness</strong>. This all happens in a matter of seconds. It feels like eternity but it’s just seconds.</p>\n<p>My mind just started firing. I looked around, trying to avoid seeing her there. Her glasses and rosary were on her nightstand, a glass of water, a book and her Estee Lauder serum. <strong>Artifacts of her life.</strong> Things take on a new meaning when someone is gone, as if they are imbued with pieces of a persons soul. I remember not knowing what to do next. </p>\n<p>Turns out there is a business to death; paperwork and process. <strong>Maybe it helps to be distracted by bureaucracy.</strong> The professionals who helped us were so kind and thoughtful and very well trained. I remember thinking what an odd job choice it was, to work in the industry of death. One must have an iron constitution to see people at their highest emotional pain points and stay strong and be useful.<span style=\"text-decoration: underline;\"> It’s an incredible heroism to be sure. </span></p>\n<p>These shepards of death sent us downstairs to the basement to wait as they took mom away. I remember the sound of the zipper. I clung to my father like a small child. Me and my siblings. Our family of 5 had just lost one. And we sat, huddled together in tears and shock. <strong>As if we didn’t know it was coming</strong>. As no doubt generations of families across countries and continents and cultures have done when they lose a parent. Bound by love and by loss.</p>\n<p>Losing a parent is shocking. <strong>Even though we know statistically, it’s the most probable outcome.</strong> Your parents are a barrier, albeit an imagined one, between you and your own mortality. And then there is one less barrier, and you realize that it’s all transient. <span style=\"text-decoration: underline;\">The clock doesn’t tick unchecked. </span></p>\n<p>No one tells you the words that go unsaid and experiences that go unshared will weigh so heavily on your heart. <strong>There is no preparing for the erasing of a persons physical presence from our life</strong> when we have known them for most of it. </p>\n<p>My mom died 13 years ago. She was sick and I was still shocked. It’s been 13 years, and I continue to feel shocked. I find myself looking for her in memories, photographs and letters left behind. <span style=\"text-decoration: underline;\"><strong>I search for her</strong></span> smell in candles she burned and flowers she loved. I try to keep her spirit alive by doing things she loved doing. But she’s gone. And the pain of her loss is permanent.</p>\n<p>I wrote this because I think so many people who struggle with the loss of a parent <strong>feel there is some time limit on grief and pain.</strong> That there is some acceptable window of experiencing loss, and there comes with that expectation a burden to let go, and shame when we can’t. But for many, that’s just not how it goes. For many life indeed goes on, but that void remains. </p>\n<p>Grief doesn’t ever really go away; you just learn to coexist with it. There is no \"getting over it\", no \"life getting back to normal.\" <em>You find a new normal</em> in the after part of the math equation. </p>\n<p> </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-11-24T20:21:00-05:00",
      "updated_at": "2018-11-24T20:29:24-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "when-our-parent-dies",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28232024136",
      "image": {
        "created_at": "2018-11-24T20:17:00-05:00",
        "alt": "",
        "width": 1242,
        "height": 1310,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/mom_and_saira.jpg?v=1543108620"
      }
    },
    {
      "id": 28211314760,
      "title": "Magical Vitamin A",
      "created_at": "2018-11-12T23:08:38-05:00",
      "body_html": "<p>Vitamin A isn't just for your eyes and bones, no ma'am. <strong>Vitamin A is also epic when topically used on your skin.</strong> You may know it by the name Retinol, retain-A or Retinoid. Yes, that same name that got a horrible rep in the 80's, is actually a magic potion for your skin, <strong>held in high esteem by dermatologists around the globe.</strong></p>\n<p>Why is this so magical? Imagine your skin speaks french, and you keep talking to it in Spanish. <strong>Your skin is like, I have no idea what you are saying, can't help you</strong>. Bye Bye.  <br><br>But now imagine, you speak French. and you tell your skin in French,<em> act younger. </em></p>\n<p>Ah, \"j<span lang=\"fr\">e comprends\", your skin says! and does as it's told! That is pretty much what vitamin A can do. <strong>It communicates with your cells in a language the cells understand,</strong> and chemically get's the skin cells to behave like healthy, young skin cells. <br><br>I said it was magic, didn't I? <br><br>Vitamin A also encourages your skin to produce collagen, and helps combat free radicals that cause aging. Oh, it is also great at fighting dark spots and helping skin remain elastic. <strong>They promote cell turn over to reveal newer, fresher skin sooner,</strong> AND they can help unclog your pores helping them appear smaller. Wow, what a power house!</span></p>\n<p style=\"float: left;\">Now that we have established that this is magic, and you need to use it, what is a good product to use? <br><br>First let's talk about retinol vs. retinoid. In plain english your body has to convert retinol into retinoid to use it on a cellular level. <em>Where as a retinoid is already in the form your body can use straight away.</em> They both DO the same thing in the end, a retinol just has a few extra steps to go through. <br><br><img alt=\"PTR 3%\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/PTR_retinoid_large.jpg?v=1542084068\" style=\"margin-top: 10px; margin-right: 25px; margin-bottom: 10px; float: left;\" width=\"138\" height=\"138\">I personally use a 3% retinoid by Peter Thomas Roth because its very mild but VERY effective and feels like silk on your skin. You can grab this at Sephora, or Ulta. <br><br>Few things to keep in mind. While the PTR 3% retinoid suggested above is relatively mild,<span style=\"text-decoration: underline;\"> don't use it every day to start.</span> Retinoid's can cause your skin to purge if you rush into it, so start with 3 times a week in the evenings. <strong>IF you use a skin exfoliating acid, skip that step on the nights you use the retinoid. </strong><br><br>If you tolerate this well, you can add days in until you are at a regimen that you like. Once your skin has adjusted you can start to use the acid and retinoid together but <span style=\"text-decoration: underline;\"><strong>you want to make sure your skin has had time to adapt.</strong> </span></p>\n<p style=\"float: left;\"><strong>Do NOT use these products if you are pregnant or nursing ladies.</strong> Studies show this particular skin care step isn't fabulous for gestating babies or babies that nurse. <br><br>Last, <em><span style=\"text-decoration: underline;\">use a good sunscreen.</span></em> This should be a part of your routine no matter what, but especially so when using retinol or retinoid.  <br><br></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-11-12T23:37:00-05:00",
      "updated_at": "2018-11-13T16:19:26-05:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "magical-vitamin-a",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28211314760",
      "image": {
        "created_at": "2018-11-12T23:37:02-05:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/vitamin_A_IG.png?v=1542083822"
      }
    },
    {
      "id": 28193357896,
      "title": "Even strong people can be victims of invisible abuse",
      "created_at": "2018-11-04T14:52:28-05:00",
      "body_html": "<p style=\"float: right;\"><img alt=\"abuse\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/abuse_large.jpg?v=1541476754\" style=\"float: left; margin-right: 25px; margin-top: 10px;\" width=\"186\" height=\"186\">Once upon a time, <strong>I was in an abusive relationship</strong>. I didn't know I was at first. In fact, I thought I was happy, safe and well cared for. It took a long time before I started to notice things that were unusual. I found myself apologizing to people for their behavior, justifying and making excuses for their choices and always feeling anxious about being called out for not looking or acting a certain way. <br><br>My <strong style=\"color: #000000;\">self esteem sunk lower and lower,</strong> my entire identity became consumed by someone elses judgement. I was dressing in a uniform, from the inside out, and changing the way I spoke and behaved, all to avoid punishment and shaming. <br><br><img alt=\"fear\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/fear_large.jpg?v=1541476930\" style=\"float: right; margin-right: 25px;\" width=\"167\" height=\"111\">It was as if one night I went to sleep a strong, confident woman, and woke insecure, ashamed and scared of everything.<strong> I didn't even realize</strong> that slowly, everything I valued about myself had been suppressed, replaced by someone else thoughts and someone else ideals. <br><br><strong>That moment is hard</strong>, when you look at the face of someone you love, only to realize their version of love is <em>control</em>. It's a love that wants to remake you in <strong>their vision</strong>. <br><br>When people think of abuse they usually think of <strong>physical abuse</strong>. But make no mistake, emotional abuse can be<strong> just as damaging to a person</strong>, even though there are no physical scars. <br><br>I consider myself a smart person and emotionally mature, <strong>but smarts and maturity are irrelevant when it comes to being emotionally abused by someone</strong>. People who abuse are very <em>very</em> good at doing it.They don't walk around wearing a sign that says, \"I AM GOING TO ABUSE YOU\". They are manipulative, and <em>often exceedingly charming</em>.<br><br></p>\n<p style=\"float: left;\"><span style=\"text-decoration: underline;\"><a href=\"https://www.healthline.com/health/signs-of-mental-abuse#what-to-do\" title=\"Healthline abuse\"><img alt=\"question\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/question_large.jpg?v=1541477168\" style=\"margin-top: 10px; margin-right: 25px; float: left;\" width=\"241\" height=\"241\"></a>How do you know if you are being abused?</span> Well, for me it was feeling bad <strong>all the time, feeling like i was never </strong>good enough, and it was directly linked to me doing or saying things, and then <strong>worrying</strong> about how it would be judged and responded to. I doubted myself, and overanalyzed every conversation, every decision. Every word. <strong>And the more I tried to stand up for myself, the harder the hand pushed me down</strong> and reminded me to submit. It is worth mentioning that this kind of abuse isn't limited to romantic relationship; it can be between parents and children, employers, teachers or even friends. <br><br><a href=\"https://www.verywellmind.com/identify-and-cope-with-emotional-abuse-4156673\" title=\"how do you recognize emotional abuse\">Emotional abusers try to exercise and maintain control</a> by isolating people, attempting to discredit their experiences and by telling victims to be quiet. All these things lead to victims feeling alone, trapped and scared.</p>\n<p><a href=\"https://www.healthline.com/health/signs-of-mental-abuse#what-to-do\" title=\"Healthline abuse\">According to Healthline</a> and other sources, some of the common signs of emotional abuse are:<br><strong></strong></p>\n<p><strong>Unilateral decisions:</strong> They know better, and make choices that have direct material impact on your life without any input from you.<br><strong>Lectures:</strong> Someone spending a lot of time making it evident you are not equals. <br><strong>Denying something you know is true:</strong> This is called <a class=\"css-1tpdbgp content-link\" href=\"https://www.healthline.com/health/gaslighting\">gaslighting</a>. It is designed to make you question your recollection of events, and is very very effective in making a person doubt themselves and defer to someone else version of the truth, thus making them more submissive.<br><strong>Diminishing and trivializing:</strong> You bring something up that is of meaning to you, but the response is an accusation of you being overly emotional or hyper sensitive and unreasonable. <br><strong>Withholding attention: </strong>This is a big one, when you are in the \"good graces\" of your abuser, you will be showered with affection, but cross them and it is like a switch.<br><strong>Making demands:</strong> You often feel like your needs are second to theirs, or you are expected to drop what you are doing for them. <br>I would add to this, if you find yourself constantly feeling down on yourself, constantly defending their decisions, basing decisions and actions on gaining approval, and undercutting others to try and gain favor, and if you find yourself withdrawing from friendships prior to the relationship making you feel badly, these are ALL signs that you might indeed be the victim of abuse. </p>\n<ul></ul>\n<ul></ul>\n<p style=\"float: right;\"><img alt=\"manipulation\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/manipulate_large.jpg?v=1541477283\" style=\"float: right; margin-top: 10px; margin-left: 25px;\" width=\"141\" height=\"141\">Important to note, an abuser doesn't always have a mean face, or demeanor. Many <strong>can deliver the most toxic abuse while smiling and patting you on the back. <br><br></strong>Once you know you are being abused, <strong>what do you do next?</strong> How do you get out? </p>\n<p style=\"float: left;\">For me, it was surrounding myself with positive influences, people who didn't judge me, people who supported me not expecting anything in return. It was reminding myself of what I was before I let someone else try to tell me otherwise. It was leaving, and trusting that I could survive<strong>. It was remembering my personal power that no one has the right to take, only I have the right to give it up. </strong><br><br><strong><a href=\"https://www.psychologytoday.com/us/blog/communication-success/201409/10-signs-youre-in-relationship-narcissist\" title=\"Narcism \"><img alt=\"help\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/help_large.jpg?v=1541477435\" style=\"margin-top: 10px; margin-right: 25px; float: left;\" width=\"203\" height=\"135\"></a>Being abused is not your fault.</strong> It can be easy to feel like you asked for it, but <strong>no one asks to be abused.</strong> No one deserves it either. And in many cases, an abuser may not even KNOW they are hurting you. But trying to convince or educate an abuser of how they have hurt you generally doesn't work. <a href=\"https://www.psychologytoday.com/us/blog/communication-success/201409/10-signs-youre-in-relationship-narcissist\" title=\"Narcism \">Narcissists</a> don't need to be educated you see, <strong>they already know everything. </strong><br><br>I wrote this because most people I know who have suffered from something similar <strong>are so ashamed</strong>, they don't even know where to go, or where to begin to heal. I wanted people to know that even strong people who seem to have it together, can fall prey to this. You are not alone. And you are NOT trapped either. <br><br><span style=\"text-decoration: underline;\">Talk to someone about how you are feeling</span>, someone who <strong>cares for you truly</strong>, will <strong>never trivialize your feelings</strong> or tell you this is in your head. They will listen, and ask questions, and try to understand. <span style=\"text-decoration: underline;\"><strong>There is hope</strong></span>, even in the worst of circumstances, there is help and there is a life after being a victim of abuse. <br><br>Just remember, someone telling you a spade isn't a spade, doesn't make that spade a club. A spade is a spade no matter what name you give it. Don't let someone else determine your worth or your path. <br><br><strong>Be well. </strong></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-11-08T15:24:00-05:00",
      "updated_at": "2018-11-08T15:52:10-05:00",
      "summary_html": "Could your pain be coming from emotional abuse??",
      "template_suffix": null,
      "handle": "stopping-the-cycle-of-abuse",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28193357896",
      "image": {
        "created_at": "2018-11-04T18:35:59-05:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/abuse.jpg?v=1541374559"
      }
    },
    {
      "id": 28187918408,
      "title": "Planned Panic",
      "created_at": "2018-11-01T17:13:06-04:00",
      "body_html": "<p>Ah, anxiety. My old friend. Always know I can count on you to be there when I need you <strong>THE LEAST</strong>! <br><br>You know what I am talking about. You are already <strong>stressed to the MAX</strong>, you have worked more hours then you planned and YET still have more to do, your kids haven't had a home cooked meal in days and you have shoved burgers in your face all week because it's fast and cheap and let's not even DISCUSS the laundry. </p>\n<p>One day I woke up and realized I was ALWAYS waiting for a time <strong>when I would be caught up</strong>. Waiting for the day I would feel like an adult and have my shit together. and at 37 years old, that day still had not come. I was struck with the realization that THIS is life. And either I was going to take control of it, or I was always going to feel like a stress basket.<strong> Forever. <br></strong><br>At the time this was happening, I was selling clothing and I was making most of my income from creating outfits. More often then not, I would find myself creating a look only to find I had half an outfit and NO coordinating pieces to finish the look. And I would PANIC. How would I make my outfits, with just half the pieces? <strong>FREAK OUT!</strong><br><br>That is when I came up with this idea of <strong>Planned Panic</strong>. If I just made my outfits a WEEK before I needed to post them, I would still be in the same boat with missing pieces to find, but instead of having 2 minutes to find them, <strong>I would have 5-7 DAYS.  </strong>So essentially, by planning my panic, I could have <strong>time</strong> to deal with it and have a good outcome. <br><br>I started to wonder if I could apply this to the rest of my life, to find out, I made a list of things that caused my routine anxiety:<br><br>1. Eating - I never had anything to eat, and by the time I realized how hungry I was<strong> I was desperate and ate crap.</strong> <br>2. Sleeping - I ALWAYS ended up in bed late, and then <strong>didn't get enough rest!</strong> Then I am grouchy and unproductive the next day. <br>3. Money - <strong>I never seemed to have enough! </strong><br>4. Time with family - Because <strong>I was always working because I had no </strong><b>routine</b>, my family time was much less then I wanted. </p>\n<p>You get the picture. So, I decided that maybe if I was better at PLANNING for these things, I would not end up in situations where I had overwhelming anxiety and I became crippled and <strong>made bad choices and felt bad about myself</strong> AFTER having yet another anxiety attack. <br><br>Here is an example; Food. I KNOW that eating is hard for me, and then when I get hungry I have no food ready which l<strong>eads me to make poor choices</strong> for diet, which makes me anxious about my health and weight. <br><br>What if instead of waiting to cook, I chose meals that I could prepare in advance, and cook so all I needed to do was microwave them or re-heat them on the stove? Instead of making 3 pieces of fried chicken, <strong>I made 20</strong>. Instead of making 2 potatoes for mashed potatoes, <strong>I made 15</strong>. When I made Indian food, instead of cooking 2 breast, <strong>I would cook 7!</strong> By doing this I had<strong> food prepared for the entire week</strong>, and when I got hungry I <strong>didn't need to panic</strong>, and start the cycle again. I could just heat up my food. <br><br>If you struggle with anxiety, I would encourage you to <strong>make a list of the things</strong> that trigger your discomfort and see what you can plan ahead of time so you <strong>aren't caught in the moment unprepared</strong>, and then stuck in the pattern of anxiety. Planning ahead and taking steps will put CONTROL back in your hands. </p>\n<p>I have found the <strong>best antidote</strong> for <strong>situational</strong> anxiety is ACTION and CONTROL and <strong>planning your panic!</strong><br><br>Stay tuned for more tips on reducing your anxiety next week!</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-11-01T19:55:00-04:00",
      "updated_at": "2018-11-03T20:08:03-04:00",
      "summary_html": "Conquer anxiety by taking CONTROL back with this simple but very effective step.",
      "template_suffix": null,
      "handle": "planned-panic",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28187918408",
      "image": {
        "created_at": "2018-11-01T19:56:48-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/Stevie_nicks_hat_pic_120ba798-60bb-4df3-b358-aea65bebd4ed.jpg?v=1541116608"
      }
    },
    {
      "id": 28177268808,
      "title": "Your fear blanket",
      "created_at": "2018-10-25T17:40:30-04:00",
      "body_html": "<p>You are probably reading this and wondering, what the hell is a fear blanket? </p>\n<p>I've spoken very openly about my <strong>struggle</strong> with hypochondria, anxiety, and depression for which I took Zoloft, sought therapy, and hid from. These things are very difficult to face, and even more difficult to overcome. But It was just recently that I realized that <strong>my fear was more then a condition, it was a habit.</strong> <br><br>I have spent so many years of my life freaking out about death, disease, do people like me, do they hate me? Am I stupid, ugly, fat. Like smoking, <strong>these patterns become a habit</strong> and for better or worse, <strong>we cling to them because they are familiar to us</strong>. You all know that friend you have who drags you down, but you have been friends for so long, they are just part of your life. So, you stay friends, because that is what you have always done. <br><br>It dawned on me that my fear, was almost a <strong>security blanket</strong>. I wore it all the time because it was something familiar, something I was used to. Good, bad, it didn't matter because it was <strong>predictable</strong> and had been a part of my life for as long as I can remember remembering. <strong>I stayed in an abusive relationship for years</strong> for the same reasons; not because I didn't know it wasn't healthy for me, but because it was <strong>safer</strong> then the alternative, <strong>the alternative being the unknown, the alone. </strong></p>\n<p>I have a feeling this is true for a lot of people. That fears of the unfamiliar cause you to cling evermore to the life you have even if that life leaves you feeling unfulfilled and unhappy. Why? Why do we do this to ourselves? <br><br>Turns out, for me anyways it was as <strong>if this fear was a prophylactic</strong>. As long as I was afraid,<strong> I would be safe</strong>. As long as I clung to my hypochondria it was a predictable partner, and maybe by worrying about being sick all the time, I would prevent myself from actually becoming sick! <br><br>I think we all know it doesn't work that way LOL! But a person who is crippled by anxiety doesn't often think rationally. We have our own logic. I did finally realize that this security blanket of fear I wrapped myself in <strong>was not actually doing anything good for me</strong>. It wasn't saving me from anything, it wasn't keeping me safe, or making me happy. So I had to make a decision. I was either going to give up and live in this blanket forever because it what I've always done, or, I was going to throw it away and <strong>learn to live life without falling back on my fear as a coping mechanism</strong>. <br><br>Your mind, is so incredibly powerful. It has the power to <strong>convince</strong> you that you can be a <strong>world class athlete</strong> who can break world records, or the <strong>power</strong> to <strong>convince</strong> you that you are <strong>weak and meaningless</strong>. <br><br>The truth is, <span style=\"text-decoration: underline;\"><strong>you are whatever you choose</strong></span>. I say this as someone who once was on the other side, looking at others who were free from fear and who lived adventurously with nothing but love for life even in the face of disease or disability. And I sat on the other side, healthy, employed and able bodied but <strong>totally paralyzed by my brain</strong> that was programmed to make me feel like those things were for other people. I would never be good enough. I would never be unafraid. <br><br>Until the day I <strong>decided NOT to be afraid anymore</strong>. The day I decided to just, try. Try to NOT go down the rabbit hole. Try NOT to believe the worst was coming. Try to believe that even if it DID, <strong>I would be OK. </strong><br><br>If you feel trapped, alone, afraid, or suffer from chronic anxiety like I did. I just want you to know,<strong> it doesn't have to be that way</strong>. I am evidence, that even the most messed up brain can be retrained. I have days where the old habits come out, but they are less and less. <strong>You can be free</strong>. Next week I will provide some more details on things I did to help shed my old ways, and embrace healthier ones. <br><br>Just to get you a jump start, we are currently reading Girl Wash Your Face in our little blood club. If you want to learn more, <a href=\"http://community.sairavalley.com\" target=\"_blank\" title=\"Saira FB\" rel=\"noopener noreferrer\">just head on over to our community</a> and locate the book club discussion group in the album section!<br><br></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-10-25T20:08:00-04:00",
      "updated_at": "2018-10-25T20:09:42-04:00",
      "summary_html": "Fear is one of those things, we feel like we want to be free of it, but do we really?",
      "template_suffix": null,
      "handle": "your-fear-blanket",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28177268808",
      "image": {
        "created_at": "2018-10-25T18:18:41-04:00",
        "alt": "",
        "width": 1112,
        "height": 1105,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/anxiety.jpg?v=1540505921"
      }
    },
    {
      "id": 27975385160,
      "title": "Drybar Curling Iron",
      "created_at": "2018-08-03T23:58:44-04:00",
      "body_html": "<p><span style=\"color: #000000;\">If you have read my Drybar Hair dryer review you know how much I love colorful hair tools, especially yellow ones. <strong>Somehow makes the arduous process of hair styling, pleasant</strong>. I snagged the Drybar iron at Ulta with one of those fabulous coupons to save 20% which made the $135 price tag a little easier to swallow, since I only had to cough up $108.</span></p>\n<p style=\"float: left;\"><span style=\"color: #000000;\"><a href=\"https://amzn.to/2S1Chj0\" title=\"dDryBar curling iron\"><img alt=\"Dryer Curling Iron\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/drybar_iron_large.jpg?v=1534718739\" style=\"float: left; margin: 25px;\" width=\"132\" height=\"203\"></a>After getting my hair nice and dry with the <a href=\"https://amzn.to/2S1Chj0\" title=\"DryBar Curling Iron\">Dryer Buttercup dryer,</a> I made 5 sections with clips and got busy with this curling iron. I<strong>t has digital controls and heats up super-fast</strong>. So it didn’t take long to get the iron in my hair. </span><br><br><span style=\"color: #000000;\">The iron isn’t your traditional iron where you turn the iron and your hair to get the hair wrapped and curled around the barrel. This has a twister ON the barrel! So you put the hair in the iron and roll the iron and it will roll the hair. So easy! </span><br><br><span style=\"color: #000000;\">But, I wasn’t happy <strong>because my hair kept sliding out of the clip.</strong> UGH!!! I tried about a gazillion times and I either ended up with a crimped end or my hair was slipping out. So annoying. So I set down the curling iron and had to think of a new strategy. <strong>WAIT,</strong> I had an idea. I decided to grab my heat protectant glove and use the iron as a wand instead. </span><br><br><span style=\"color: #000000;\"><strong>Brilliant. </strong></span></p>\n<p style=\"float: left;\"><span style=\"color: #000000;\">I placed the iron at my roots and rolled my hair around the barrel. <strong>Way faster than trying to get the clip to cooperate</strong>. I held the iron in place for 10 seconds, and released. Oh snap. Talk about defined curl! <strong>I was pleased</strong>. I kept going and managed to curl all my hair in about 12 minutes. Speed was great, curls looked full and bouncy but the real test was longevity! <img alt=\"Saira curling hair dryer iron\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/drybar_curling_iron_selfie_large.jpg?v=1535922525\" style=\"margin-top: 25px; margin-left: 25px; margin-bottom: 25px; float: right;\" width=\"189\" height=\"164\"></span><br><br><span style=\"color: #000000;\">How long would these curls of glory last? </span><br><br><span style=\"color: #000000;\">Most of the time I leave home with curls out of a romance novel and I imagine they stay that way all day long. NOPE. <strong>When I get home my illusions are shattered and I actually look like Peggy from Married with Children after an all-night bender.</strong> Not a pretty sight. So I proceeded with caution and low expectations. </span><br><br><span style=\"color: #000000;\"><img alt=\"saira dryer curled hair\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/curly_hair_selfie_large.jpg?v=1535922566\" style=\"margin-right: 25px; margin-bottom: 25px; float: left;\" width=\"137\" height=\"182\">I was stunned when I got home after a busy day to find my curls in-tact. Huh. Go figure. So I went to bed, figuring the night of tossing around would for sure destroy the curls. NOPE! Woke up to STILL curly hair. <strong>What the heck is in this iron? Magic dust?<br><br></strong></span>So, all in all I am very pleased with the Drybar curling iron. These guys clearly know how to make a hair tool. <br><br><span style=\"color: #000000;\">But my advice, use it as a wand and invest in a good heat styling glove to keep your pretty little phalanges from getting fried. This one from <a href=\"https://amzn.to/2pZyoyB\" title=\"Heat glove\">Amazon works well! </a><br><br></span></p>",
      "blog_id": 23442161736,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-10-18T13:36:00-04:00",
      "updated_at": "2019-03-19T14:49:16-04:00",
      "summary_html": "<span style=\"color: #000000;\">Curls for days? let's find out!</span>",
      "template_suffix": null,
      "handle": "dry-bar-curling-iron",
      "tags": "beauty, Hair, product reviews, selfcare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/27975385160",
      "image": {
        "created_at": "2018-10-23T19:30:53-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/drybar_iron.png?v=1540337453"
      }
    },
    {
      "id": 28011954248,
      "title": "Skincare Diaries - Chemical Exfoliation",
      "created_at": "2018-08-19T19:50:39-04:00",
      "body_html": "<p style=\"float: left;\"><img alt=\"Chemistry \" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/chemistry_2_large.jpg?v=1539285206\" style=\"margin-top: 25px; margin-right: 25px; margin-bottom: 25px; float: left;\" width=\"228\" height=\"229\">Last week we talked about physical exfoliation! Today we are going to tackle the chemical approach. Don't be scared, it isn't as intimidating as it sounds.  <br><br>Chemical exfoliators remove cells differently depending on what they are. There are actually several types of asides but the most commonly used and easy to find are AHA and BHA. Alpha Hydroxy Acid (AHA)<strong style=\"color: #000000;\"> is great for dry to normal skin,</strong> it's water soluble so is mostly going to get rid of that surface build up. <span style=\"color: #000000;\"><strong> </strong>Beta Hydroxy Acid (BHA) is<strong> oil soluble which means it can cut through a lot and get into the pore and melt gross out, </strong>this is usually good for oily skin that clogs, gets bumpy or has breakouts. <br><br>There are many products that are just an AHA or a BHA but equally as many are combinations of both since they both do different things, they are a good complement to each other.</span></p>\n<p><span style=\"color: #000000;\">I have combination skin, which means I have some super oily spots, and some super dry ones. <strong>I prefer a gentle AHA BHA combined chemical exfoliation on my skin for the day to day</strong>. I do this at night personally, but there are many who use acids first thing in the AM, and some who use them twice a day! </span><br><br><span style=\"color: #000000;\">For my personal skincare I found using a chemical exfoliator twice a day was simply too much and my skin got angry and irritated. I had to play with the products to find a routine that my skin was happy with, <strong>which ended up being chemical exfoliation once a day, in the evenings.</strong></span></p>\n<p><span style=\"color: #000000;\">This step will come <strong>after you complete your double cleanse</strong>, regardless of how often you do it, or when you do it. It’s the second step on your skin care agenda. If I had to suggest any step of skincare that was worth investing in a really killer product and never skipping, it would be this step.</span></p>\n<p style=\"float: right;\"><span style=\"color: #000000;\"><strong>Keeping your skin constantly turning over, and sloughing off dead skin is the <img alt=\"Feet\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Dry_Feet_large.jpg?v=1538430819\" style=\"margin-top: 25px; margin-left: 25px; margin-bottom: 25px; float: right;\" width=\"194\" height=\"129\">best way to ensure that any products you use after this for treatment or nourishment are actually going to penetrate and have the opportunity to work.</strong> Imagine your feet, if you went for a pedicure and all they did was slather some serums and lotion onto your dry cracked feet, how good do you think the product would penetrate and how good would your feet look? </span><br><br><span style=\"color: #000000;\">No, they have to exfoliate and remove the dead cracked nasty stuff (which is way more obvious on feet, especially mine) before they can apply stuff to actually soften and nourish your poor skin. Same is true for your face, it may not be as glaringly obvious as the foot, but it’s the same.<br><br><img alt=\"AHA\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Pixi_glow_tonic_large.jpg?v=1539289870\" style=\"float: right; margin-left: 25px; margin-bottom: 25px;\" width=\"136\" height=\"136\"><a href=\"https://amzn.to/2IOxUUs\" title=\"Pixi\">Pixi makes a glycolic acid tonic </a>(AHA family) that is super gentle and works on most skin types. Its affordable and has a nice subtle scent! I suggest starting with once every other day and as long as your skin responds well, you can increase your usage to once a day. Some people with super sturdy skin can use this 2X a day but it is always best to slowly increase your use. <br></span></p>\n<p style=\"float: left;\"><span style=\"color: #000000;\">Last note, these things only work if you do them on some kind of consistent schedule. <strong>Exfoliating once randomly and then a second time randomly, is about as effective as working out once in a while.</strong> </span><br><br><span style=\"color: #000000;\"><img alt=\"turkey\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/turkey_large.jpg?v=1539285601\" style=\"float: left; margin-right: 25px; margin-bottom: 25px;\" width=\"135\" height=\"130\">It’s useless.<br><br></span><strong>Consistency, over time. That is the ticket</strong>. Nothing works if you do it sporadically. It has to become a habit that you are married to.<br><br>And do not forget your neck. Beautiful head, on a turkey neck. No.</p>\n<p><span style=\"color: #000000;\"> <em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em></span></p>",
      "blog_id": 23442161736,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-10-11T15:37:00-04:00",
      "updated_at": "2019-03-19T14:47:14-04:00",
      "summary_html": "Understanding skincare and chemical exfoliation",
      "template_suffix": null,
      "handle": "skincare-chemical-exfoliation",
      "tags": "beauty, selfcare, skincare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28011954248",
      "image": {
        "created_at": "2018-10-23T19:20:29-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/chemical_exfoliation_1.png?v=1540336829"
      }
    },
    {
      "id": 28011987016,
      "title": "Skin Care - Physical Exfoliation",
      "created_at": "2018-08-19T19:52:14-04:00",
      "body_html": "<p style=\"float: right;\"><span><img alt=\"Apricot scrub\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/apricot_scrub_large.jpg?v=1538429432\" style=\"float: left; margin-right: 25px; margin-bottom: 25px;\" width=\"180\" height=\"120\">There are two types of exfoliation when it comes to our skin. </span><strong>Chemical and physical</strong><span>. Most think of St. Ives apricot scrub when thinking of a physical exfoliate. We all used it, but if you have any, </span><span>I am telling you do not ever let that near your face</span><span>. </span><span>EVER. Maybe on your feet, or your bottom, <strong>but that’s it.<br><br></strong></span><span>When we think of a chemical exfoliant we usually <img alt=\"Chemicals\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Chemical_image_large.jpg?v=1538430587\" style=\"float: right; margin: 25px 10px 25px 10px;\" width=\"136\" height=\"131\"><br>think of facials and AHA (Alpha Hydroxy Acid) or BHA (Beta Hydroxy Acid). Maybe even glycolic acid if you are super fancy, but most think that chemical exfoliation is scary and only someone with a certificate can put it on your face. <strong>Not so</strong>. </span><span>A good chemical exfoliant, and physical exfoliant are important in your at home skin care routine.<br><br></span><span>Let’s start with what they are. </span><strong>Exfoliation is the removal of dead surface cells that can make skin look dull, lifeless and sallow</strong><span>. A physical exfoliator is going to use </span><strong>abrasion </strong><span>to remove skin and a chemical one uses, you got it, </span><strong>chemicals </strong><span><strong>to remove dead cells</strong>.</span></p>\r\n<p><span style=\"color: #000000;\">Let's begin with something we all are familiar and cozy with, <strong>physical exfoliation.</strong></span></p>\r\n<p><span style=\"color: #000000;\">As I said earlier this kind of exfoliator is as its name describes, about something physical engaging with your skin. That could be <strong>an abrasive product like a scrub or it could be something mechanical like a face scraper</strong>. When choosing a physical exfoliator, be very careful. If you <strong>use something that has big chunks that are sharp or jagged you can get these tiny tears</strong> in your skin that while not visible to the eye, are there and can affect the smoothness and the health of your skin. </span><br><br><span style=\"color: #000000;\">There is actually a lot of debate about whether scrubs are even good for you and I would agree that most physical scrubs aren’t good for your skin. But, in my personal experience, <strong>using a GOOD GENTLE scrub once or twice a week can produce excellent results. </strong></span></p>\r\n<p><span style=\"color: #000000;\">While I use a chemical exfoliator on my skin daily, I only use a physical scrub about every 3-4 days.<strong> I do this when my skin just feels dull and weighed down and I want some kind of instant clean feeling on my face</strong>, or before a treatment or nourishment mask. </span><br><br><span style=\"color: #000000;\">A physical exfoliator in the form of a scrub is going to work to literally scrub skin OFF your FACE. A <strong>good scrub will not hurt when used</strong>, and in fact that particles should be so small <strong>as to almost not feel them at all</strong>. </span><br><br><span style=\"color: #000000;\">Use very gentle circular motions to massage the scrub into your face and wipe clean with a moistened hand towel. <strong>Do NOT over scrub your face</strong>! This is not like trying to remove<strong> 3-day old ketchup from your kitchen counter</strong> where you feel the burn in your elbow. Think of it more like how you would treat a new born babies face if you were to exfoliate it (which hello don’t ever do that) but you get the idea. be gentle.</span></p>\r\n<p style=\"float: left;\"><span style=\"color: #000000;\"><a href=\"https://amzn.to/2IxzsSs\" title=\"Face scraper\"><img alt=\"Face scraper\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Kinga_scraper_large.jpg?v=1538431931\" style=\"float: left; margin: 10px;\" width=\"128\" height=\"128\"></a>But scrubs aren’t the only kind of physical at home exfoliation you can use. My personal favorite physical exfoliator is actually mechanical. <strong>I got myself one of those face scrapper things that my spa lady used on me during a facial</strong>. It legit looks like an electric spatula.<a href=\"https://amzn.to/2IxzsSs\" title=\"Face scraper\"> I LOVE this scraper from Amazon </a>that honestly has given me baby smooth skin which I have NEVER had. </span></p>\r\n<p><span style=\"color: #000000;\">This is a vibrating tool that when placed on wet skin and moved along the surface will <strong>help to loosen dirt and black heads, and yes, scrape them off</strong>. I use this tool once every other day and <strong>the transformation in my skin has been outrageous</strong>. I usually suffer from tiny bumps (closed comedones) they are flesh colored and not visible except as texture and I HATE IT. </span><br><br><span style=\"color: #000000;\">But using this exfoliator on my skin every 2 days has eliminated that all together and I now have smooth skin everyday.  Like I am not kidding. Seriously I can run my hand over my skin and what once felt like <strong>pop rocks jungle is now smoother than silk</strong>. I have never experienced that kind of skin, not since puberty anyways!</span></p>\r\n<p><span style=\"color: #000000;\">Exfoliation really is a critical step in your skin care routine. It will provide you with fresh skin that is ready to receive treatment, nourishment, hydration and protection. </span><br><br><span style=\"color: #000000;\">That clean base is going to really ensure that all the other work you do is going to really have a lasting impact. Have I made my point yet? <strong>You cannot sacrifice this step. </strong>Both types of exfoliation have their place in a robust, healthy and helpful skin care regimen and making them a habit will give you visual results you can count on over and over again.<br><br>Check in next week for info on chemical </span>exfoliation! </p>\r\n<p><span style=\"color: #000000;\"><em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em></span></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-10-01T18:35:00-04:00",
      "updated_at": "2018-10-23T19:43:53-04:00",
      "summary_html": "<span style=\"color: #000000;\">Physical exfoliation with scrubs and tools??</span>",
      "template_suffix": null,
      "handle": "skin-care-physical-exfoliation",
      "tags": "beauty, selfcare, skincare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28011987016",
      "image": {
        "created_at": "2018-10-23T19:43:53-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/chem_exfol.png?v=1540338233"
      }
    },
    {
      "id": 28118089800,
      "title": "Walk yourself Well",
      "created_at": "2018-09-26T11:13:09-04:00",
      "body_html": "<p style=\"float: left;\"><span style=\"text-decoration: underline;\"><img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/wedding_large.jpg?v=1537980466\" style=\"float: left; margin-right: 25px; margin-left: 25px; margin-bottom: 25px;\" width=\"137\" height=\"183\"></span>If you are like me, at some point in your life you looked in the mirror and saw the <strong>weight of the years</strong> all at once. Maybe you didn't notice it was piling on, or maybe you did and just<strong> didn't want to deal with it.</strong> <img alt=\"saira overweight\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/saira_fat_large.jpg?v=1537980086\" style=\"float: right; margin: 23px 25px 23px 23px;\" width=\"124\" height=\"233\"><br><br>I had my first child at age 27, and when I got pregnant I weighed 120 pounds and at 5'7\" tall, that was a size 0. Fast forward 3 kids later, and I tipped the scaled at <strong>191 pounds</strong>, and my youngest was 4. <br><br>The weight probably wouldn't have bothered me as much as it did <strong>if I felt good,</strong> but I didn't. I was <strong>tired, lethargic, depressed.</strong> My blood pressure and blood sugar and cholesterol were all too high. I hated how I looked, I hated how I felt, forget intimacy with my husband, forget bathing suits and walks through the orchards with my kids. I was overweight, unhappy, and <strong>clueless about how to even begin</strong> to tackle the 50 pounds I needed to lose to be healthy. </p>\n<p style=\"float: left;\"><img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/walk_large.jpg?v=1537980514\" style=\"float: left; margin: 10px 25px 25px 10px;\" width=\"193\" height=\"130\">But one day, I knew I had to just start. The 1,000 mile journey starts with just one step. I am going to share some of the things I did to bring my weight from 190 pounds, to 150 pounds in 6 months. It CAN be done. And if you don't have a tribe to help you, I will be your tribe. You can message me or join my group and we can tackle it together.</p>\n<p><strong>Soda-</strong><br>Drink Soda? Diet or other-wise, <strong>ditch it</strong>.<span> </span>Substitute with plain soda water or 0 calorie (NOT DIET) flavored soda water to get the same bubbly effects without the calories. I lost 10 pounds in 2 weeks just by cutting out sugary drinks like soda.<strong> This was the very FIRST thing I did. </strong></p>\n<p><strong>Walk for wellness-</strong><br>Walk for 10 minutes 6 days a week, <strong>outside.</strong><span> </span>Add 1 minute to your walk every day, each way. Walking outside provides fresh air which is great for the mind and body. It also means later as you build your endurance you <strong>can’t just quit when you get tired</strong>, which we can easily do on a treadmill. I lost 10 additional pounds after I added walking to my routine. <strong>I can now walk 3 miles a day. </strong><br><br><strong>Track it-</strong><br>Get yourself an activity tracker, it helps keep you <strong>honest AND proud</strong> as you watch your activity level go up each day when you add 1 minute to your walk.</p>\n<p style=\"float: right;\"><strong>EAT BREAKFAST-<img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/breakfast_large.jpg?v=1537980776\" style=\"float: right; margin-top: 10px 10px 10px 25px; margin-right: 10px 10px 10px 25px; margin-bottom: 10px 10px 10px 25px;\" width=\"164\" height=\"109\"><br></strong>This is very hard, but very important. Make time to eat something REAL. Not a protein bar, not something that comes in a wrapper. Something that is <strong>real food</strong>. It sets your metabolism up for success during the day and will give you energy.</p>\n<p><strong>Do not starve yourself-</strong> <br>Your body needs fuel to burn, so you have energy. Eating small snacks all day that are high in protein and good fats can help keep you full, energized and keep your body <strong>burning calories</strong>. Think of your body like a wood stove, if you let the stove run out of wood the <strong>fire goes out</strong> and has to be restarted when a new pile is added. By adding wood slowly all day, the fire keeps burning. Same for your metabolism.</p>\n<p><strong>Personal Trainer-</strong><br>Once you have built your endurance up, if you have serious weight to lose and can afford a trainer, get one. Even if you only see them once every 3 weeks to change up your gym routine so you <strong>don’t plateau</strong>. By adding a trainer to my workout routine I didn't lose as much weight, but I did <strong>lose inches</strong>. <br><br><strong>Classes-</strong><br>If a trainer isn’t for you, <strong>try a group class</strong> like Pure Barre or Zumba. These aren’t great for rapid weight loss, but they are good for your heart, and for toning your body and elongating your muscles. They help build endurance, muscle tone and strength. I found that while I didn’t lose weight in Pure Barre, I gained stamina and my <strong>body shrunk</strong> and had better shape in the buns, waist, hips and arms.</p>\n<p style=\"float: left;\"><strong>Water-<br></strong>Hydration matters, it helps prevent overeating, cleans out waste, and helps your <img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/soda_water_large.jpg?v=1537980709\" style=\"float: left; margin-right: 25px; margin-top: 25px;\" width=\"131\" height=\"87\"><br>body NOT retain water, so less water weight.<span> </span>You should be drinking .5-1oz of water for every pound you weigh. I weigh 150 lbs, which means on average to maintain good hydration for my body I need 75-150 OZ of water. That’s between 8-16 8 OZ cups a day depending on my physical activity. <strong>So drink up!</strong></p>\n<p><strong>Sleep-</strong><br>You simply cannot expect to lose weight if you don't rest. Sleep deprivation affects two hormones <span>ghrelin and leptin that play a role in regulating your appetite and being tired will limit your energy for </span>exercise and physical activity. Furthermore, <strong>chronic sleep deprivation</strong> has been shown to increase cortisol levels in the body (stress hormones) which can also <strong>contribute to overeating and weight gain/retention</strong>. So try to get to bed before 11PM. </p>\n<p style=\"float: right;\">I didn't tackle all of these things at once, I <strong>slowly added</strong> things as my confidence grew. I literally began by stopping soda, then I added walking etc etc. Baby <img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Dahlia_copy_large.jpg?v=1537985242\" style=\"float: right;\" width=\"121\" height=\"277\">steps. And before I knew it, I was walking <strong>3 miles a day</strong>, seeing a trainer 3X a week and going to our barre 3X a week. But had I began there, I would not have been able to stick with it. <br><br>Once they become habits, you won't be stopped. I was out <strong>walking in -15 degree weather</strong> (I actually will NOT do that again)  because I was THAT committed to my goals. I have been on this journey now for almost a year, and<strong> I have kept the weight off.</strong> <br><br>Make yourself a priority. You can do it! All you have to do is pick something, just one thing, <strong>and start. </strong></p>",
      "blog_id": 23442161736,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-09-26T14:37:00-04:00",
      "updated_at": "2019-03-19T14:49:33-04:00",
      "summary_html": "",
      "template_suffix": null,
      "handle": "walk-to-wellness",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28118089800",
      "image": {
        "created_at": "2018-10-23T19:35:11-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/walk.png?v=1540337711"
      }
    },
    {
      "id": 28014248008,
      "title": "Revlon One Step Volumizer - Get it Straight!",
      "created_at": "2018-08-20T20:27:54-04:00",
      "body_html": "<p style=\"float: left;\">I WISH I was like my best friend Ashley, who can take her horse mane hair and whip a giant round brush through it effortlessly and blow dry her hair to salon perfection in a matter of minutes. But that is not me. <strong>I am the clumsy friend, the one who manages to get her hair tangled around the brush, rips out a bunch in the process, burns her scalp and frys her ends.</strong> I am NOT skilled at round brush blow drying. I try. But it is embarrassing. <br><br><a href=\"https://amzn.to/2C8D3qT\" title=\"Revlon Dryer Link\"><img alt=\"Revlon Dryer\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Revlon_one_step_Volumizer_large.jpg?v=1535923266\" style=\"margin-right: 25px; margin-bottom: 25px; float: left;\" width=\"146\" height=\"194\"></a>SO, you can just imagine my excitement when a friend of mine <strong><a href=\"https://amzn.to/2C8D3qT\" title=\"Revlon dryer\">suggested the Revlon one step volumizer</a>.</strong> I could not WAIT to get my hands on this magic tool. I had <strong>BIG DREAMS, of voluminous hair, shiny like a diamond, and smooth as silk</strong>. Party on Wayne. <br><br>After the obligatory thorough wash and condition, <strong>I applied some heat protecting spray</strong> and did a quick towel dry, and then did a once over blow dry to get to 80% dry with my Drybar buttercup. <a href=\"https://amzn.to/2C8D3qT\" title=\"Revlon Dryer Link\"><img alt=\"Saira and Revlon dryer\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Revlon_One_Step_Saira_Drying_large.jpg?v=1534811072\" style=\"margin-top: 25px; margin-left: 25px; float: right;\" width=\"196\" height=\"261\"></a><br><br>Then, I excitedly got the <a href=\"https://amzn.to/2C8D3qT\" title=\"Revlon dryer link\">revlon dryer</a> going and started brushing while it dried. I have to say,<strong> I was actually pretty impressed at the first results</strong>. My hair was drying, it was not getting caught in the brush and it was looking silky! I was happy to continue. <br><br>But as I went on, my excitement diminished. My hair looked just so so, i didn't think it looked any better than if i had just dried it in the air. <strong>But, I am not one to give up easily</strong>, so I decided I would try again in a few days. </p>\r\n<p style=\"float: left;\">Fast forward, two days later it was hair wash time again. This time I let my hair air dry a bit and then once it was about 80% dry, I started to blow dry with the Revlon one step volumizer again. <strong>THIS TIME, this time I was happy, beginning to end. </strong><br><br><img alt=\"Saira Revlon Results\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/revlon_dryer_results_large.jpg?v=1535923221\" style=\"margin-right: 25px; float: left;\" width=\"186\" height=\"247\">I think I just needed to <strong>practice</strong> using the brush and getting comfortable with rolling my hair around it and brushing as it dried. <br><br>When I finished, my hair was <strong>smooth, frizz free, shiny and soft!</strong> As someone who really really REALLY sucks at blow drying with two hands, this is a life saver. <br><br>I am 100% happy with this product and plan to continue using it. <strong>It makes having straight but not flat hair achievable for those of us that lack dexterity and coordination.  </strong><br><br><br><br> <em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-09-19T15:03:00-04:00",
      "updated_at": "2018-10-23T19:45:31-04:00",
      "summary_html": "A brush AND a blow dryer in ONE? This I gotta try!",
      "template_suffix": null,
      "handle": "revlon-one-step-volumizer",
      "tags": "beauty, Hair, product reviews, selfcare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28014248008",
      "image": {
        "created_at": "2018-10-23T19:45:31-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/revlon_one_step.png?v=1540338331"
      }
    },
    {
      "id": 28083748936,
      "title": "Skin Care Diaries - Hydration",
      "created_at": "2018-09-09T12:17:42-04:00",
      "body_html": "<img alt=\"hands and cream\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Moisturize_large.jpg?v=1536512454\" style=\"float: left; margin-right: 25px; margin-bottom: 25px; margin-top: 25px;\" width=\"125\" height=\"125\"><br><strong>Skin needs moisture</strong>, it doesn't matter if you have oily skin or dry skin. <strong>All skin needs hydration</strong>. And if you have oily skin, there are some fabulous perks! Not the least of which is that oily skin tends to be thicker and more resistant to premature aging. So while you may look like a slip and slide, you will be a YOUNG slip and slide.\r\n<p style=\"float: left;\">After you complete your various skin care steps which can include masking and peels and exfoliations and serums, you need to hydrate. For day time hydration, <strong>you do not want heavy creams unless you have very dry skin.</strong> If you wear makeup during the day, having a heavy cream can also create too much oiliness and give you an over abundance of \"glow\". <br><br><a href=\"https://amzn.to/2wXCKcC\" title=\"hadalabo\"><img alt=\"Hadalabo\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Hadalabo_large.jpg?v=1536512567\" style=\"float: right; margin-right: 25px; margin-left: 25px; margin-bottom: 25px;\" width=\"60\" height=\"231\"></a>I really like to use a light pre moisturizer that is packed with <strong><a href=\"https://www.elle.com/uk/beauty/skin/a35378/what-is-hyaluronic-acid-and-how-does-it-work/\" title=\"Elle link\">hyaluronic acid</a></strong> which provides <strong>two amazing benefits</strong>. First, it has the exceptional ability to r<strong>etain moisture</strong> but even better, <strong>regulate moisture</strong>. This means you skin will have a great dose of hydration that can self regulate during the day to maintain balance. Fantastic! <br><br>The second step is an actual moisturizer. While a good hyaluronic acid will do it's job, <strong>it is not enough to keep even oily skin properly hydrated for the day</strong>. When looking at a good moisturizer <strong>avoid anything that has mineral oils, alcohol or fragrance.</strong> <br><br>Actually, that is a <strong>good rule</strong> for all products that you put on your body. <br><br><a href=\"https://amzn.to/2wXCKcC\" title=\"hadalabo\"><img alt=\"oil\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/oil_7d328eca-8202-459e-9939-2d5ea107497c_large.jpg?v=1536512903\" style=\"float: left; margin-right: 25px; margin-top: 10px;\" width=\"155\" height=\"103\"></a>Excuse my brief tangent. There are tons of <a href=\"https://www.allure.com/story/mineral-oil-skin-care\" title=\"Elle mineral oil article \">articles</a> on Mineral oils detailing why they are not ideal for skincare. Mineral oils are<strong> petroleum based</strong> and do not absorb well into skin, meaning they will <strong>sit on the surface</strong> and can actually <strong>hinder effective deep hydration</strong>, and can <strong>clog pores</strong> leaving you prone to breakouts. Alcohol is super drying and doesn't have any business being near your skin, and perfume is an irritant. <br><br>Also, <strong>be weary</strong> of any product that claims to be <strong>All Natural</strong>. The term \"Natural\" is not clearly defined in the cosmetics space, so your best bet is to turn that bottle around and read. Skin is the largest organ on your body, everything you put on it is absorbed into your body. The good, the bad and the ugly. <br><br><a href=\"https://amzn.to/2wXCKcC\" title=\"hadalabo\"><img alt=\"OMG \" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/dont_panic_large.jpg?v=1536513533\" style=\"float: right; margin-left: 25px; margin-right: 25px;\" width=\"164\" height=\"124\"></a>Now look, you may find that your favorite moisturizer has one or all of these ingredients, and <strong>if it works for you, by all means keep using it.</strong> There is no reason to freak out and toss your entire regimen.  Some people just have super resilient skin that isn't affected as much. <strong>But,</strong> if you are finding you are not loving your skin, it feels too oily or too dry, you should <strong>examine the ingredients</strong> and eliminate as many of the unnecessary ones as possible. I still use great products that have some mineral oils in them, I just try to limit their use.<br><br><strong><a href=\"https://amzn.to/2CjlMJZ\" title=\"Water mask\"><img alt=\"sleeping mask\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Water_Sleeping_mask_large.jpg?v=1536513597\" style=\"margin-right: 10px; margin-bottom: 10px; float: left;\" width=\"124\" height=\"145\"></a>For evenings,</strong> I suggest alternating at least 2 different moisturizers throughout the week. One should be a sleep mask cream; these contain treatment ingredients like mild acids and hyaluronic acid to work on your skin gently while you sleep. The other is a deep moisturizer in a cream or oil form to provide your skin with antioxidants, nourishment, intense hydration and healing. <br><br><br> <em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em><br><br><br></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-09-12T15:36:00-04:00",
      "updated_at": "2018-10-23T19:48:44-04:00",
      "summary_html": "The hydration imperative",
      "template_suffix": null,
      "handle": "skin-care-hydration-am",
      "tags": "skincare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28083748936",
      "image": {
        "created_at": "2018-10-23T19:48:44-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/hydration.png?v=1540338524"
      }
    },
    {
      "id": 28087451720,
      "title": "The true measure of humanity",
      "created_at": "2018-09-11T13:36:49-04:00",
      "body_html": "September 11. Growing up that was a date that was <strong>filled with joy and fun</strong>, it was my fathers birthday and that meant cake, and dinner out! September 11 is still my dad's birthday, but for anyone who was around that fateful day in 2001, it has become so much more. <br><br>I imagine every person in America <strong>remembers</strong> that day vividly, where they were when they heard the shocking news that our country had been attacked in the most brutal way. I was in Boston, alone. I had just returned home from a trip to London the night before. It scared me to think that just a mere 10 hours before terrorists boarded flights departing Boston, I was standing at that very same airport. <br><br>I called my father in Karachi as soon as I woke up that morning to wish him a happy birthday and my sister answered, she said, \"I wondered when you would call?\" Here I thought she was being snarky, It was just past 8AM! It was early for me! And she quickly told me, no, turn on the TV. \"What channel?\" i said puzzled?<br><br><strong>\"Any Channel.\"</strong><br><br>It was that moment when I clicked the TV on, life as I knew it was over The second plane smashed into the tower, slicing through it like a knife, and <strong>my heart must have stopped,</strong> along with the hearts of millions of other Americans. It was simply impossible to believe that this was real. <br><br><strong>But it was real.</strong> A day that changed the lives of every single person in our country. There was no question, the harm that was done. But something tremendous happened that day. We saw the true measure of Americans, when complete strangers stood up to fight for one another. People who just the day before were likely mowing the lawn, or going to work, or drinking coffee; ordinary men and women, <strong>who were quietly wearing soldiers uniforms in their hearts</strong>, fought a war they didn't even know they were in, for people they didn't even know the day before. <br><br>These heroes ran into danger to rescue anyone they could, passengers fought to get control to save lives on the ground of anyone they could. Even if the fight meant  their own demise. Firefighters ran in and out of danger over and over to carry victims to safety. People IN the towers and on the planes called their loved ones to say goodbye and tell them, \"<strong>live a good life</strong>\", \"<strong>be happy</strong>.\" Even in the face of <strong>grave peril</strong>, so many <strong>thought of others</strong>. And then all the soldiers, who enlisted or deployed to protect us. The sacrifices of these incredible people, for Americans and citizens of the world they never met, never knew, <strong>it's astonishing. And humbling</strong>. <br><br>Now, think on this for a moment. How many times in your own life, has someone you <strong>KNOW</strong> made a decision that caused you pain, deliberately! How many times has <strong>pettiness</strong> gotten in the way and created<strong> divides</strong> between people? And yet, on this day in history, we saw <strong>strangers lay down their lives for strangers</strong>. Gives a bit of perspective and certainly takes your breath away...<br><br><strong>There are good people in the world. And while on that day we witnessed the worst of humanity, we also witnessed the best of it.</strong><br><br>9/11 was a day that forever changed me. It was a day that taught me that every day <strong>is a gift, and not a right</strong>. It taught me about the kind of person I want to be. That I want to give more to others than I take, I want to lift people, never tear them down. I want to empower others to be fearless and fight for happiness. I want to live a life that is worthy of the sacrifices those strangers made that day for other strangers. <br><br>It is my commitment, to never forget. To <strong>hold this holy lesson</strong> that I took from that day, close to my heart and pass it on to others. That there<strong> IS good in the world even in the darkest of hours</strong>. That the world <strong>changes one by one</strong>, with <strong>each connection</strong>, each of us makes. With every action of good we take for another, we make a difference. <br><br><strong>We cannot change the pas</strong>t, but we <strong>CAN build the future</strong>. I hope that everyday, I earn the footprints I leave behind. <br><br>Live with love, live with grace, humility and generosity of spirit. Be well. <br>XOXO<br>Saira  <br><br><br>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-09-11T22:07:00-04:00",
      "updated_at": "2018-09-19T22:47:59-04:00",
      "summary_html": "The day that changed the world.",
      "template_suffix": null,
      "handle": "never-forget",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28087451720",
      "image": {
        "created_at": "2018-09-19T22:47:59-04:00",
        "alt": "",
        "width": 400,
        "height": 211,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/nevr_forget.jpg?v=1537411679"
      }
    },
    {
      "id": 28011921480,
      "title": "Skin Care Diaries - Clean it up!",
      "created_at": "2018-08-19T19:36:25-04:00",
      "body_html": "<p style=\"float: left;\"><span style=\"color: #000000;\">In the 80’s cleaning your skin consisted of pre-soaked acid pads that promised to eradicate acne and make you glow like a radioactive shaved mouse, and attract all manner of also acne free teenage boys. <img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/Oxy_pad_ad_860eb6fd-0844-4008-a0d4-78113876624e_large.jpg?v=1534803144\" style=\"float: left; margin-top: 25px; margin-right: 25px;\" width=\"318\" height=\"246\"><br><strong>I weep for the tragic abuse all of us subjected our fragile teenage skin to back then</strong>. Thank goodness we know better today. And yes, that IS who you think it is doing an acne pad commercial Circa 1980 something!<br><br></span><span style=\"color: #000000;\">If you are like me, no matter what you do, <strong style=\"color: #000000;\">your skin looks like an oil slick that you could fry an egg on</strong>. Your <strong style=\"color: #000000;\">pores are big enough to swim in</strong>, and mascara from 3 days ago is STILL bleeding onto your face making you look like you just lost a fight over a cupcake.<br></span></p>\r\n<p><br><span style=\"color: #000000;\">Not pretty. </span><br><br><span style=\"color: #000000;\">I was tired of this.<strong> I knew there had to be a way to salvage my sad skin that didn’t involve a face transplant, or constant air brushing on an app</strong>. Note to self, one cannot actually airbrush ones face in real life. </span><span style=\"color: #000000;\">After all the research I chatted about in the skincare 101 post, I started to utilize the highly recommended <strong>double cleanse method.  </strong></span></p>\r\n<p><span style=\"color: #000000;\">Now look, I will be 100% honest with you. My cleaning routine prior to this eye opening education was a Neutrogena makeup wipe. </span><br><br><span style=\"color: #000000;\"><strong>Don’t judge me, you’ve done it</strong>. </span><br><br><span style=\"color: #000000;\">The idea of doing a DOUBLE cleanse seemed like a big time commitment to me. But, I wanted amazing skin, and like an amazing body (no, I do not have that but that is a post for another day) that meant <strong>I had to do a little bit of work</strong>. FINE! Whatever. <strong>Let’s just get to it, shall we. </strong></span></p>\r\n<p style=\"float: right;\"><span style=\"color: #000000;\">Step 1 of a double cleanse <strong>is a make-up and general grossness remover</strong>. <img alt=\"Saira washing face step 1\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/washing_face_step_1_large.jpg?v=1534802069\" style=\"float: left; margin-top: 25px; margin-right: 25px;\" width=\"213\" height=\"284\"><br></span><br><br><span style=\"color: #000000;\">A cleansing balm or oil is the perfect choice for this and will <strong>work to attract excess oil OUT of our pores without drying you our like papier-mâché, the oils also hug nasty yuck on your skin and break down makeup</strong>. The good ones are gentle enough to slather right on your eyes to remove eye makeup. </span><br><br><span style=\"color: #000000;\">Cleansing balms and oils are applied to dry skin usually and massaged in all over your face and NECK. You can add water to help emulsify it more. <strong>For the love of the lord in heaven above do not neglect your neck.<br><br></strong>There is no point in having a well-cared for face<em><strong> sitting on a turkey neck</strong></em>. It matters. don’t skip it.  </span><br><img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/wipe_face_step_1_large.jpg?v=1534802173\" style=\"float: right; margin-left: 25px; margin-bottom: 25px;\" width=\"237\" height=\"316\"><br><span style=\"color: #000000;\">Massage this magical balm or oil into your skin and when done you actually do NOT splash your face with water. Say <u>goodbye </u>to splashing your face ever again. You will use a hand towel, warmed up with water to WIPE this stuff of your face.  You are welcome.<br><br></span><span style=\"color: #000000;\">Step 2 of this process involves a second cleaner. <strong>Listen to me, if it foams you are not allowed to use it. Foam = satan. </strong>Moving on.  </span><span style=\"color: #000000;\">You will want a good cleansing milk for this step. <br><strong><img alt=\"Cleansing milk \" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/cleansing_milk_large.jpg?v=1534802304\" style=\"float: left; margin-right: 25px; margin-top: 25px;\" width=\"176\" height=\"235\"><br><br>A milk is a wonderful choice </strong>because <strong>it won’t suck your pores dry</strong>. These are made from a natural emulsion of waters and fats and work together to <strong>remove any excess dirt, makeup and horrible stuff that can pile up on your skin during the day (and night) leaving your skin fresh, soft and NOT dry.</strong> You will apply the milk to your moist face post balm, and remove with that warm, wet hand towel<br><br></span>That my friends, is the double cleanse. <strong>Believe me, your skin will thank you for this</strong>. Do it twice a day and it’s worth the 2 minutes it will take. I promise. <strong>You cannot skip cleaning your skin</strong>. </p>\r\n<p><br><span style=\"color: #000000;\">The best, healthiest and most radiant skin starts with a solid cleansing routine. You cannot do it once and then not for a week. <strong>You need to commit to this</strong>, </span><strong><span style=\"color: #000000;\">twice a day. Every. Single. Day. No cheating because believe you me, your skin will KNOW. I’ve tried.</span> </strong></p>\r\n<p>I will provide detailed review of each of these products, but for  you eager beavers, here is what I use after exhaustive research. For cleansing oil I use <a href=\"https://amzn.to/2wKGf5S\" title=\"Coconut Oil\">SheaMoisture Extra Virgin coconut oil </a>(and yes I have oily skin) or if I feel like splurging, I use <a href=\"https://amzn.to/2LXPMMK\" title=\"Emma Hardie\">Emma Hardie Moringa Cleansing Balm</a>. <strong>Both do a fantastic job of removing dirt, oils, makeup and other grime from your face</strong>. For cleansing milk, I am a huge fan of <a href=\"https://amzn.to/2NhIqrX\" title=\"Clarins Milk\">Clarins Alpine milk</a>. It is soft, creamy and effective in removing any residual makeup and pollutants without stripping the skin of its natural oils. I grab these usually from Amazon unless Ulta is having a sale, because well, Prime! <br><br> <em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em></p>\r\n<p> </p>\r\n<p> </p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-09-04T16:56:00-04:00",
      "updated_at": "2018-10-23T19:54:38-04:00",
      "summary_html": "Want great skin, sorry dudette, that means you gotta clean it. And NO, a makeup wipe is not sufficient.",
      "template_suffix": null,
      "handle": "skin-care-clean-it-up",
      "tags": "beauty, selfcare, skincare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28011921480",
      "image": {
        "created_at": "2018-10-23T19:54:38-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/wash_your_face.png?v=1540338878"
      }
    },
    {
      "id": 28046098504,
      "title": "Weighted blanket bliss?",
      "created_at": "2018-08-29T14:36:01-04:00",
      "body_html": "<div style=\"float: left;\">I suffer from <strong>horrible, debilitating anxiety</strong>. I am a hypochondriac, and as a result I have difficulty sleeping, calming down and resting. And because I don't sleep, <strong>I am constantly exhausted, run down and burnt out.</strong> It makes even the simplest of daily tasks monumental when you are running on broken sleep, week after week, month after month. <br><img alt=\"insomnia\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/insomnia_large.jpg?v=1535566763\" style=\"margin-top: 25px; margin-left: 25px; margin-bottom: 25px; float: right;\" width=\"198\" height=\"198\"><br>So I set out on a quest to <strong>find a way to relieve my anxiety induced insomnia</strong>, and came across a <a href=\"https://amzn.to/2N1VotL\" title=\"YnM Weighted Blanket\"><span><strong>weighted blanket</strong></span></a>. I had heard of these but had NO idea what they did or how they worked. I did some research and found that they could be a perfect remedy for my anxiety, and thus my inability to sleep! <br><br><a href=\"https://www.healthline.com/health/weighted-blanket-for-anxiety\" title=\"Healthline article RE weighted blankets\">Healthline</a> shares that weighted blankets can relieve anxiety <strong>by creating deep pressure which may help in triggering neurotransmitters dopamine and serotonin.</strong> Both of these hormones promote those happy feelings which can help reduce stress, anxiety and depression. <br><br>The scientific feedback on this is mixed, some swear by it, others say it's malarky. <strong>But I was desperate</strong>. So I researched and picked the <a href=\"https://amzn.to/2N1VotL\" title=\"YnM Weighted blanket\">YnM weighted blanket</a> from Amazon, because well, prime. It has a 4.5 star rating and 1400 plus reviews so I figured it was a good bet. The suggested weight is 10% of your body weight, so for me being 150LBS I selected the 15LBS 60X80 blanket. <a href=\"https://amzn.to/2N1VotL\" title=\"YnM blanket\"><img alt=\"YnM weighted Blanket 15LBS\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/weighted_blanket_Amazon_pic_large.jpg?v=1535566053\" style=\"margin-top: 25px; margin-right: 25px; margin-bottom: 25px; float: left;\" width=\"236\" height=\"236\"></a><br><br>When it arrived, it was packed well, and was HEAVY to pick up. Once I laid under it I was surprised by how light it actually felt, and thought maybe I needed a heavier one. At first I felt bummed, that it didn't feel heavy enough, but <strong>I committed to at least trying it out before writing it off for a heavier version. </strong><br><br>I got a <a href=\"https://amzn.to/2PfYQOQ\" title=\"Minky Cover\">minky cover</a> from YnM on amazon as well, with mermaids. It is so cute and <strong>VERY soft.</strong> I got under the blanket, ready to sleep. I had low expectations because my insomnia is petty intense, but high hopes!<br><br>\n</div>\r\n<div style=\"float: right;\">It still took me 2 hours to fall asleep, but that is normal for me. After falling asleep around 12:30AM, I woke up and thought for sure it was later in the morning with how rested I felt. <strong>I was SHOCKED</strong> when I looked at my phone and it said 6:23AM. <em>What the? </em><br><br>I could probably have woken up, but I was so comfortable and I didn't need to get up so I went back to bed. zzzzzzz. I woke up again and thought it must have been super late, <strong>because again, I felt like I had been asleep for hours</strong>. Nope. it was 9:30AM. Score!! <br><img alt=\"Saira with Blanket\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/minkey_cover_with_face_large.jpg?v=1535588186\" style=\"float: right; margin-top: 25px; margin-bottom: 25px; margin-left: 25px;\" width=\"170\" height=\"226\"><br>While I didn't sleep as many hours as I would have liked,<strong> the hours I DID sleep were deep and more restful than I can remember having in years.</strong> <br><br>The biggest question I got was whether it was hot under the blanket, and personally I can say, I did not find it hot at all.  <strong>I felt very comfortable</strong>. In all my reading the one thing I have found is <strong>most companies will work to ensure their blankets are manufactured with breathable materials</strong> which aim to provide cooling to offset any heating that could arise from weight alone. I slept with the weighted blanket plus a fuzzy blanket for extra comfort and experienced no overheating. <br><br>What can I say, I dig blankets.<br><br>My overall review, after just one night is that this blanket <strong>lived up to expectations.</strong> While it did not help me fall asleep faster, it helped <strong>me stay asleep and helped me sleep SOLID</strong>. I am excited to try it again tonight!!! I personally think I will need to upgrade to a heavier blanket given the severity of my anxiety, but for now this definitely does the trick! <br><br><span style=\"color: #999999;\"><em>Disclosure: As an Amazon Associate I earn from qualifying purchases, however, I will only recommend products that I personally use and have tested.  For more details, please review our disclaimers statements located in the footer menu. </em></span>\n</div>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-08-29T20:21:00-04:00",
      "updated_at": "2018-10-23T19:56:20-04:00",
      "summary_html": "Can a <strong>weighted blanket</strong> make you feel <em>weightless</em>??",
      "template_suffix": null,
      "handle": "weighted-blanket-2",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28046098504",
      "image": {
        "created_at": "2018-10-23T19:56:20-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/weighted_blanket.png?v=1540338980"
      }
    },
    {
      "id": 28011888712,
      "title": "Skin Care Diaries - Intro",
      "created_at": "2018-08-19T18:19:46-04:00",
      "body_html": "<p style=\"float: left;\"><span style=\"color: #000000;\"><img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/skincare_101_pict_medium.jpg?v=1534717153\" style=\"margin-right: 25px; float: left;\">Let me start this by saying if you don’t follow @NicoleKarlLife on Instagram, <strong>go do so right now</strong>. There is <em>no one </em>I trust more to advise me on skincare than this woman.</span><br><br><span style=\"color: #000000;\">I am a crazy skincare person. I am <strong>passionate </strong>about it, I care about it, and I work very hard to understand it. </span><br><br><span style=\"color: #000000;\"><strong>Why?<br><br></strong>Growing up I was <i>that </i>kid who always struggled with her skin. Acne, scarring, sallowness, oiliness, dry patches etc etc. You name it, I struggled with it. Granted, it did not help matter that <strong>the 80’s were <em>all </em>about harsh Oxy pads and Clearasil, which fry skin like an egg on an Arizona summer sidewalk.</strong>  </span></p>\r\n<p style=\"float: right;\"><span style=\"color: #000000;\"><strong>I despised my skin well into my 30’s</strong>. The truth is even my husband didn’t see me without make up until recently. I would wear makeup in the pool, at the beach, I would wake up before him to make sure I had all my scars covered up. Even when I was in labor with each of my kids, I would go into the bathroom hooked up to an IV to <strong>make sure my makeup was on and my</strong> <strong>skin hidden</strong>.<img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/hidden_face_large.jpg?v=1534717351\" style=\"float: right; margin-left: 25px; margin-top: 25px; margin-bottom: 25px;\" width=\"138\" height=\"209\"></span><br><br><span style=\"color: #000000;\">He didn’t care, he would love me even if I looked like DeadPool, but <strong>it wasn’t about him or what he thought. It was about</strong> <strong>me</strong>. I hated feeling so insecure. <br><br>It wasn’t until last year that I searched for answers and a wonderful woman in my life directed me to Nicole Karl where<strong> I was liberated by knowledge.</strong> I read her posts, tried her tips and product suggestions, and then continued to evolve and create a routine that served my specific skin.<br><br> <strong>I do not have perfect skin,</strong> and many of the no make up pictures you will get to see of me will show you my scars, my imperfections, my pores and so forth. But, my skin used to be WAY worse, like, WAY. skin care if a process, an evolution. there is no quick fix, there is no one treatment to undo years of damage. <strong>It takes time and consistency. </strong></span><br><br><span style=\"color: #000000;\">I am going to write a <em>series </em>of posts to <span style=\"text-decoration: underline;\"><strong>first help you understand your skin</strong></span>, and hopefully in some small way share the knowledge I have gathered first from Nicole and then subsequently through extensive reading and trial and error. I will then <strong>provide </strong>product <u>reviews</u> for my <em>personal </em>picks for various skin care needs.</span></p>\r\n<p><span style=\"color: #000000;\">Disclaimer!! I<strong> am not a dermatologist or any other kind of licensed skin care person</strong>. i just read, research and experiment a lot. I'm sharing my own info to hopefully help you stat your own journey to happy skin. Second, <strong>I don’t believe in this only use one skin care routine and one brand crap</strong>. So don't expect any brand loyalty here! <strong>I believe in products that work</strong>, regardless of brand.</span></p>\r\n<p><span style=\"color: #000000;\">Skin needs a series of things to be happy, healthy and radiant. <strong>Cleansing, Exfoliation, Nutrition, Treatment, Hydration </strong>and <strong>Protection</strong>. <br><br>Those are the basics that pretty much every skin type is going to need. As you follow along on this skin care series, I will go into <strong>detail </strong>about the reasons for each one and how you can best fulfill those needs. So read on mighty skin warriors! Read on!</span></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-08-19T18:24:00-04:00",
      "updated_at": "2018-10-23T19:57:27-04:00",
      "summary_html": "<span style=\"color: #000000;\">Demystifying your skin, one step at a time.</span>",
      "template_suffix": null,
      "handle": "skin-care-101",
      "tags": "beauty, selfcare, skincare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/28011888712",
      "image": {
        "created_at": "2018-10-23T19:57:27-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/skincare.png?v=1540339047"
      }
    },
    {
      "id": 27975319624,
      "title": "Dyson Super Sonic?",
      "created_at": "2018-08-03T23:47:30-04:00",
      "body_html": "<p style=\"float: left;\"><span style=\"color: #000000;\"><img alt=\"Dyson Hair Dyer\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/dyson-supersonic-hair-dryer_large.jpg?v=1533354473\" style=\"float: left; margin-right: 10px;\" width=\"239\" height=\"239\">We all know how <strong>incredible Dyson vacuum cleaners are</strong>, they suck up everything and go forever, so you can imagine my excitement when the super hero vacuum company came out with a hair dryer. Praise all things. When I got to Sephora to buy the dryer I was so excited, as I paid $399 I cringed but thought to myself if the stories were true <strong>that it would literally shave time off my blow drying I didn’t care.</strong> Take all my money! So I carried this beast of a dryer to my truck and headed home to take a shower to test the magical dryer.</span></p>\r\n<p><span style=\"color: #000000;\">The unit comes packaged perfectly in an almost Barbie like pink box. It had a diffuser and a focused heat attachment for straightening and these attached with <strong>some pretty strong magnets. No screwing things in, or twisting hoping to get the threads right</strong>. <br><br>How many times have you accidentally screwed the attachments to your dryer on wrong and it goes on all wonky and lop sided? Not with magnets! <strong>Genius!</strong> <br><br>Also genius is the design of the dryer. It’s a cylinder. So you know that feeling when you are drying your hair, <strong>and you accidentally get your hair caught in the back end of the dryer and you smell burning hair?</strong> Or am I the only one? Anyways, back to the point. Brilliant design to protect those luscious locks of yours from getting fried.</span></p>\r\n<p><span style=\"color: #000000;\">So, I am showered, I quickly towel dried my hair and I have applied my hair products to protect me from frizz and heat and all other manner of elements that seem to be out there just to make women’s hair look like Diana Ross circa 1974 on a humid day on a Miami beach. I turn the dryer on, F<strong>rom an ergonomics perspective its awkward</strong>. I think we have all gotten so used to how traditional hair dryers feel in our hand in terms of weight and shape but I kept going.  <strong>The hair dryer has serious power, heat and isn’t too loud. So far so good!</strong></span></p>\r\n<p><span style=\"color: #000000;\">Hmmmmm, this was taking a long time. Given what I had read about the epic Dyson, I<strong> had expected my hair to be much dryer after 10 minutes of blowing</strong>. So I kept going for another 5 minutes and then put the attachment for straightening on. I whipped out my round brush and went to town, still hopeful that I would have magical no frizz and bone dry hair in a matter of minutes. <br><br>Maybe I hadn’t dried it enough with the towel first? I keep going, drying and brushing. <strong>10 minutes later my hand is cramping and my arm is tired.</strong> I decided that after 25 minutes which is already longer than I normally spend drying my hair, the Dyson Dryer did not meet expectations. My hair looked just so so compared to what I normally get with my other dryer (which I will review in a separate post).</span></p>\r\n<p><span style=\"color: #000000;\">For $399 I really expected something more impressive, reduced time, increased shine and manageability, something, anything more than I got. So what is the bottom line? <br><br>For me the Dyson Dryer was a disappointment and I sadly would not recommend it. Having said that, I may be the ONLY person on the planet though who didn't love it!</span></p>\r\n<p><span style=\"color: #000000;\"> </span></p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-08-08T22:18:00-04:00",
      "updated_at": "2018-10-23T20:00:20-04:00",
      "summary_html": "Will the Dyson Dryer dry your hair like their vacuums suck up dog hair?",
      "template_suffix": null,
      "handle": "dyson-super-sonic",
      "tags": "beauty, Hair, product reviews, selfcare",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/27975319624",
      "image": {
        "created_at": "2018-10-23T20:00:20-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/dyson.png?v=1540339220"
      }
    },
    {
      "id": 27987542088,
      "title": "Humor and permanent personal evolution",
      "created_at": "2018-08-07T23:35:11-04:00",
      "body_html": "<img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/intro_photo_medium.jpg?v=1533699351\" style=\"float: left; margin-right: 25px;\">Wecome to my world! The first thing I have to share is that I am a <strong>squirrel</strong>. Yes, that means that I see a shiny object, or a piece of dog hair, or a cute baby and I get distracted. I jump from thought to thought like a squirrel chases nuts, so says my good friend Renea! And she is 100% right. as you follow along on this journey with me through <strong>blogging, fashion, styling</strong> and so on, just don’t be alarmed by my somewhat, fickle train of thought. Eventually, you will grow to love it, I promise!\r\n<p style=\"float: left;\"><br>But what do we do here. I have a lot of things I am interested in, like, a real lot. Everything from <strong>history</strong>, <strong>random news</strong>, <strong>acting</strong>, <strong>books</strong>, <strong>beauty</strong>, <strong>make up</strong>, <strong>skincare</strong>, <strong>fashion</strong> and <strong>styling</strong>, <strong>home décor,</strong> <strong>self -improvement</strong>, <strong>wellness</strong> and <strong>weight loss</strong> and <strong>cooking</strong>, omg food!! Ok you get the point. I like a lot. I talk about a lot. I research about a lot, but two things will be common in all my posts; humor and personal evolution. <br><br>See, I believe it is super important to <strong>laugh</strong>, infact, research has shown in several studies that laughter can lower high blood pressure, boost your immune system, help improve your cardiovascular health, relieve pain AND reduce stress! And that’s just SOME of the amazing health benefits of laughter. Not to mention, it just feels good to laugh. So you will find that humor is something I personally find important so it is definitely a common thread in all our posts regardless of topic. <br><br><img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/dad_large.png?v=1533768090\" style=\"float: left; margin-top: 25px; margin-right: 25px; margin-bottom: 25px;\" width=\"306\" height=\"205\">The second is <strong>personal evolution</strong>. My dad is this super bohemian, yogi type who meditates with monks and frogs in the forests of Sri Lanka. You can imagine that growing up, we had a lot of discussions about mindset, growth, being one with nature and the elements and all manner of other hippie things. I grew up with a very deep respect for the human journey towards something, and that something is not a fixed goal that you get to, and you are done. It is a constant process that is at the <strong>very core of being human</strong>, and it applies to everything from beauty, to fashion, to career and marriage and child rearing. <br><br>We are always growing and learning, and all of our content will be about that journey towards <strong>self-realization</strong>. To feeling amazing about yourself, inside and out, and the ways we all feel good differ from person to person. For one, it could be fitness and healthy eating, for someone else amazing wardrobe style and skincare, for another maybe home decoration and organization, and for those lucky few (like me LOL) ALL THE THINGS ALL THE TIME! <br><br><img alt=\"\" src=\"//cdn.shopify.com/s/files/1/0015/0673/8248/files/family_picture_large.jpg?v=1533780010\" style=\"float: right;\" width=\"248\" height=\"372\">We invite you to be a <strong>part of our family</strong>, and our world. And we hope you enjoy the posts  that we will create for you, which will be like a squirrel  and could range from a product review of the best beauty cleansing balm on the market, to how to make Indian food, and even travel reviews of destinations like Iceland or Turks &amp; Caicos. We like to live a full, jam packed, crazy, <strong>adventurous</strong>, multi-faceted life, and we are excited to have you along for the ride.<br><br>Be sure to check out our community on <a href=\"https://www.facebook.com/groups/1683011801809361/\" title=\"FB group\">Facebook!</a> just click and request to join to see all the fun stuff, our book club, makeup tips, fashion, earrings and more!!!</p>",
      "blog_id": 22281125960,
      "author": "Saira Valley",
      "user_id": 23130144840,
      "published_at": "2018-08-07T23:35:00-04:00",
      "updated_at": "2018-10-23T19:58:44-04:00",
      "summary_html": "What we do around here...",
      "template_suffix": null,
      "handle": "humor-and-a-permeant-personal-evolution",
      "tags": "",
      "admin_graphql_api_id": "gid://shopify/OnlineStoreArticle/27987542088",
      "image": {
        "created_at": "2018-10-23T19:58:44-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "src": "https://cdn.shopify.com/s/files/1/0015/0673/8248/articles/who_am_i.png?v=1540339124"
      }
    }
  ],
  "status": "success"
}
